$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '14.2.0',
          'Headers' => {
                         'animation.h' => 1,
                         'cairo.h' => 1,
                         'calls-dbus.h' => 1,
                         'calls-manager.h' => 1,
                         'end-session-dialog.h' => 1,
                         'fader.h' => 1,
                         'garray.h' => 1,
                         'gbinding.h' => 1,
                         'gcancellable.h' => 1,
                         'gdataset.h' => 1,
                         'gdatetime.h' => 1,
                         'gdbusinterfaceskeleton.h' => 1,
                         'gdbusobjectmanagerclient.h' => 1,
                         'gdbusproxy.h' => 1,
                         'gdesktop-enums.h' => 1,
                         'gdk-pixbuf-core.h' => 1,
                         'gdktypes.h' => 1,
                         'gerror.h' => 1,
                         'ghash.h' => 1,
                         'ginputstream.h' => 1,
                         'giotypes.h' => 1,
                         'glibconfig.h' => 1,
                         'glist.h' => 1,
                         'glistmodel.h' => 1,
                         'gliststore.h' => 1,
                         'gmain.h' => 1,
                         'gnome-session-client-private-dbus.h' => 1,

                                                   'phosh_status_page_set_header@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_status_page_set_title@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_append_to_strv@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_calculate_supported_mode_scales@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_data_uri_to_pixbuf@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_escape_markup@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_file_equal@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_gesture_is_touch@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_get_icon_by_wifi_strength@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_have_gnome_software@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_matches_app_info@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_open_settings_panel@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_remove_from_strv@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_toggle_style_class@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_get_clock@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_get_default@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_get_type@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_local_date@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_new@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_set_default@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_string_for_datetime@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_get_enabled@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_get_state@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_is_hotspot_master@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_set_hotspot_master@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wwan_has_data@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wwan_is_enabled@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wwan_set_data_enabled@@LIBPHOSH_0_45_0' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10507' => {
                                       'BaseType' => '10519',
                                       'Header' => 'gtktypes.h',
                                       'Line' => '46',
                                       'Name' => 'GtkWidget',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '10519' => {
                                       'Header' => 'gtkwidget.h',
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '3663'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '36',
                                                            'type' => '12966'
                                                          }
                                                 },
                                       'Name' => 'struct _GtkWidget',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1128' => {
                                      'BaseType' => '152',
                                      'Header' => 'gtypes.h',
                                      'Line' => '52',
                                      'Name' => 'gchar',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1146842' => {
                                         'BaseType' => '1146855',
                                         'Header' => 'giotypes.h',
                                         'Line' => '521',
                                         'Name' => 'GDBusObjectManagerClient',
                                         'Size' => '32',
                                         'Type' => 'Typedef'
                                       },
                          '1146855' => {
                                         'Header' => 'gdbusobjectmanagerclient.h',
                                         'Line' => '40',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '3359'
                                                            },
                                                     '1' => {
                                                              'name' => 'priv',
                                                              'offset' => '36',
                                                              'type' => '1146964'
                                                            }
                                                   },
                                         'Name' => 'struct _GDBusObjectManagerClient',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '1146947' => {
                                         'BaseType' => '1146959',
                                         'Header' => 'gdbusobjectmanagerclient.h',
                                         'Line' => '38',
                                         'Name' => 'GDBusObjectManagerClientPrivate',
                                         'Type' => 'Typedef'
                                       },
                          '1146959' => {
                                         'Name' => 'struct _GDBusObjectManagerClientPrivate',
                                         'Type' => 'Struct'
                                       },
                          '1146964' => {
                                         'BaseType' => '1146947',
                                         'Name' => 'GDBusObjectManagerClientPrivate*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1157' => {
                                      'BaseType' => '159',
                                      'Header' => 'gtypes.h',
                                      'Line' => '56',
                                      'Name' => 'gboolean',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '11669' => {
                                       'BaseType' => '11681',
                                       'Header' => 'gtkwidget.h',
                                       'Line' => '66',
                                       'Name' => 'GtkWidgetPrivate',
                                       'Type' => 'Typedef'
                                     },
                          '11681' => {
                                       'Name' => 'struct _GtkWidgetPrivate',
                                       'Type' => 'Struct'
                                     },
                          '1171409' => {
                                         'BaseType' => '1171421',
                                         'Header' => 'nm-active-connection.h',
                                         'Line' => '50',
                                         'Name' => 'NMActiveConnection',
                                         'Type' => 'Typedef'
                                       },
                          '1171421' => {
                                         'Name' => 'struct _NMActiveConnection',
                                         'Type' => 'Struct'
                                       },
                          '1171443' => {
                                         'BaseType' => '1171455',
                                         'Header' => 'nm-client.h',
                                         'Line' => '164',
                                         'Name' => 'NMClient',
                                         'Type' => 'Typedef'
                                       },
                          '1171455' => {
                                         'Name' => 'struct _NMClient',
                                         'Type' => 'Struct'
                                       },
                          '1171460' => {
                                         'BaseType' => '1171443',
                                         'Name' => 'NMClient*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1171465' => {
                                         'BaseType' => '1171409',
                                         'Name' => 'NMActiveConnection*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1196487' => {
                                         'BaseType' => '1196499',
                                         'Header' => 'gthread.h',
                                         'Line' => '53',
                                         'Name' => 'GMutex',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1196499' => {
                                         'Header' => 'gthread.h',
                                         'Line' => '60',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'p',
                                                              'offset' => '0',
                                                              'type' => '190'
                                                            },
                                                     '1' => {
                                                              'name' => 'i',
                                                              'offset' => '0',
                                                              'type' => '88675'
                                                            }
                                                   },
                                         'Name' => 'union _GMutex',
                                         'Size' => '8',
                                         'Type' => 'Union'
                                       },
                          '1196711' => {
                                         'BaseType' => '1196723',
                                         'Header' => 'gmain.h',
                                         'Line' => '70',
                                         'Name' => 'GMainContext',
                                         'Type' => 'Typedef'
                                       },
                          '1196723' => {
                                         'Name' => 'struct _GMainContext',
                                         'Type' => 'Struct'
                                       },
                          '1196728' => {
                                         'BaseType' => '1196740',
                                         'Header' => 'gmain.h',
                                         'Line' => '86',
                                         'Name' => 'GSource',
                                         'Size' => '96',
                                         'Type' => 'Typedef'
                                       },
                          '1196740' => {
                                         'Header' => 'gmain.h',
                                         'Line' => '266',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'callback_data',
                                                              'offset' => '0',
                                                              'type' => '190'
                                                            },
                                                     '1' => {
                                                              'name' => 'callback_funcs',
                                                              'offset' => '8',
                                                              'type' => '1197172'
                                                            },
                                                     '10' => {
                                                               'name' => 'next',
                                                               'offset' => '114',
                                                               'type' => '1197167'
                                                             },
                                                     '11' => {
                                                               'name' => 'name',
                                                               'offset' => '128',
                                                               'type' => '2013'
                                                             },
                                                     '12' => {
                                                               'name' => 'priv',
                                                               'offset' => '136',
                                                               'type' => '1197187'
                                                             },
                                                     '2' => {
                                                              'name' => 'source_funcs',
                                                              'offset' => '22',
                                                              'type' => '1197177'
                                                            },
                                                     '3' => {
                                                              'name' => 'ref_count',
                                                              'offset' => '36',
                                                              'type' => '2112'
                                                            },
                                                     '4' => {
                                                              'name' => 'context',
                                                              'offset' => '50',
                                                              'type' => '1197182'
                                                            },
                                                     '5' => {
                                                              'name' => 'priority',
                                                              'offset' => '64',
                                                              'type' => '159'
                                                            },
                                                     '6' => {
                                                              'name' => 'flags',
                                                              'offset' => '68',
                                                              'type' => '2112'
                                                            },
                                                     '7' => {
                                                              'name' => 'source_id',
                                                              'offset' => '72',
                                                              'type' => '2112'
                                                            },
                                                     '8' => {
                                                              'name' => 'poll_fds',
                                                              'offset' => '86',
                                                              'type' => '2389'
                                                            },
                                                     '9' => {
                                                              'name' => 'prev',
                                                              'offset' => '100',
                                                              'type' => '1197167'
                                                            }
                                                   },
                                         'Name' => 'struct _GSource',
                                         'Size' => '96',
                                         'Type' => 'Struct'
                                       },
                          '1196937' => {
                                         'BaseType' => '1196949',
                                         'Header' => 'gmain.h',
                                         'Line' => '87',
                                         'Name' => 'GSourcePrivate',
                                         'Type' => 'Typedef'
                                       },
                          '1196949' => {
                                         'Name' => 'struct _GSourcePrivate',
                                         'Type' => 'Struct'
                                       },
                          '1196954' => {
                                         'BaseType' => '1196966',
                                         'Header' => 'gmain.h',
                                         'Line' => '99',
                                         'Name' => 'GSourceCallbackFuncs',
                                         'Size' => '24',
                                         'Type' => 'Typedef'
                                       },
                          '1196966' => {
                                         'Header' => 'gmain.h',
                                         'Line' => '291',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'ref',
                                                              'offset' => '0',
                                                              'type' => '19456'
                                                            },
                                                     '1' => {
                                                              'name' => 'unref',
                                                              'offset' => '8',
                                                              'type' => '19456'
                                                            },
                                                     '2' => {
                                                              'name' => 'get',
                                                              'offset' => '22',
                                                              'type' => '1197223'
                                                            }
                                                   },
                                         'Name' => 'struct _GSourceCallbackFuncs',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1197023' => {
                                         'BaseType' => '1197040',
                                         'Header' => 'gmain.h',
                                         'Line' => '157',
                                         'Name' => 'GSourceFuncs',
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '1197035' => {
                                         'BaseType' => '1197023',
                                         'Name' => 'GSourceFuncs const',
                                         'Size' => '48',
                                         'Type' => 'Const'
                                       },
                          '1197040' => {
                                         'Header' => 'gmain.h',
                                         'Line' => '398',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'prepare',
                                                              'offset' => '0',
                                                              'type' => '1197241'
                                                            },
                                                     '1' => {
                                                              'name' => 'check',
                                                              'offset' => '8',
                                                              'type' => '1197284'
                                                            },
                                                     '2' => {
                                                              'name' => 'dispatch',
                                                              'offset' => '22',
                                                              'type' => '1197317'
                                                            },
                                                     '3' => {
                                                              'name' => 'finalize',
                                                              'offset' => '36',
                                                              'type' => '1197360'
                                                            },
                                                     '4' => {
                                                              'name' => 'closure_callback',
                                                              'offset' => '50',
                                                              'type' => '19869'
                                                            },
                                                     '5' => {
                                                              'name' => 'closure_marshal',
                                                              'offset' => '64',
                                                              'type' => '1197228'
                                                            }
                                                   },
                                         'Name' => 'struct _GSourceFuncs',
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '1197151' => {
                                         'Name' => 'void(*)(GSource*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1197167'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1197167' => {
                                         'BaseType' => '1196728',
                                         'Name' => 'GSource*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197172' => {
                                         'BaseType' => '1196954',
                                         'Name' => 'GSourceCallbackFuncs*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197177' => {
                                         'BaseType' => '1197035',
                                         'Name' => 'GSourceFuncs const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197182' => {
                                         'BaseType' => '1196711',
                                         'Name' => 'GMainContext*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197187' => {
                                         'BaseType' => '1196937',
                                         'Name' => 'GSourcePrivate*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197218' => {
                                         'BaseType' => '19869',
                                         'Name' => 'GSourceFunc*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197223' => {
                                         'Name' => 'void(*)(gpointer, GSource*, GSourceFunc*, gpointer*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '190'
                                                             },
                                                      '1' => {
                                                               'type' => '1197167'
                                                             },
                                                      '2' => {
                                                               'type' => '1197218'
                                                             },
                                                      '3' => {
                                                               'type' => '2302'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1197228' => {
                                         'BaseType' => '2307',
                                         'Header' => 'gmain.h',
                                         'Line' => '307',
                                         'Name' => 'GSourceDummyMarshal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1197241' => {
                                         'BaseType' => '1197254',
                                         'Header' => 'gmain.h',
                                         'Line' => '333',
                                         'Name' => 'GSourceFuncsPrepareFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1197254' => {
                                         'Name' => 'gboolean(*)(GSource*, gint*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1197167'
                                                             },
                                                      '1' => {
                                                               'type' => '2394'
                                                             }
                                                    },
                                         'Return' => '1157',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1197284' => {
                                         'BaseType' => '1197297',
                                         'Header' => 'gmain.h',
                                         'Line' => '354',
                                         'Name' => 'GSourceFuncsCheckFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1197297' => {
                                         'Name' => 'gboolean(*)(GSource*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1197167'
                                                             }
                                                    },
                                         'Return' => '1157',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1197317' => {
                                         'BaseType' => '1197330',
                                         'Header' => 'gmain.h',
                                         'Line' => '379',
                                         'Name' => 'GSourceFuncsDispatchFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1197330' => {
                                         'Name' => 'gboolean(*)(GSource*, GSourceFunc, gpointer)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1197167'
                                                             },
                                                      '1' => {
                                                               'type' => '19869'
                                                             },
                                                      '2' => {
                                                               'type' => '190'
                                                             }
                                                    },
                                         'Return' => '1157',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1197360' => {
                                         'BaseType' => '1197151',
                                         'Header' => 'gmain.h',
                                         'Line' => '396',
                                         'Name' => 'GSourceFuncsFinalizeFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1212' => {
                                      'BaseType' => '133',
                                      'Header' => 'gtype.h',
                                      'Line' => '427',
                                      'Name' => 'GType',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '126' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '12961' => {
                                       'BaseType' => '10507',
                                       'Name' => 'GtkWidget*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12966' => {
                                       'BaseType' => '11669',
                                       'Name' => 'GtkWidgetPrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '131041' => {
                                        'Name' => 'gboolean(*)(gpointer, gpointer)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '190'
                                                            },
                                                     '1' => {
                                                              'type' => '190'
                                                            }
                                                   },
                                        'Return' => '1157',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '133' => {
                                     'BaseType' => '53',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '83',
                                     'Name' => 'gsize',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '133371' => {
                                        'BaseType' => '133383',
                                        'Header' => 'glistmodel.h',
                                        'Line' => '38',
                                        'Name' => 'GListModel',
                                        'Type' => 'Typedef'
                                      },
                          '133383' => {
                                        'Name' => 'struct _GListModel',
                                        'Type' => 'Struct'
                                      },
                          '133388' => {
                                        'BaseType' => '133371',
                                        'Name' => 'GListModel*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133393' => {
                                        'BaseType' => '133405',
                                        'Header' => 'gliststore.h',
                                        'Line' => '38',
                                        'Name' => 'GListStore',
                                        'Type' => 'Typedef'
                                      },
                          '133405' => {
                                        'Name' => 'struct _GListStore',
                                        'Type' => 'Struct'
                                      },
                          '133422' => {
                                        'BaseType' => '133393',
                                        'Name' => 'GListStore*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133803' => {
                                        'BaseType' => '133815',
                                        'Header' => 'gtkfilterlistmodel.h',
                                        'Line' => '33',
                                        'Name' => 'GtkFilterListModel',
                                        'Type' => 'Typedef'
                                      },
                          '133815' => {
                                        'Line' => '62',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'item_type',
                                                             'offset' => '36',
                                                             'type' => '1212'
                                                           },
                                                    '2' => {
                                                             'name' => 'model',
                                                             'offset' => '50',
                                                             'type' => '133388'
                                                           },
                                                    '3' => {
                                                             'name' => 'filter_func',
                                                             'offset' => '64',
                                                             'type' => '133825'
                                                           },
                                                    '4' => {
                                                             'name' => 'user_data',
                                                             'offset' => '72',
                                                             'type' => '190'
                                                           },
                                                    '5' => {
                                                             'name' => 'user_destroy',
                                                             'offset' => '86',
                                                             'type' => '19444'
                                                           },
                                                    '6' => {
                                                             'name' => 'items',
                                                             'offset' => '100',
                                                             'type' => '3189426'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkFilterListModel',
                                        'Size' => '72',
                                        'Source' => 'gtkfilterlistmodel.c',
                                        'Type' => 'Struct'
                                      },
                          '133820' => {
                                        'BaseType' => '133803',
                                        'Name' => 'GtkFilterListModel*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133825' => {
                                        'BaseType' => '131041',
                                        'Header' => 'gtkfilterlistmodel.h',
                                        'Line' => '46',
                                        'Name' => 'GtkFilterListModelFilterFunc',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '145' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '152' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '159' => {
                                     'BaseType' => '60',
                                     'Header' => 'gtypes.h',
                                     'Line' => '55',
                                     'Name' => 'gint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '161156' => {
                                        'BaseType' => '161168',
                                        'Header' => 'status-page.h',
                                        'Line' => '14',
                                        'Name' => 'PhoshStatusPage',
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '161168' => {
                                        'Header' => 'status-page.h',
                                        'Line' => '14',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '51757'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshStatusPage',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '161617' => {
                                        'BaseType' => '161629',
                                        'Header' => 'status-page-placeholder.h',
                                        'Line' => '15',
                                        'Name' => 'PhoshStatusPagePlaceholder',
                                        'Type' => 'Typedef'
                                      },
                          '161629' => {
                                        'Line' => '37',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '51757'
                                                           },
                                                    '1' => {
                                                             'name' => 'toplevel_box',
                                                             'offset' => '72',
                                                             'type' => '384406'
                                                           },
                                                    '2' => {
                                                             'name' => 'icon',
                                                             'offset' => '86',
                                                             'type' => '606699'
                                                           },
                                                    '3' => {
                                                             'name' => 'icon_name',
                                                             'offset' => '100',
                                                             'type' => '2013'
                                                           },
                                                    '4' => {
                                                             'name' => 'title_label',
                                                             'offset' => '114',
                                                             'type' => '383926'
                                                           },
                                                    '5' => {
                                                             'name' => 'extra_widget',
                                                             'offset' => '128',
                                                             'type' => '12961'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshStatusPagePlaceholder',
                                        'Size' => '88',
                                        'Source' => 'status-page-placeholder.c',
                                        'Type' => 'Struct'
                                      },
                          '161634' => {
                                        'BaseType' => '161617',
                                        'Name' => 'PhoshStatusPagePlaceholder*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '166043' => {
                                        'BaseType' => '2297',
                                        'Name' => 'gchar**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '168946' => {
                                        'BaseType' => '168959',
                                        'Header' => 'giotypes.h',
                                        'Line' => '469',
                                        'Name' => 'GDBusProxy',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '168959' => {
                                        'Header' => 'gdbusproxy.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '36',
                                                             'type' => '169053'
                                                           }
                                                  },
                                        'Name' => 'struct _GDBusProxy',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '169036' => {
                                        'BaseType' => '169048',
                                        'Header' => 'gdbusproxy.h',
                                        'Line' => '43',
                                        'Name' => 'GDBusProxyPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '169048' => {
                                        'Name' => 'struct _GDBusProxyPrivate',
                                        'Type' => 'Struct'
                                      },
                          '169053' => {
                                        'BaseType' => '169036',
                                        'Name' => 'GDBusProxyPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '171' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '178' => {
                                     'Name' => 'double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1833004' => {
                                         'BaseType' => '159',
                                         'Header' => 'gtypes.h',
                                         'Line' => '587',
                                         'Name' => 'gatomicrefcount',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '190' => {
                                     'BaseType' => '145',
                                     'Header' => 'gtypes.h',
                                     'Line' => '109',
                                     'Name' => 'gpointer',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1907541' => {
                                         'BaseType' => '1907554',
                                         'Header' => 'calls-dbus.h',
                                         'Line' => '374',
                                         'Name' => 'PhoshCallsDBusObjectManagerClient',
                                         'Size' => '40',
                                         'Type' => 'Typedef'
                                       },
                          '1907554' => {
                                         'Header' => 'calls-dbus.h',
                                         'Line' => '378',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '1146842'
                                                            },
                                                     '1' => {
                                                              'name' => 'priv',
                                                              'offset' => '50',
                                                              'type' => '1907615'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshCallsDBusObjectManagerClient',
                                         'Size' => '40',
                                         'Type' => 'Struct'
                                       },
                          '1907597' => {
                                         'BaseType' => '1907610',
                                         'Header' => 'calls-dbus.h',
                                         'Line' => '376',
                                         'Name' => 'PhoshCallsDBusObjectManagerClientPrivate',
                                         'Type' => 'Typedef'
                                       },
                          '1907610' => {
                                         'Name' => 'struct _PhoshCallsDBusObjectManagerClientPrivate',
                                         'Type' => 'Struct'
                                       },
                          '1907615' => {
                                         'BaseType' => '1907597',
                                         'Name' => 'PhoshCallsDBusObjectManagerClientPrivate*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1907620' => {
                                         'BaseType' => '1907541',
                                         'Name' => 'PhoshCallsDBusObjectManagerClient*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '19135' => {
                                       'BaseType' => '60',
                                       'Header' => 'glibconfig.h',
                                       'Line' => '56',
                                       'Name' => 'gint32',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '192028' => {
                                        'BaseType' => '192040',
                                        'Header' => 'system-modal.h',
                                        'Line' => '15',
                                        'Name' => 'PhoshSystemModal',
                                        'Size' => '56',
                                        'Type' => 'Typedef'
                                      },
                          '192040' => {
                                        'Header' => 'system-modal.h',
                                        'Line' => '15',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '51853'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshSystemModal',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '192067' => {
                                        'BaseType' => '192079',
                                        'Header' => 'system-modal-dialog.h',
                                        'Line' => '15',
                                        'Name' => 'PhoshSystemModalDialog',
                                        'Size' => '56',
                                        'Type' => 'Typedef'
                                      },
                          '192079' => {
                                        'Header' => 'system-modal-dialog.h',
                                        'Line' => '15',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '192028'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshSystemModalDialog',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '19214' => {
                                       'BaseType' => '60',
                                       'Header' => 'glibconfig.h',
                                       'Line' => '201',
                                       'Name' => 'GPid',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '1932' => {
                                      'BaseType' => '126',
                                      'Header' => 'glibconfig.h',
                                      'Line' => '57',
                                      'Name' => 'guint32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '19389' => {
                                       'BaseType' => '19401',
                                       'Header' => 'gtypes.h',
                                       'Line' => '110',
                                       'Name' => 'gconstpointer',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '19401' => {
                                       'BaseType' => '19406',
                                       'Name' => 'void const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19406' => {
                                       'BaseType' => '1',
                                       'Name' => 'void const',
                                       'Type' => 'Const'
                                     },
                          '19444' => {
                                       'BaseType' => '19456',
                                       'Header' => 'gtypes.h',
                                       'Line' => '140',
                                       'Name' => 'GDestroyNotify',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '19456' => {
                                       'Name' => 'void(*)(gpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '190'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1951' => {
                                      'BaseType' => '46',
                                      'Header' => 'glibconfig.h',
                                      'Line' => '66',
                                      'Name' => 'gint64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19593' => {
                                       'BaseType' => '1932',
                                       'Header' => 'gquark.h',
                                       'Line' => '38',
                                       'Name' => 'GQuark',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '19605' => {
                                       'BaseType' => '19617',
                                       'Header' => 'gerror.h',
                                       'Line' => '43',
                                       'Name' => 'GError',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '19617' => {
                                       'Header' => 'gerror.h',
                                       'Line' => '45',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'domain',
                                                            'offset' => '0',
                                                            'type' => '19593'
                                                          },
                                                   '1' => {
                                                            'name' => 'code',
                                                            'offset' => '4',
                                                            'type' => '159'
                                                          },
                                                   '2' => {
                                                            'name' => 'message',
                                                            'offset' => '8',
                                                            'type' => '2297'
                                                          }
                                                 },
                                       'Name' => 'struct _GError',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1963' => {
                                      'BaseType' => '53',
                                      'Header' => 'glibconfig.h',
                                      'Line' => '67',
                                      'Name' => 'guint64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19670' => {
                                       'BaseType' => '19605',
                                       'Name' => 'GError*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19705' => {
                                       'BaseType' => '19717',
                                       'Header' => 'glist.h',
                                       'Line' => '39',
                                       'Name' => 'GList',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '19717' => {
                                       'Header' => 'glist.h',
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data',
                                                            'offset' => '0',
                                                            'type' => '190'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '19770'
                                                          },
                                                   '2' => {
                                                            'name' => 'prev',
                                                            'offset' => '22',
                                                            'type' => '19770'
                                                          }
                                                 },
                                       'Name' => 'struct _GList',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '19770' => {
                                       'BaseType' => '19705',
                                       'Name' => 'GList*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19775' => {
                                       'BaseType' => '19787',
                                       'Header' => 'ghash.h',
                                       'Line' => '40',
                                       'Name' => 'GHashTable',
                                       'Type' => 'Typedef'
                                     },
                          '19787' => {
                                       'Name' => 'struct _GHashTable',
                                       'Type' => 'Struct'
                                     },
                          '19792' => {
                                       'Name' => 'gboolean(*)(gpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '190'
                                                           }
                                                  },
                                       'Return' => '1157',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '19869' => {
                                       'BaseType' => '19792',
                                       'Header' => 'gmain.h',
                                       'Line' => '199',
                                       'Name' => 'GSourceFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '19886' => {
                                       'BaseType' => '19670',
                                       'Name' => 'GError**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1999' => {
                                      'BaseType' => '126',
                                      'Header' => 'types.h',
                                      'Line' => '42',
                                      'Name' => '__uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2013' => {
                                      'BaseType' => '152',
                                      'Name' => 'char*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2025' => {
                                      'BaseType' => '152',
                                      'Name' => 'char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '2030' => {
                                      'BaseType' => '2025',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '20322' => {
                                       'BaseType' => '19775',
                                       'Name' => 'GHashTable*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2064' => {
                                      'BaseType' => '46',
                                      'Header' => 'gtypes.h',
                                      'Line' => '54',
                                      'Name' => 'glong',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2100' => {
                                      'BaseType' => '53',
                                      'Header' => 'gtypes.h',
                                      'Line' => '60',
                                      'Name' => 'gulong',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2112' => {
                                      'BaseType' => '126',
                                      'Header' => 'gtypes.h',
                                      'Line' => '61',
                                      'Name' => 'guint',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2124' => {
                                      'BaseType' => '171',
                                      'Header' => 'gtypes.h',
                                      'Line' => '63',
                                      'Name' => 'gfloat',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2143' => {
                                      'BaseType' => '178',
                                      'Header' => 'gtypes.h',
                                      'Line' => '64',
                                      'Name' => 'gdouble',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '216099' => {
                                        'Header' => 'animation.h',
                                        'Line' => '30',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PHOSH_ANIMATION_TYPE_EASE_OUT_CUBIC',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PHOSH_ANIMATION_TYPE_EASE_IN_QUINTIC',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'PHOSH_ANIMATION_TYPE_EASE_OUT_QUINTIC',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'PHOSH_ANIMATION_TYPE_EASE_OUT_BOUNCE',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum PhoshAnimationType',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '216111' => {
                                        'BaseType' => '216123',
                                        'Header' => 'animation.h',
                                        'Line' => '32',
                                        'Name' => 'PhoshAnimation',
                                        'Type' => 'Typedef'
                                      },
                          '216123' => {
                                        'Line' => '16',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ref_count',
                                                             'offset' => '0',
                                                             'type' => '1833004'
                                                           },
                                                    '1' => {
                                                             'name' => 'widget',
                                                             'offset' => '8',
                                                             'type' => '12961'
                                                           },
                                                    '10' => {
                                                              'name' => 'done_cb',
                                                              'offset' => '128',
                                                              'type' => '216161'
                                                            },
                                                    '11' => {
                                                              'name' => 'user_data',
                                                              'offset' => '136',
                                                              'type' => '190'
                                                            },
                                                    '2' => {
                                                             'name' => 'value',
                                                             'offset' => '22',
                                                             'type' => '178'
                                                           },
                                                    '3' => {
                                                             'name' => 'value_from',
                                                             'offset' => '36',
                                                             'type' => '178'
                                                           },
                                                    '4' => {
                                                             'name' => 'value_to',
                                                             'offset' => '50',
                                                             'type' => '178'
                                                           },
                                                    '5' => {
                                                             'name' => 'duration',
                                                             'offset' => '64',
                                                             'type' => '1951'
                                                           },
                                                    '6' => {
                                                             'name' => 'type',
                                                             'offset' => '72',
                                                             'type' => '216099'
                                                           },
                                                    '7' => {
                                                             'name' => 'start_time',
                                                             'offset' => '86',
                                                             'type' => '1951'
                                                           },
                                                    '8' => {
                                                             'name' => 'tick_cb_id',
                                                             'offset' => '100',
                                                             'type' => '2112'
                                                           },
                                                    '9' => {
                                                             'name' => 'value_cb',
                                                             'offset' => '114',
                                                             'type' => '216128'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshAnimation',
                                        'Size' => '96',
                                        'Source' => 'animation.c',
                                        'Type' => 'Struct'
                                      },
                          '216128' => {
                                        'BaseType' => '216140',
                                        'Header' => 'animation.h',
                                        'Line' => '34',
                                        'Name' => 'PhoshAnimationValueCallback',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '216140' => {
                                        'Name' => 'void(*)(double, gpointer)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '178'
                                                            },
                                                     '1' => {
                                                              'type' => '190'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '216161' => {
                                        'BaseType' => '19456',
                                        'Header' => 'animation.h',
                                        'Line' => '36',
                                        'Name' => 'PhoshAnimationDoneCallback',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '216173' => {
                                        'BaseType' => '216111',
                                        'Name' => 'PhoshAnimation*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2167396' => {
                                         'BaseType' => '2167408',
                                         'Header' => 'lfb-event.h',
                                         'Line' => '55',
                                         'Name' => 'LfbEvent',
                                         'Type' => 'Typedef'
                                       },
                          '2167408' => {
                                         'Name' => 'struct _LfbEvent',
                                         'Type' => 'Struct'
                                       },
                          '2167425' => {
                                         'BaseType' => '2167396',
                                         'Name' => 'LfbEvent*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '217150' => {
                                        'BaseType' => '217162',
                                        'Header' => 'fader.h',
                                        'Line' => '16',
                                        'Name' => 'PhoshFader',
                                        'Size' => '88',
                                        'Type' => 'Typedef'
                                      },
                          '217162' => {
                                        'Line' => '39',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '51853'
                                                           },
                                                    '1' => {
                                                             'name' => 'monitor',
                                                             'offset' => '86',
                                                             'type' => '52581'
                                                           },
                                                    '2' => {
                                                             'name' => 'style_class',
                                                             'offset' => '100',
                                                             'type' => '2013'
                                                           },
                                                    '3' => {
                                                             'name' => 'fadeout',
                                                             'offset' => '114',
                                                             'type' => '216173'
                                                           },
                                                    '4' => {
                                                             'name' => 'fade_out_time',
                                                             'offset' => '128',
                                                             'type' => '2112'
                                                           },
                                                    '5' => {
                                                             'name' => 'fade_out_type',
                                                             'offset' => '132',
                                                             'type' => '216099'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshFader',
                                        'Size' => '88',
                                        'Source' => 'fader.c',
                                        'Type' => 'Struct'
                                      },
                          '217290' => {
                                        'BaseType' => '217150',
                                        'Name' => 'PhoshFader*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2193' => {
                                      'BaseType' => '2205',
                                      'Header' => 'garray.h',
                                      'Line' => '39',
                                      'Name' => 'GArray',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '2205' => {
                                      'Header' => 'garray.h',
                                      'Line' => '43',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '2297'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '8',
                                                           'type' => '2112'
                                                         }
                                                },
                                      'Name' => 'struct _GArray',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '222919' => {
                                        'BaseType' => '222931',
                                        'Header' => 'gdatetime.h',
                                        'Line' => '122',
                                        'Name' => 'GDateTime',
                                        'Type' => 'Typedef'
                                      },
                          '222931' => {
                                        'Name' => 'struct _GDateTime',
                                        'Type' => 'Struct'
                                      },
                          '223100' => {
                                        'BaseType' => '222919',
                                        'Name' => 'GDateTime*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2245' => {
                                      'BaseType' => '2257',
                                      'Header' => 'garray.h',
                                      'Line' => '41',
                                      'Name' => 'GPtrArray',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '225119' => {
                                        'Header' => 'gdesktop-enums.h',
                                        'Line' => '83',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'G_DESKTOP_CLOCK_FORMAT_24H',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'G_DESKTOP_CLOCK_FORMAT_12H',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum GDesktopClockFormat',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '225131' => {
                                        'BaseType' => '225143',
                                        'Header' => 'wall-clock.h',
                                        'Line' => '18',
                                        'Name' => 'PhoshWallClock',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '225143' => {
                                        'Header' => 'wall-clock.h',
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshWallClock',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '225339' => {
                                        'BaseType' => '225131',
                                        'Name' => 'PhoshWallClock*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2257' => {
                                      'Header' => 'garray.h',
                                      'Line' => '55',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pdata',
                                                           'offset' => '0',
                                                           'type' => '2302'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '8',
                                                           'type' => '2112'
                                                         }
                                                },
                                      'Name' => 'struct _GPtrArray',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '22854' => {
                                       'BaseType' => '22866',
                                       'Header' => 'giotypes.h',
                                       'Line' => '35',
                                       'Name' => 'GAppInfo',
                                       'Type' => 'Typedef'
                                     },
                          '22866' => {
                                       'Name' => 'struct _GAppInfo',
                                       'Type' => 'Struct'
                                     },
                          '22888' => {
                                       'BaseType' => '22900',
                                       'Header' => 'giotypes.h',
                                       'Line' => '40',
                                       'Name' => 'GCancellable',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '22900' => {
                                       'Header' => 'gcancellable.h',
                                       'Line' => '44',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '3359'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '36',
                                                            'type' => '23070'
                                                          }
                                                 },
                                       'Name' => 'struct _GCancellable',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '2297' => {
                                      'BaseType' => '1128',
                                      'Name' => 'gchar*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '22983' => {
                                       'BaseType' => '22888',
                                       'Name' => 'GCancellable*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22993' => {
                                       'BaseType' => '23006',
                                       'Header' => 'giotypes.h',
                                       'Line' => '468',
                                       'Name' => 'GDBusConnection',
                                       'Type' => 'Typedef'
                                     },
                          '23006' => {
                                       'Name' => 'struct _GDBusConnection',
                                       'Type' => 'Struct'
                                     },
                          '2302' => {
                                      'BaseType' => '190',
                                      'Name' => 'gpointer*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '23033' => {
                                       'BaseType' => '22854',
                                       'Name' => 'GAppInfo*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23048' => {
                                       'BaseType' => '22993',
                                       'Name' => 'GDBusConnection*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23053' => {
                                       'BaseType' => '23065',
                                       'Header' => 'gcancellable.h',
                                       'Line' => '42',
                                       'Name' => 'GCancellablePrivate',
                                       'Type' => 'Typedef'
                                     },
                          '23065' => {
                                       'Name' => 'struct _GCancellablePrivate',
                                       'Type' => 'Struct'
                                     },
                          '2307' => {
                                      'Name' => 'void(*)()',
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '23070' => {
                                       'BaseType' => '23053',
                                       'Name' => 'GCancellablePrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2320' => {
                                      'BaseType' => '2332',
                                      'Header' => 'gdataset.h',
                                      'Line' => '38',
                                      'Name' => 'GData',
                                      'Type' => 'Typedef'
                                    },
                          '2332' => {
                                      'Name' => 'struct _GData',
                                      'Type' => 'Struct'
                                    },
                          '2337' => {
                                      'BaseType' => '2349',
                                      'Header' => 'gslist.h',
                                      'Line' => '39',
                                      'Name' => 'GSList',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '2349' => {
                                      'Header' => 'gslist.h',
                                      'Line' => '41',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '190'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '2389'
                                                         }
                                                },
                                      'Name' => 'struct _GSList',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '23842' => {
                                       'BaseType' => '23854',
                                       'Header' => 'shell.h',
                                       'Line' => '20',
                                       'Name' => 'PhoshShell',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '23854' => {
                                       'Header' => 'shell.h',
                                       'Line' => '20',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '3359'
                                                          }
                                                 },
                                       'Name' => 'struct _PhoshShell',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '23881' => {
                                       'BaseType' => '23842',
                                       'Name' => 'PhoshShell*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2389' => {
                                      'BaseType' => '2337',
                                      'Name' => 'GSList*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2394' => {
                                      'BaseType' => '159',
                                      'Name' => 'gint*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '248368' => {
                                        'BaseType' => '166043',
                                        'Header' => 'gstrfuncs.h',
                                        'Line' => '354',
                                        'Name' => 'GStrv',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '2517288' => {
                                         'BaseType' => '2517300',
                                         'Header' => 'quick-setting.h',
                                         'Line' => '15',
                                         'Name' => 'PhoshQuickSetting',
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '2517300' => {
                                         'Header' => 'quick-setting.h',
                                         'Line' => '15',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '262264'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshQuickSetting',
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '2517327' => {
                                         'BaseType' => '2517288',
                                         'Name' => 'PhoshQuickSetting*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2583592' => {
                                         'BaseType' => '161156',
                                         'Name' => 'PhoshStatusPage*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '262264' => {
                                        'BaseType' => '262276',
                                        'Header' => 'gtkbox.h',
                                        'Line' => '47',
                                        'Name' => 'GtkBox',
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '262276' => {
                                        'Header' => 'gtkbox.h',
                                        'Line' => '51',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'container',
                                                             'offset' => '0',
                                                             'type' => '51683'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '64',
                                                             'type' => '262333'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkBox',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '262316' => {
                                        'BaseType' => '262328',
                                        'Header' => 'gtkbox.h',
                                        'Line' => '48',
                                        'Name' => 'GtkBoxPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '262328' => {
                                        'Name' => 'struct _GtkBoxPrivate',
                                        'Type' => 'Struct'
                                      },
                          '262333' => {
                                        'BaseType' => '262316',
                                        'Name' => 'GtkBoxPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '262451' => {
                                        'BaseType' => '262463',
                                        'Header' => 'gtkgesturesingle.h',
                                        'Line' => '39',
                                        'Name' => 'GtkGestureSingle',
                                        'Type' => 'Typedef'
                                      },
                          '262463' => {
                                        'Name' => 'struct _GtkGestureSingle',
                                        'Type' => 'Struct'
                                      },
                          '262658' => {
                                        'BaseType' => '262451',
                                        'Name' => 'GtkGestureSingle*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2652' => {
                                      'BaseType' => '2320',
                                      'Name' => 'GData*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2657' => {
                                      'BaseType' => '2193',
                                      'Name' => 'GArray*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2662' => {
                                      'BaseType' => '2245',
                                      'Name' => 'GPtrArray*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2680' => {
                                      'BaseType' => '2698',
                                      'Header' => 'gtype.h',
                                      'Line' => '431',
                                      'Name' => 'GValue',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '2698' => {
                                      'Header' => 'gvalue.h',
                                      'Line' => '113',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_type',
                                                           'offset' => '0',
                                                           'type' => '1212'
                                                         },
                                                  '1' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '3056'
                                                         }
                                                },
                                      'Name' => 'struct _GValue',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '2714127' => {
                                         'Header' => 'nm-dbus-interface.h',
                                         'Line' => '811',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'NM_ACTIVE_CONNECTION_STATE_UNKNOWN',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'NM_ACTIVE_CONNECTION_STATE_ACTIVATING',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'NM_ACTIVE_CONNECTION_STATE_ACTIVATED',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'NM_ACTIVE_CONNECTION_STATE_DEACTIVATING',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'NM_ACTIVE_CONNECTION_STATE_DEACTIVATED',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum NMActiveConnectionState',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '2738' => {
                                      'BaseType' => '2751',
                                      'Header' => 'gtype.h',
                                      'Line' => '434',
                                      'Name' => 'GTypeClass',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2751' => {
                                      'Header' => 'gtype.h',
                                      'Line' => '451',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_type',
                                                           'offset' => '0',
                                                           'type' => '1212'
                                                         }
                                                },
                                      'Name' => 'struct _GTypeClass',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '2780' => {
                                      'BaseType' => '2793',
                                      'Header' => 'gtype.h',
                                      'Line' => '436',
                                      'Name' => 'GTypeInstance',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2793' => {
                                      'Header' => 'gtype.h',
                                      'Line' => '461',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_class',
                                                           'offset' => '0',
                                                           'type' => '2822'
                                                         }
                                                },
                                      'Name' => 'struct _GTypeInstance',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '2822' => {
                                      'BaseType' => '2738',
                                      'Name' => 'GTypeClass*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2861937' => {
                                         'BaseType' => '2861949',
                                         'Header' => 'nm-access-point.h',
                                         'Line' => '46',
                                         'Name' => 'NMAccessPoint',
                                         'Type' => 'Typedef'
                                       },
                          '2861949' => {
                                         'Name' => 'struct _NMAccessPoint',
                                         'Type' => 'Struct'
                                       },
                          '2862010' => {
                                         'BaseType' => '2861937',
                                         'Name' => 'NMAccessPoint*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2937' => {
                                      'BaseType' => '2680',
                                      'Name' => 'GValue*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2947' => {
                                      'Header' => 'gvalue.h',
                                      'Line' => '119',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'v_int',
                                                           'offset' => '0',
                                                           'type' => '159'
                                                         },
                                                  '1' => {
                                                           'name' => 'v_uint',
                                                           'offset' => '0',
                                                           'type' => '2112'
                                                         },
                                                  '2' => {
                                                           'name' => 'v_long',
                                                           'offset' => '0',
                                                           'type' => '2064'
                                                         },
                                                  '3' => {
                                                           'name' => 'v_ulong',
                                                           'offset' => '0',
                                                           'type' => '2100'
                                                         },
                                                  '4' => {
                                                           'name' => 'v_int64',
                                                           'offset' => '0',
                                                           'type' => '1951'
                                                         },
                                                  '5' => {
                                                           'name' => 'v_uint64',
                                                           'offset' => '0',
                                                           'type' => '1963'
                                                         },
                                                  '6' => {
                                                           'name' => 'v_float',
                                                           'offset' => '0',
                                                           'type' => '2124'
                                                         },
                                                  '7' => {
                                                           'name' => 'v_double',
                                                           'offset' => '0',
                                                           'type' => '2143'
                                                         },
                                                  '8' => {
                                                           'name' => 'v_pointer',
                                                           'offset' => '0',
                                                           'type' => '190'
                                                         }
                                                },
                                      'Name' => 'anon-union-gvalue.h-119',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '296303' => {
                                        'BaseType' => '296316',
                                        'Header' => 'giotypes.h',
                                        'Line' => '470',
                                        'Name' => 'GDBusMethodInvocation',
                                        'Type' => 'Typedef'
                                      },
                          '296316' => {
                                        'Name' => 'struct _GDBusMethodInvocation',
                                        'Type' => 'Struct'
                                      },
                          '296321' => {
                                        'BaseType' => '296334',
                                        'Header' => 'giotypes.h',
                                        'Line' => '516',
                                        'Name' => 'GDBusInterfaceSkeleton',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '296334' => {
                                        'Header' => 'gdbusinterfaceskeleton.h',
                                        'Line' => '40',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '36',
                                                             'type' => '296507'
                                                           }
                                                  },
                                        'Name' => 'struct _GDBusInterfaceSkeleton',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '296485' => {
                                        'BaseType' => '296303',
                                        'Name' => 'GDBusMethodInvocation*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '296490' => {
                                        'BaseType' => '296502',
                                        'Header' => 'gdbusinterfaceskeleton.h',
                                        'Line' => '38',
                                        'Name' => 'GDBusInterfaceSkeletonPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '296502' => {
                                        'Name' => 'struct _GDBusInterfaceSkeletonPrivate',
                                        'Type' => 'Struct'
                                      },
                          '296507' => {
                                        'BaseType' => '296490',
                                        'Name' => 'GDBusInterfaceSkeletonPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '3029243' => {
                                         'Header' => 'notification.h',
                                         'Line' => '23',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'PHOSH_NOTIFICATION_URGENCY_LOW',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'PHOSH_NOTIFICATION_URGENCY_NORMAL',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'PHOSH_NOTIFICATION_URGENCY_CRITICAL',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum PhoshNotificationUrgency',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '3056' => {
                                      'BaseType' => '2947',
                                      'Name' => 'anon-union-gvalue.h-119[2]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '310800' => {
                                        'BaseType' => '4476',
                                        'Name' => 'GdkRectangle const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '311830' => {
                                        'BaseType' => '310800',
                                        'Name' => 'GdkRectangle const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '311835' => {
                                        'BaseType' => '4476',
                                        'Name' => 'GdkRectangle*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '3121494' => {
                                         'BaseType' => '3121507',
                                         'Header' => 'notify-dbus.h',
                                         'Line' => '295',
                                         'Name' => 'PhoshNotifyDBusNotificationsSkeleton',
                                         'Size' => '40',
                                         'Type' => 'Typedef'
                                       },
                          '3121507' => {
                                         'Header' => 'notify-dbus.h',
                                         'Line' => '299',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '296321'
                                                            },
                                                     '1' => {
                                                              'name' => 'priv',
                                                              'offset' => '50',
                                                              'type' => '3121611'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshNotifyDBusNotificationsSkeleton',
                                         'Size' => '40',
                                         'Type' => 'Struct'
                                       },
                          '3121593' => {
                                         'BaseType' => '3121606',
                                         'Header' => 'notify-dbus.h',
                                         'Line' => '297',
                                         'Name' => 'PhoshNotifyDBusNotificationsSkeletonPrivate',
                                         'Type' => 'Typedef'
                                       },
                          '3121606' => {
                                         'Line' => '2034',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'properties',
                                                              'offset' => '0',
                                                              'type' => '2937'
                                                            },
                                                     '1' => {
                                                              'name' => 'changed_properties',
                                                              'offset' => '8',
                                                              'type' => '19770'
                                                            },
                                                     '2' => {
                                                              'name' => 'changed_properties_idle_source',
                                                              'offset' => '22',
                                                              'type' => '1197167'
                                                            },
                                                     '3' => {
                                                              'name' => 'context',
                                                              'offset' => '36',
                                                              'type' => '1197182'
                                                            },
                                                     '4' => {
                                                              'name' => 'lock',
                                                              'offset' => '50',
                                                              'type' => '1196487'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshNotifyDBusNotificationsSkeletonPrivate',
                                         'Size' => '40',
                                         'Source' => 'notify-dbus.c',
                                         'Type' => 'Struct'
                                       },
                          '3121611' => {
                                         'BaseType' => '3121593',
                                         'Name' => 'PhoshNotifyDBusNotificationsSkeletonPrivate*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3121818' => {
                                         'BaseType' => '3121830',
                                         'Header' => 'notify-feedback.h',
                                         'Line' => '20',
                                         'Name' => 'PhoshNotifyFeedback',
                                         'Type' => 'Typedef'
                                       },
                          '3121830' => {
                                         'Line' => '39',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent',
                                                              'offset' => '0',
                                                              'type' => '3359'
                                                            },
                                                     '1' => {
                                                              'name' => 'active_event',
                                                              'offset' => '36',
                                                              'type' => '2167425'
                                                            },
                                                     '2' => {
                                                              'name' => 'inactive_event',
                                                              'offset' => '50',
                                                              'type' => '2167425'
                                                            },
                                                     '3' => {
                                                              'name' => 'list',
                                                              'offset' => '64',
                                                              'type' => '385123'
                                                            },
                                                     '4' => {
                                                              'name' => 'settings',
                                                              'offset' => '72',
                                                              'type' => '51333'
                                                            },
                                                     '5' => {
                                                              'name' => 'wakeup_flags',
                                                              'offset' => '86',
                                                              'type' => '3151451'
                                                            },
                                                     '6' => {
                                                              'name' => 'wakeup_categories',
                                                              'offset' => '100',
                                                              'type' => '248368'
                                                            },
                                                     '7' => {
                                                              'name' => 'wakeup_min_urgency',
                                                              'offset' => '114',
                                                              'type' => '3029243'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshNotifyFeedback',
                                         'Size' => '80',
                                         'Source' => 'notify-feedback.c',
                                         'Type' => 'Struct'
                                       },
                          '3121835' => {
                                         'BaseType' => '3121818',
                                         'Name' => 'PhoshNotifyFeedback*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3122017' => {
                                         'Line' => '71',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'notification',
                                                              'offset' => '0',
                                                              'type' => '756147'
                                                            },
                                                     '1' => {
                                                              'name' => 'action',
                                                              'offset' => '8',
                                                              'type' => '2013'
                                                            }
                                                   },
                                         'Name' => 'anon-struct-notify-manager.c-71',
                                         'Size' => '16',
                                         'Source' => 'notify-manager.c',
                                         'Type' => 'Struct'
                                       },
                          '3151451' => {
                                         'Header' => 'phosh-settings-enums.h',
                                         'Line' => '57',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'PHOSH_NOTIFY_SCREEN_WAKEUP_FLAG_NONE',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'PHOSH_NOTIFY_SCREEN_WAKEUP_FLAG_ANY',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'PHOSH_NOTIFY_SCREEN_WAKEUP_FLAG_URGENCY',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'PHOSH_NOTIFY_SCREEN_WAKEUP_FLAG_CATEGORY',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum PhoshNotifyScreenWakeupFlags',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '3189361' => {
                                         'BaseType' => '3189373',
                                         'Header' => 'gtkrbtreeprivate.h',
                                         'Line' => '29',
                                         'Name' => 'GtkRbTree',
                                         'Type' => 'Typedef'
                                       },
                          '3189373' => {
                                         'Line' => '33',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'ref_count',
                                                              'offset' => '0',
                                                              'type' => '2112'
                                                            },
                                                     '1' => {
                                                              'name' => 'element_size',
                                                              'offset' => '8',
                                                              'type' => '133'
                                                            },
                                                     '2' => {
                                                              'name' => 'augment_size',
                                                              'offset' => '22',
                                                              'type' => '133'
                                                            },
                                                     '3' => {
                                                              'name' => 'augment_func',
                                                              'offset' => '36',
                                                              'type' => '3189378'
                                                            },
                                                     '4' => {
                                                              'name' => 'clear_func',
                                                              'offset' => '50',
                                                              'type' => '19444'
                                                            },
                                                     '5' => {
                                                              'name' => 'clear_augment_func',
                                                              'offset' => '64',
                                                              'type' => '19444'
                                                            },
                                                     '6' => {
                                                              'name' => 'root',
                                                              'offset' => '72',
                                                              'type' => '3199613'
                                                            }
                                                   },
                                         'Name' => 'struct _GtkRbTree',
                                         'Size' => '56',
                                         'Source' => 'gtkrbtree.c',
                                         'Type' => 'Struct'
                                       },
                          '3189378' => {
                                         'BaseType' => '3189390',
                                         'Header' => 'gtkrbtreeprivate.h',
                                         'Line' => '31',
                                         'Name' => 'GtkRbTreeAugmentFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '3189390' => {
                                         'Name' => 'void(*)(GtkRbTree*, gpointer, gpointer, gpointer, gpointer)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3189426'
                                                             },
                                                      '1' => {
                                                               'type' => '190'
                                                             },
                                                      '2' => {
                                                               'type' => '190'
                                                             },
                                                      '3' => {
                                                               'type' => '190'
                                                             },
                                                      '4' => {
                                                               'type' => '190'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '3189426' => {
                                         'BaseType' => '3189361',
                                         'Name' => 'GtkRbTree*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3199531' => {
                                         'BaseType' => '3199543',
                                         'Line' => '31',
                                         'Name' => 'GtkRbNode',
                                         'Size' => '32',
                                         'Source' => 'gtkrbtree.c',
                                         'Type' => 'Typedef'
                                       },
                          '3199543' => {
                                         'Line' => '46',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'left',
                                                              'offset' => '8',
                                                              'type' => '3199613'
                                                            },
                                                     '1' => {
                                                              'name' => 'right',
                                                              'offset' => '22',
                                                              'type' => '3199613'
                                                            },
                                                     '2' => {
                                                              'name' => 'unnamed0',
                                                              'offset' => '36',
                                                              'type' => '3199618'
                                                            }
                                                   },
                                         'Name' => 'struct _GtkRbNode',
                                         'Size' => '32',
                                         'Source' => 'gtkrbtree.c',
                                         'Type' => 'Struct'
                                       },
                          '3199613' => {
                                         'BaseType' => '3199531',
                                         'Name' => 'GtkRbNode*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3199618' => {
                                         'Line' => '55',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_or_tree',
                                                              'offset' => '0',
                                                              'type' => '190'
                                                            },
                                                     '1' => {
                                                              'name' => 'parent',
                                                              'offset' => '0',
                                                              'type' => '3199613'
                                                            },
                                                     '2' => {
                                                              'name' => 'tree',
                                                              'offset' => '0',
                                                              'type' => '3189426'
                                                            }
                                                   },
                                         'Name' => 'anon-union-gtkrbtree.c-55',
                                         'Size' => '8',
                                         'Source' => 'gtkrbtree.c',
                                         'Type' => 'Union'
                                       },
                          '3359' => {
                                      'BaseType' => '3371',
                                      'Header' => 'gobject.h',
                                      'Line' => '192',
                                      'Name' => 'GObject',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '3371' => {
                                      'Header' => 'gobject.h',
                                      'Line' => '252',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_type_instance',
                                                           'offset' => '0',
                                                           'type' => '2780'
                                                         },
                                                  '1' => {
                                                           'name' => 'ref_count',
                                                           'offset' => '8',
                                                           'type' => '2112'
                                                         },
                                                  '2' => {
                                                           'name' => 'qdata',
                                                           'offset' => '22',
                                                           'type' => '2652'
                                                         }
                                                },
                                      'Name' => 'struct _GObject',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '3460330' => {
                                         'BaseType' => '3460342',
                                         'Header' => 'gtypes.h',
                                         'Line' => '114',
                                         'Name' => 'GCompareDataFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '3460342' => {
                                         'Name' => 'gint(*)(gconstpointer, gconstpointer, gpointer)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '19389'
                                                             },
                                                      '1' => {
                                                               'type' => '19389'
                                                             },
                                                      '2' => {
                                                               'type' => '190'
                                                             }
                                                    },
                                         'Return' => '159',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '3476100' => {
                                         'BaseType' => '3476112',
                                         'Header' => 'gtksortlistmodel.h',
                                         'Line' => '33',
                                         'Name' => 'GtkSortListModel',
                                         'Type' => 'Typedef'
                                       },
                          '3476112' => {
                                         'Line' => '50',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '3359'
                                                            },
                                                     '1' => {
                                                              'name' => 'item_type',
                                                              'offset' => '36',
                                                              'type' => '1212'
                                                            },
                                                     '2' => {
                                                              'name' => 'model',
                                                              'offset' => '50',
                                                              'type' => '133388'
                                                            },
                                                     '3' => {
                                                              'name' => 'sort_func',
                                                              'offset' => '64',
                                                              'type' => '3460330'
                                                            },
                                                     '4' => {
                                                              'name' => 'user_data',
                                                              'offset' => '72',
                                                              'type' => '190'
                                                            },
                                                     '5' => {
                                                              'name' => 'user_destroy',
                                                              'offset' => '86',
                                                              'type' => '19444'
                                                            },
                                                     '6' => {
                                                              'name' => 'sorted',
                                                              'offset' => '100',
                                                              'type' => '3554080'
                                                            },
                                                     '7' => {
                                                              'name' => 'unsorted',
                                                              'offset' => '114',
                                                              'type' => '3554080'
                                                            }
                                                   },
                                         'Name' => 'struct _GtkSortListModel',
                                         'Size' => '80',
                                         'Source' => 'gtksortlistmodel.c',
                                         'Type' => 'Struct'
                                       },
                          '3476117' => {
                                         'BaseType' => '3476100',
                                         'Name' => 'GtkSortListModel*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3554041' => {
                                         'BaseType' => '3554053',
                                         'Header' => 'gsequence.h',
                                         'Line' => '32',
                                         'Name' => 'GSequence',
                                         'Type' => 'Typedef'
                                       },
                          '3554053' => {
                                         'Name' => 'struct _GSequence',
                                         'Type' => 'Struct'
                                       },
                          '3554058' => {
                                         'BaseType' => '3554070',
                                         'Header' => 'gsequence.h',
                                         'Line' => '33',
                                         'Name' => 'GSequenceIter',
                                         'Type' => 'Typedef'
                                       },
                          '3554070' => {
                                         'Name' => 'struct _GSequenceNode',
                                         'Type' => 'Struct'
                                       },
                          '3554075' => {
                                         'BaseType' => '3554058',
                                         'Name' => 'GSequenceIter*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3554080' => {
                                         'BaseType' => '3554041',
                                         'Name' => 'GSequence*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '356375' => {
                                        'Header' => 'lockscreen.h',
                                        'Line' => '27',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PHOSH_LOCKSCREEN_PAGE_INFO',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PHOSH_LOCKSCREEN_PAGE_EXTRA',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'PHOSH_LOCKSCREEN_PAGE_UNLOCK',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum PhoshLockscreenPage',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '356387' => {
                                        'BaseType' => '356399',
                                        'Header' => 'lockscreen.h',
                                        'Line' => '31',
                                        'Name' => 'PhoshLockscreen',
                                        'Size' => '56',
                                        'Type' => 'Typedef'
                                      },
                          '356399' => {
                                        'Header' => 'lockscreen.h',
                                        'Line' => '31',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '51853'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshLockscreen',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '356426' => {
                                        'BaseType' => '356387',
                                        'Name' => 'PhoshLockscreen*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '356431' => {
                                        'BaseType' => '356443',
                                        'Header' => 'lockscreen-manager.h',
                                        'Line' => '14',
                                        'Name' => 'PhoshLockscreenManager',
                                        'Size' => '64',
                                        'Type' => 'Typedef'
                                      },
                          '356443' => {
                                        'Line' => '46',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'lockscreen',
                                                             'offset' => '36',
                                                             'type' => '356426'
                                                           },
                                                    '2' => {
                                                             'name' => 'shields',
                                                             'offset' => '50',
                                                             'type' => '2662'
                                                           },
                                                    '3' => {
                                                             'name' => 'locked',
                                                             'offset' => '64',
                                                             'type' => '1157'
                                                           },
                                                    '4' => {
                                                             'name' => 'locking',
                                                             'offset' => '68',
                                                             'type' => '1157'
                                                           },
                                                    '5' => {
                                                             'name' => 'active_time',
                                                             'offset' => '72',
                                                             'type' => '1951'
                                                           },
                                                    '6' => {
                                                             'name' => 'calls_manager',
                                                             'offset' => '86',
                                                             'type' => '356610'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshLockscreenManager',
                                        'Size' => '64',
                                        'Source' => 'lockscreen-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '356583' => {
                                        'BaseType' => '356431',
                                        'Name' => 'PhoshLockscreenManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '356593' => {
                                        'BaseType' => '356605',
                                        'Header' => 'calls-manager.h',
                                        'Line' => '36',
                                        'Name' => 'PhoshCallsManager',
                                        'Type' => 'Typedef'
                                      },
                          '356605' => {
                                        'Line' => '51',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '52803'
                                                           },
                                                    '1' => {
                                                             'name' => 'present',
                                                             'offset' => '36',
                                                             'type' => '1157'
                                                           },
                                                    '2' => {
                                                             'name' => 'incoming',
                                                             'offset' => '40',
                                                             'type' => '1157'
                                                           },
                                                    '3' => {
                                                             'name' => 'active_call',
                                                             'offset' => '50',
                                                             'type' => '2013'
                                                           },
                                                    '4' => {
                                                             'name' => 'om_client',
                                                             'offset' => '64',
                                                             'type' => '1907620'
                                                           },
                                                    '5' => {
                                                             'name' => 'cancel',
                                                             'offset' => '72',
                                                             'type' => '22983'
                                                           },
                                                    '6' => {
                                                             'name' => 'calls',
                                                             'offset' => '86',
                                                             'type' => '20322'
                                                           },
                                                    '7' => {
                                                             'name' => 'calls_store',
                                                             'offset' => '100',
                                                             'type' => '133422'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshCallsManager',
                                        'Size' => '72',
                                        'Source' => 'calls-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '356610' => {
                                        'BaseType' => '356593',
                                        'Name' => 'PhoshCallsManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '3663' => {
                                      'BaseType' => '3371',
                                      'Header' => 'gobject.h',
                                      'Line' => '194',
                                      'Name' => 'GInitiallyUnowned',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '3746272' => {
                                         'Line' => '32',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'is_valid',
                                                              'offset' => '0',
                                                              'type' => '1157'
                                                            },
                                                     '1' => {
                                                              'name' => 'position',
                                                              'offset' => '4',
                                                              'type' => '2112'
                                                            },
                                                     '2' => {
                                                              'name' => 'iter',
                                                              'offset' => '8',
                                                              'type' => '3554075'
                                                            }
                                                   },
                                         'Name' => 'anon-struct-notification-list.c-32',
                                         'Size' => '16',
                                         'Source' => 'notification-list.c',
                                         'Type' => 'Struct'
                                       },
                          '383778' => {
                                        'BaseType' => '383790',
                                        'Header' => 'gtkmisc.h',
                                        'Line' => '46',
                                        'Name' => 'GtkMisc',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '383790' => {
                                        'Header' => 'gtkmisc.h',
                                        'Line' => '50',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'widget',
                                                             'offset' => '0',
                                                             'type' => '10507'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '50',
                                                             'type' => '383847'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkMisc',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '383830' => {
                                        'BaseType' => '383842',
                                        'Header' => 'gtkmisc.h',
                                        'Line' => '47',
                                        'Name' => 'GtkMiscPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '383842' => {
                                        'Name' => 'struct _GtkMiscPrivate',
                                        'Type' => 'Struct'
                                      },
                          '383847' => {
                                        'BaseType' => '383830',
                                        'Name' => 'GtkMiscPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '383852' => {
                                        'BaseType' => '383864',
                                        'Header' => 'gtklabel.h',
                                        'Line' => '46',
                                        'Name' => 'GtkLabel',
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '383864' => {
                                        'Header' => 'gtklabel.h',
                                        'Line' => '52',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'misc',
                                                             'offset' => '0',
                                                             'type' => '383778'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '64',
                                                             'type' => '383921'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkLabel',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '383904' => {
                                        'BaseType' => '383916',
                                        'Header' => 'gtklabel.h',
                                        'Line' => '47',
                                        'Name' => 'GtkLabelPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '383916' => {
                                        'Name' => 'struct _GtkLabelPrivate',
                                        'Type' => 'Struct'
                                      },
                          '383921' => {
                                        'BaseType' => '383904',
                                        'Name' => 'GtkLabelPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '383926' => {
                                        'BaseType' => '383852',
                                        'Name' => 'GtkLabel*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '384406' => {
                                        'BaseType' => '262264',
                                        'Name' => 'GtkBox*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '385106' => {
                                        'BaseType' => '385118',
                                        'Header' => 'notification-list.h',
                                        'Line' => '21',
                                        'Name' => 'PhoshNotificationList',
                                        'Type' => 'Typedef'
                                      },
                          '385118' => {
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'source_list',
                                                             'offset' => '36',
                                                             'type' => '3554080'
                                                           },
                                                    '2' => {
                                                             'name' => 'last',
                                                             'offset' => '50',
                                                             'type' => '3746272'
                                                           },
                                                    '3' => {
                                                             'name' => 'source_map',
                                                             'offset' => '72',
                                                             'type' => '20322'
                                                           },
                                                    '4' => {
                                                             'name' => 'notifications',
                                                             'offset' => '86',
                                                             'type' => '20322'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshNotificationList',
                                        'Size' => '64',
                                        'Source' => 'notification-list.c',
                                        'Type' => 'Struct'
                                      },
                          '385123' => {
                                        'BaseType' => '385106',
                                        'Name' => 'PhoshNotificationList*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '385128' => {
                                        'BaseType' => '385140',
                                        'Header' => 'notify-manager.h',
                                        'Line' => '20',
                                        'Name' => 'PhoshNotifyManager',
                                        'Type' => 'Typedef'
                                      },
                          '385140' => {
                                        'Line' => '58',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '3121494'
                                                           },
                                                    '1' => {
                                                             'name' => 'dbus_name_id',
                                                             'offset' => '64',
                                                             'type' => '60'
                                                           },
                                                    '2' => {
                                                             'name' => 'next_id',
                                                             'offset' => '68',
                                                             'type' => '2112'
                                                           },
                                                    '3' => {
                                                             'name' => 'unknown_source',
                                                             'offset' => '72',
                                                             'type' => '2112'
                                                           },
                                                    '4' => {
                                                             'name' => 'show_banners',
                                                             'offset' => '82',
                                                             'type' => '1157'
                                                           },
                                                    '5' => {
                                                             'name' => 'app_children',
                                                             'offset' => '86',
                                                             'type' => '248368'
                                                           },
                                                    '6' => {
                                                             'name' => 'settings',
                                                             'offset' => '100',
                                                             'type' => '51333'
                                                           },
                                                    '7' => {
                                                             'name' => 'unlock_notify',
                                                             'offset' => '114',
                                                             'type' => '3122017'
                                                           },
                                                    '8' => {
                                                             'name' => 'list',
                                                             'offset' => '136',
                                                             'type' => '385123'
                                                           },
                                                    '9' => {
                                                             'name' => 'feedback',
                                                             'offset' => '150',
                                                             'type' => '3121835'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshNotifyManager',
                                        'Size' => '104',
                                        'Source' => 'notify-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '385145' => {
                                        'BaseType' => '385128',
                                        'Name' => 'PhoshNotifyManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '413301' => {
                                        'BaseType' => '60',
                                        'Header' => 'types.h',
                                        'Line' => '41',
                                        'Name' => '__int32_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '413753' => {
                                        'BaseType' => '413301',
                                        'Header' => 'stdint-intn.h',
                                        'Line' => '26',
                                        'Name' => 'int32_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '418383' => {
                                        'BaseType' => '60',
                                        'Name' => 'int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '419600' => {
                                        'BaseType' => '419613',
                                        'Header' => 'phosh-display-dbus.h',
                                        'Line' => '466',
                                        'Name' => 'PhoshDBusDisplayConfigSkeleton',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '419613' => {
                                        'Header' => 'phosh-display-dbus.h',
                                        'Line' => '470',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '296321'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '50',
                                                             'type' => '419717'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusDisplayConfigSkeleton',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '419699' => {
                                        'BaseType' => '419712',
                                        'Header' => 'phosh-display-dbus.h',
                                        'Line' => '468',
                                        'Name' => 'PhoshDBusDisplayConfigSkeletonPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '419712' => {
                                        'Line' => '3534',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'properties',
                                                             'offset' => '0',
                                                             'type' => '2937'
                                                           },
                                                    '1' => {
                                                             'name' => 'changed_properties',
                                                             'offset' => '8',
                                                             'type' => '19770'
                                                           },
                                                    '2' => {
                                                             'name' => 'changed_properties_idle_source',
                                                             'offset' => '22',
                                                             'type' => '1197167'
                                                           },
                                                    '3' => {
                                                             'name' => 'context',
                                                             'offset' => '36',
                                                             'type' => '1197182'
                                                           },
                                                    '4' => {
                                                             'name' => 'lock',
                                                             'offset' => '50',
                                                             'type' => '1196487'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusDisplayConfigSkeletonPrivate',
                                        'Size' => '40',
                                        'Source' => 'phosh-display-dbus.c',
                                        'Type' => 'Struct'
                                      },
                          '419717' => {
                                        'BaseType' => '419699',
                                        'Name' => 'PhoshDBusDisplayConfigSkeletonPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '419927' => {
                                        'Header' => 'wayland-client-protocol.h',
                                        'Line' => '5705',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_NORMAL',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_90',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_180',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_270',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_FLIPPED',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_FLIPPED_90',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_FLIPPED_180',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_FLIPPED_270',
                                                             'value' => '7'
                                                           }
                                                  },
                                        'Name' => 'enum wl_output_transform',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '420123' => {
                                        'BaseType' => '420128',
                                        'Name' => 'struct zwlr_output_head_v1*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '420128' => {
                                        'Name' => 'struct zwlr_output_head_v1',
                                        'Type' => 'Struct'
                                      },
                          '420185' => {
                                        'BaseType' => '420190',
                                        'Name' => 'struct zwlr_output_mode_v1*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '420190' => {
                                        'Name' => 'struct zwlr_output_mode_v1',
                                        'Type' => 'Struct'
                                      },
                          '421083' => {
                                        'BaseType' => '421095',
                                        'Header' => 'sensor-proxy-manager.h',
                                        'Line' => '13',
                                        'Name' => 'PhoshSensorProxyManager',
                                        'Type' => 'Typedef'
                                      },
                          '421095' => {
                                        'Line' => '31',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '696689'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshSensorProxyManager',
                                        'Size' => '40',
                                        'Source' => 'sensor-proxy-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '421100' => {
                                        'BaseType' => '421083',
                                        'Name' => 'PhoshSensorProxyManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '421367' => {
                                        'BaseType' => '421379',
                                        'Header' => 'head-priv.h',
                                        'Line' => '21',
                                        'Name' => 'PhoshHead',
                                        'Size' => '168',
                                        'Type' => 'Typedef'
                                      },
                          '421379' => {
                                        'Header' => 'head-priv.h',
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'name',
                                                             'offset' => '36',
                                                             'type' => '2297'
                                                           },
                                                    '10' => {
                                                              'name' => 'transform',
                                                              'offset' => '132',
                                                              'type' => '419927'
                                                            },
                                                    '11' => {
                                                              'name' => 'scale',
                                                              'offset' => '136',
                                                              'type' => '178'
                                                            },
                                                    '12' => {
                                                              'name' => 'mode',
                                                              'offset' => '150',
                                                              'type' => '421873'
                                                            },
                                                    '13' => {
                                                              'name' => 'modes',
                                                              'offset' => '260',
                                                              'type' => '2662'
                                                            },
                                                    '14' => {
                                                              'name' => 'pending',
                                                              'offset' => '274',
                                                              'type' => '421772'
                                                            },
                                                    '15' => {
                                                              'name' => 'conn_type',
                                                              'offset' => '338',
                                                              'type' => '52119'
                                                            },
                                                    '16' => {
                                                              'name' => 'wlr_head',
                                                              'offset' => '352',
                                                              'type' => '420123'
                                                            },
                                                    '2' => {
                                                             'name' => 'description',
                                                             'offset' => '50',
                                                             'type' => '2297'
                                                           },
                                                    '3' => {
                                                             'name' => 'vendor',
                                                             'offset' => '64',
                                                             'type' => '2297'
                                                           },
                                                    '4' => {
                                                             'name' => 'product',
                                                             'offset' => '72',
                                                             'type' => '2297'
                                                           },
                                                    '5' => {
                                                             'name' => 'serial',
                                                             'offset' => '86',
                                                             'type' => '2297'
                                                           },
                                                    '6' => {
                                                             'name' => 'enabled',
                                                             'offset' => '100',
                                                             'type' => '1157'
                                                           },
                                                    '7' => {
                                                             'name' => 'phys',
                                                             'offset' => '104',
                                                             'type' => '421732'
                                                           },
                                                    '8' => {
                                                             'name' => 'x',
                                                             'offset' => '118',
                                                             'type' => '413753'
                                                           },
                                                    '9' => {
                                                             'name' => 'y',
                                                             'offset' => '128',
                                                             'type' => '413753'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshHead',
                                        'Size' => '168',
                                        'Type' => 'Struct'
                                      },
                          '421610' => {
                                        'BaseType' => '421367',
                                        'Name' => 'PhoshHead*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '421615' => {
                                        'Header' => 'head-priv.h',
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'wlr_mode',
                                                             'offset' => '0',
                                                             'type' => '420185'
                                                           },
                                                    '1' => {
                                                             'name' => 'head',
                                                             'offset' => '8',
                                                             'type' => '421610'
                                                           },
                                                    '2' => {
                                                             'name' => 'width',
                                                             'offset' => '22',
                                                             'type' => '413753'
                                                           },
                                                    '3' => {
                                                             'name' => 'height',
                                                             'offset' => '32',
                                                             'type' => '413753'
                                                           },
                                                    '4' => {
                                                             'name' => 'refresh',
                                                             'offset' => '36',
                                                             'type' => '413753'
                                                           },
                                                    '5' => {
                                                             'name' => 'preferred',
                                                             'offset' => '40',
                                                             'type' => '1157'
                                                           },
                                                    '6' => {
                                                             'name' => 'name',
                                                             'offset' => '50',
                                                             'type' => '2013'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshHeadMode',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '421720' => {
                                        'BaseType' => '421615',
                                        'Header' => 'head-priv.h',
                                        'Line' => '34',
                                        'Name' => 'PhoshHeadMode',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '421732' => {
                                        'Header' => 'head-priv.h',
                                        'Line' => '44',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'width',
                                                             'offset' => '0',
                                                             'type' => '413753'
                                                           },
                                                    '1' => {
                                                             'name' => 'height',
                                                             'offset' => '4',
                                                             'type' => '413753'
                                                           }
                                                  },
                                        'Name' => 'struct PhoshPhysicalSize',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '421772' => {
                                        'Header' => 'head-priv.h',
                                        'Line' => '54',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'x',
                                                             'offset' => '0',
                                                             'type' => '413753'
                                                           },
                                                    '1' => {
                                                             'name' => 'y',
                                                             'offset' => '4',
                                                             'type' => '413753'
                                                           },
                                                    '2' => {
                                                             'name' => 'transform',
                                                             'offset' => '8',
                                                             'type' => '419927'
                                                           },
                                                    '3' => {
                                                             'name' => 'mode',
                                                             'offset' => '22',
                                                             'type' => '421873'
                                                           },
                                                    '4' => {
                                                             'name' => 'scale',
                                                             'offset' => '36',
                                                             'type' => '178'
                                                           },
                                                    '5' => {
                                                             'name' => 'enabled',
                                                             'offset' => '50',
                                                             'type' => '1157'
                                                           },
                                                    '6' => {
                                                             'name' => 'seen',
                                                             'offset' => '54',
                                                             'type' => '1157'
                                                           }
                                                  },
                                        'Name' => 'struct PhoshHeadStatePending',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '421873' => {
                                        'BaseType' => '421720',
                                        'Name' => 'PhoshHeadMode*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '421936' => {
                                        'BaseType' => '421948',
                                        'Header' => 'gsd-color-dbus.h',
                                        'Line' => '26',
                                        'Name' => 'PhoshDBusColor',
                                        'Type' => 'Typedef'
                                      },
                          '421948' => {
                                        'Name' => 'struct _PhoshDBusColor',
                                        'Type' => 'Struct'
                                      },
                          '421953' => {
                                        'BaseType' => '421936',
                                        'Name' => 'PhoshDBusColor*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '4232' => {
                                      'BaseType' => '1999',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '424884' => {
                                        'BaseType' => '171',
                                        'Name' => 'float*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '4312' => {
                                      'Header' => 'cairo.h',
                                      'Line' => '532',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x',
                                                           'offset' => '0',
                                                           'type' => '60'
                                                         },
                                                  '1' => {
                                                           'name' => 'y',
                                                           'offset' => '4',
                                                           'type' => '60'
                                                         },
                                                  '2' => {
                                                           'name' => 'width',
                                                           'offset' => '8',
                                                           'type' => '60'
                                                         },
                                                  '3' => {
                                                           'name' => 'height',
                                                           'offset' => '18',
                                                           'type' => '60'
                                                         }
                                                },
                                      'Name' => 'struct _cairo_rectangle_int',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4379' => {
                                      'BaseType' => '4312',
                                      'Header' => 'cairo.h',
                                      'Line' => '535',
                                      'Name' => 'cairo_rectangle_int_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '4476' => {
                                      'BaseType' => '4379',
                                      'Header' => 'gdktypes.h',
                                      'Line' => '93',
                                      'Name' => 'GdkRectangle',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '455039' => {
                                        'BaseType' => '455051',
                                        'Header' => 'gstring.h',
                                        'Line' => '43',
                                        'Name' => 'GString',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '455051' => {
                                        'Header' => 'gstring.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'str',
                                                             'offset' => '0',
                                                             'type' => '2297'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '133'
                                                           },
                                                    '2' => {
                                                             'name' => 'allocated_len',
                                                             'offset' => '22',
                                                             'type' => '133'
                                                           }
                                                  },
                                        'Name' => 'struct _GString',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '455104' => {
                                        'BaseType' => '455039',
                                        'Name' => 'GString*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '457364' => {
                                        'BaseType' => '457376',
                                        'Header' => 'giotypes.h',
                                        'Line' => '97',
                                        'Name' => 'GInputStream',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '457376' => {
                                        'Header' => 'ginputstream.h',
                                        'Line' => '44',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '36',
                                                             'type' => '457548'
                                                           }
                                                  },
                                        'Name' => 'struct _GInputStream',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '457521' => {
                                        'BaseType' => '457364',
                                        'Name' => 'GInputStream*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '457531' => {
                                        'BaseType' => '457543',
                                        'Header' => 'ginputstream.h',
                                        'Line' => '42',
                                        'Name' => 'GInputStreamPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '457543' => {
                                        'Name' => 'struct _GInputStreamPrivate',
                                        'Type' => 'Struct'
                                      },
                          '457548' => {
                                        'BaseType' => '457531',
                                        'Name' => 'GInputStreamPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '457863' => {
                                        'BaseType' => '457875',
                                        'Header' => 'nm-device-wifi.h',
                                        'Line' => '39',
                                        'Name' => 'NMDeviceWifi',
                                        'Type' => 'Typedef'
                                      },
                          '457875' => {
                                        'Name' => 'struct _NMDeviceWifi',
                                        'Type' => 'Struct'
                                      },
                          '457880' => {
                                        'BaseType' => '457863',
                                        'Name' => 'NMDeviceWifi*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '46' => {
                                    'Name' => 'long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '51061' => {
                                       'BaseType' => '51073',
                                       'Header' => 'giotypes.h',
                                       'Line' => '62',
                                       'Name' => 'GSettings',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '51073' => {
                                       'Header' => 'gsettings.h',
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '3359'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '36',
                                                            'type' => '51338'
                                                          }
                                                 },
                                       'Name' => 'struct _GSettings',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '51165' => {
                                       'BaseType' => '51177',
                                       'Header' => 'giotypes.h',
                                       'Line' => '74',
                                       'Name' => 'GFile',
                                       'Type' => 'Typedef'
                                     },
                          '51177' => {
                                       'Name' => 'struct _GFile',
                                       'Type' => 'Struct'
                                     },
                          '51262' => {
                                       'BaseType' => '51165',
                                       'Name' => 'GFile*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51316' => {
                                       'BaseType' => '51328',
                                       'Header' => 'gsettings.h',
                                       'Line' => '44',
                                       'Name' => 'GSettingsPrivate',
                                       'Type' => 'Typedef'
                                     },
                          '51328' => {
                                       'Name' => 'struct _GSettingsPrivate',
                                       'Type' => 'Struct'
                                     },
                          '51333' => {
                                       'BaseType' => '51061',
                                       'Name' => 'GSettings*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51338' => {
                                       'BaseType' => '51316',
                                       'Name' => 'GSettingsPrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51604' => {
                                       'BaseType' => '51616',
                                       'Header' => 'gtktypes.h',
                                       'Line' => '48',
                                       'Name' => 'GtkWindow',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '51616' => {
                                       'Header' => 'gtkwindow.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bin',
                                                            'offset' => '0',
                                                            'type' => '51757'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '72',
                                                            'type' => '51848'
                                                          }
                                                 },
                                       'Name' => 'struct _GtkWindow',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '51683' => {
                                       'BaseType' => '51695',
                                       'Header' => 'gtkcontainer.h',
                                       'Line' => '45',
                                       'Name' => 'GtkContainer',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '51695' => {
                                       'Header' => 'gtkcontainer.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'widget',
                                                            'offset' => '0',
                                                            'type' => '10507'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '50',
                                                            'type' => '51752'
                                                          }
                                                 },
                                       'Name' => 'struct _GtkContainer',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '51735' => {
                                       'BaseType' => '51747',
                                       'Header' => 'gtkcontainer.h',
                                       'Line' => '46',
                                       'Name' => 'GtkContainerPrivate',
                                       'Type' => 'Typedef'
                                     },
                          '51747' => {
                                       'Name' => 'struct _GtkContainerPrivate',
                                       'Type' => 'Struct'
                                     },
                          '51752' => {
                                       'BaseType' => '51735',
                                       'Name' => 'GtkContainerPrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51757' => {
                                       'BaseType' => '51769',
                                       'Header' => 'gtkbin.h',
                                       'Line' => '45',
                                       'Name' => 'GtkBin',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '51769' => {
                                       'Header' => 'gtkbin.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'container',
                                                            'offset' => '0',
                                                            'type' => '51683'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '64',
                                                            'type' => '51826'
                                                          }
                                                 },
                                       'Name' => 'struct _GtkBin',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '51809' => {
                                       'BaseType' => '51821',
                                       'Header' => 'gtkbin.h',
                                       'Line' => '46',
                                       'Name' => 'GtkBinPrivate',
                                       'Type' => 'Typedef'
                                     },
                          '51821' => {
                                       'Name' => 'struct _GtkBinPrivate',
                                       'Type' => 'Struct'
                                     },
                          '51826' => {
                                       'BaseType' => '51809',
                                       'Name' => 'GtkBinPrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51831' => {
                                       'BaseType' => '51843',
                                       'Header' => 'gtkwindow.h',
                                       'Line' => '46',
                                       'Name' => 'GtkWindowPrivate',
                                       'Type' => 'Typedef'
                                     },
                          '51843' => {
                                       'Name' => 'struct _GtkWindowPrivate',
                                       'Type' => 'Struct'
                                     },
                          '51848' => {
                                       'BaseType' => '51831',
                                       'Name' => 'GtkWindowPrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51853' => {
                                       'BaseType' => '51865',
                                       'Header' => 'layersurface.h',
                                       'Line' => '15',
                                       'Name' => 'PhoshLayerSurface',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '51865' => {
                                       'Header' => 'layersurface.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '51604'
                                                          }
                                                 },
                                       'Name' => 'struct _PhoshLayerSurface',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '51897' => {
                                       'BaseType' => '51902',
                                       'Name' => 'struct wl_output*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51902' => {
                                       'Name' => 'struct wl_output',
                                       'Type' => 'Struct'
                                     },
                          '51948' => {
                                       'BaseType' => '51953',
                                       'Name' => 'struct zwlr_gamma_control_v1*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51953' => {
                                       'Name' => 'struct zwlr_gamma_control_v1',
                                       'Type' => 'Struct'
                                     },
                          '51958' => {
                                       'BaseType' => '51963',
                                       'Name' => 'struct zwlr_output_power_v1*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51963' => {
                                       'Name' => 'struct zwlr_output_power_v1',
                                       'Type' => 'Struct'
                                     },
                          '51968' => {
                                       'BaseType' => '51973',
                                       'Name' => 'struct zxdg_output_v1*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51973' => {
                                       'Name' => 'struct zxdg_output_v1',
                                       'Type' => 'Struct'
                                     },
                          '52000' => {
                                       'Header' => 'monitor.h',
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_Unknown',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_VGA',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DisplayPort',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_HDMIA',
                                                             'value' => '11'
                                                           },
                                                   '12' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_HDMIB',
                                                             'value' => '12'
                                                           },
                                                   '13' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_TV',
                                                             'value' => '13'
                                                           },
                                                   '14' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_eDP',
                                                             'value' => '14'
                                                           },
                                                   '15' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_VIRTUAL',
                                                             'value' => '15'
                                                           },
                                                   '16' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DSI',
                                                             'value' => '16'
                                                           },
                                                   '2' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DVII',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DVID',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DVIA',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_Composite',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_SVIDEO',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_LVDS',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_Component',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_9PinDIN',
                                                            'value' => '9'
                                                          }
                                                 },
                                       'Name' => 'enum _PhoshMonitorConnectorType',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '52119' => {
                                       'BaseType' => '52000',
                                       'Header' => 'monitor.h',
                                       'Line' => '60',
                                       'Name' => 'PhoshMonitorConnectorType',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '52131' => {
                                       'Header' => 'monitor.h',
                                       'Line' => '103',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PHOSH_MONITOR_POWER_SAVE_MODE_OFF',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PHOSH_MONITOR_POWER_SAVE_MODE_ON',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum _PhoshMonitorPowerSaveMode',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '52160' => {
                                       'BaseType' => '52131',
                                       'Header' => 'monitor.h',
                                       'Line' => '106',
                                       'Name' => 'PhoshMonitorPowerSaveMode',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '52172' => {
                                       'Header' => 'monitor.h',
                                       'Line' => '122',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'x',
                                                            'offset' => '0',
                                                            'type' => '19135'
                                                          },
                                                   '1' => {
                                                            'name' => 'y',
                                                            'offset' => '4',
                                                            'type' => '19135'
                                                          },
                                                   '2' => {
                                                            'name' => 'width',
                                                            'offset' => '8',
                                                            'type' => '19135'
                                                          },
                                                   '3' => {
                                                            'name' => 'height',
                                                            'offset' => '18',
                                                            'type' => '19135'
                                                          }
                                                 },
                                       'Name' => 'struct PhoshLogicalSize',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '52234' => {
                                       'Header' => 'monitor.h',
                                       'Line' => '110',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent',
                                                            'offset' => '0',
                                                            'type' => '3359'
                                                          },
                                                   '1' => {
                                                            'name' => 'wl_output',
                                                            'offset' => '36',
                                                            'type' => '51897'
                                                          },
                                                   '10' => {
                                                             'name' => 'transform',
                                                             'offset' => '114',
                                                             'type' => '19135'
                                                           },
                                                   '11' => {
                                                             'name' => 'logical',
                                                             'offset' => '118',
                                                             'type' => '52172'
                                                           },
                                                   '12' => {
                                                             'name' => 'width_mm',
                                                             'offset' => '146',
                                                             'type' => '60'
                                                           },
                                                   '13' => {
                                                             'name' => 'height_mm',
                                                             'offset' => '150',
                                                             'type' => '60'
                                                           },
                                                   '14' => {
                                                             'name' => 'vendor',
                                                             'offset' => '260',
                                                             'type' => '2013'
                                                           },
                                                   '15' => {
                                                             'name' => 'product',
                                                             'offset' => '274',
                                                             'type' => '2013'
                                                           },
                                                   '16' => {
                                                             'name' => 'description',
                                                             'offset' => '288',
                                                             'type' => '2013'
                                                           },
                                                   '17' => {
                                                             'name' => 'modes',
                                                             'offset' => '296',
                                                             'type' => '2657'
                                                           },
                                                   '18' => {
                                                             'name' => 'current_mode',
                                                             'offset' => '310',
                                                             'type' => '2112'
                                                           },
                                                   '19' => {
                                                             'name' => 'preferred_mode',
                                                             'offset' => '320',
                                                             'type' => '2112'
                                                           },
                                                   '2' => {
                                                            'name' => 'xdg_output',
                                                            'offset' => '50',
                                                            'type' => '51968'
                                                          },
                                                   '20' => {
                                                             'name' => 'name',
                                                             'offset' => '324',
                                                             'type' => '2013'
                                                           },
                                                   '21' => {
                                                             'name' => 'conn_type',
                                                             'offset' => '338',
                                                             'type' => '52119'
                                                           },
                                                   '22' => {
                                                             'name' => 'wl_output_done',
                                                             'offset' => '342',
                                                             'type' => '1157'
                                                           },
                                                   '23' => {
                                                             'name' => 'gamma_control',
                                                             'offset' => '352',
                                                             'type' => '51948'
                                                           },
                                                   '24' => {
                                                             'name' => 'n_gamma_entries',
                                                             'offset' => '360',
                                                             'type' => '1932'
                                                           },
                                                   '3' => {
                                                            'name' => 'wlr_output_power',
                                                            'offset' => '64',
                                                            'type' => '51958'
                                                          },
                                                   '4' => {
                                                            'name' => 'power_mode',
                                                            'offset' => '72',
                                                            'type' => '52160'
                                                          },
                                                   '5' => {
                                                            'name' => 'x',
                                                            'offset' => '82',
                                                            'type' => '60'
                                                          },
                                                   '6' => {
                                                            'name' => 'y',
                                                            'offset' => '86',
                                                            'type' => '60'
                                                          },
                                                   '7' => {
                                                            'name' => 'width',
                                                            'offset' => '96',
                                                            'type' => '60'
                                                          },
                                                   '8' => {
                                                            'name' => 'height',
                                                            'offset' => '100',
                                                            'type' => '60'
                                                          },
                                                   '9' => {
                                                            'name' => 'subpixel',
                                                            'offset' => '104',
                                                            'type' => '60'
                                                          }
                                                 },
                                       'Name' => 'struct _PhoshMonitor',
                                       'Size' => '176',
                                       'Type' => 'Struct'
                                     },
                          '52569' => {
                                       'BaseType' => '52234',
                                       'Header' => 'monitor.h',
                                       'Line' => '146',
                                       'Name' => 'PhoshMonitor',
                                       'Size' => '176',
                                       'Type' => 'Typedef'
                                     },
                          '52581' => {
                                       'BaseType' => '52569',
                                       'Name' => 'PhoshMonitor*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52803' => {
                                       'BaseType' => '52815',
                                       'Header' => 'manager.h',
                                       'Line' => '15',
                                       'Name' => 'PhoshManager',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '52815' => {
                                       'Header' => 'manager.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '3359'
                                                          }
                                                 },
                                       'Name' => 'struct _PhoshManager',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '53' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '53156' => {
                                       'BaseType' => '53168',
                                       'Header' => 'monitor-manager.h',
                                       'Line' => '35',
                                       'Name' => 'PhoshMonitorManager',
                                       'Type' => 'Typedef'
                                     },
                          '53168' => {
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent',
                                                            'offset' => '0',
                                                            'type' => '419600'
                                                          },
                                                   '1' => {
                                                            'name' => 'sensor_proxy_manager',
                                                            'offset' => '64',
                                                            'type' => '421100'
                                                          },
                                                   '10' => {
                                                             'name' => 'zwlr_output_serial',
                                                             'offset' => '260',
                                                             'type' => '4232'
                                                           },
                                                   '11' => {
                                                             'name' => 'cancel',
                                                             'offset' => '274',
                                                             'type' => '22983'
                                                           },
                                                   '2' => {
                                                            'name' => 'sensor_proxy_binding',
                                                            'offset' => '72',
                                                            'type' => '70323'
                                                          },
                                                   '3' => {
                                                            'name' => 'gsd_color_proxy',
                                                            'offset' => '86',
                                                            'type' => '421953'
                                                          },
                                                   '4' => {
                                                            'name' => 'night_light_temp',
                                                            'offset' => '100',
                                                            'type' => '1932'
                                                          },
                                                   '5' => {
                                                            'name' => 'monitors',
                                                            'offset' => '114',
                                                            'type' => '2662'
                                                          },
                                                   '6' => {
                                                            'name' => 'heads',
                                                            'offset' => '128',
                                                            'type' => '2662'
                                                          },
                                                   '7' => {
                                                            'name' => 'dbus_name_id',
                                                            'offset' => '136',
                                                            'type' => '60'
                                                          },
                                                   '8' => {
                                                            'name' => 'serial',
                                                            'offset' => '146',
                                                            'type' => '60'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_primary',
                                                            'offset' => '150',
                                                            'type' => '421610'
                                                          }
                                                 },
                                       'Name' => 'struct _PhoshMonitorManager',
                                       'Size' => '120',
                                       'Source' => 'monitor-manager.c',
                                       'Type' => 'Struct'
                                     },
                          '53173' => {
                                       'BaseType' => '53156',
                                       'Name' => 'PhoshMonitorManager*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '537120' => {
                                        'BaseType' => '537132',
                                        'Header' => 'session-manager.h',
                                        'Line' => '26',
                                        'Name' => 'PhoshSessionManager',
                                        'Type' => 'Typedef'
                                      },
                          '537132' => {
                                        'Line' => '46',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '801361'
                                                           },
                                                    '1' => {
                                                             'name' => 'active',
                                                             'offset' => '64',
                                                             'type' => '1157'
                                                           },
                                                    '2' => {
                                                             'name' => 'proxy',
                                                             'offset' => '72',
                                                             'type' => '801758'
                                                           },
                                                    '3' => {
                                                             'name' => 'cancel',
                                                             'offset' => '86',
                                                             'type' => '22983'
                                                           },
                                                    '4' => {
                                                             'name' => 'priv_proxy',
                                                             'offset' => '100',
                                                             'type' => '801780'
                                                           },
                                                    '5' => {
                                                             'name' => 'dialog',
                                                             'offset' => '114',
                                                             'type' => '801067'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshSessionManager',
                                        'Size' => '80',
                                        'Source' => 'session-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '537137' => {
                                        'BaseType' => '537120',
                                        'Name' => 'PhoshSessionManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '599982' => {
                                        'Header' => 'gtkenums.h',
                                        'Line' => '197',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'GTK_ICON_SIZE_INVALID',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'GTK_ICON_SIZE_MENU',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'GTK_ICON_SIZE_SMALL_TOOLBAR',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'GTK_ICON_SIZE_LARGE_TOOLBAR',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'GTK_ICON_SIZE_BUTTON',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'GTK_ICON_SIZE_DND',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'GTK_ICON_SIZE_DIALOG',
                                                             'value' => '6'
                                                           }
                                                  },
                                        'Name' => 'enum GtkIconSize',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '60' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '606274' => {
                                        'BaseType' => '606286',
                                        'Header' => 'gtkimage.h',
                                        'Line' => '47',
                                        'Name' => 'GtkImage',
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '606286' => {
                                        'Header' => 'gtkimage.h',
                                        'Line' => '91',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'misc',
                                                             'offset' => '0',
                                                             'type' => '383778'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '64',
                                                             'type' => '606343'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkImage',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '606326' => {
                                        'BaseType' => '606338',
                                        'Header' => 'gtkimage.h',
                                        'Line' => '48',
                                        'Name' => 'GtkImagePrivate',
                                        'Type' => 'Typedef'
                                      },
                          '606338' => {
                                        'Name' => 'struct _GtkImagePrivate',
                                        'Type' => 'Struct'
                                      },
                          '606343' => {
                                        'BaseType' => '606326',
                                        'Name' => 'GtkImagePrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '606699' => {
                                        'BaseType' => '606274',
                                        'Name' => 'GtkImage*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '696689' => {
                                        'BaseType' => '696701',
                                        'Header' => 'iio-sensor-proxy-dbus.h',
                                        'Line' => '244',
                                        'Name' => 'PhoshDBusSensorProxyProxy',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '696701' => {
                                        'Header' => 'iio-sensor-proxy-dbus.h',
                                        'Line' => '248',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '168946'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '50',
                                                             'type' => '696796'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusSensorProxyProxy',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '696779' => {
                                        'BaseType' => '696791',
                                        'Header' => 'iio-sensor-proxy-dbus.h',
                                        'Line' => '246',
                                        'Name' => 'PhoshDBusSensorProxyProxyPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '696791' => {
                                        'Line' => '1764',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'qdata',
                                                             'offset' => '0',
                                                             'type' => '2652'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusSensorProxyProxyPrivate',
                                        'Size' => '8',
                                        'Source' => 'iio-sensor-proxy-dbus.c',
                                        'Type' => 'Struct'
                                      },
                          '696796' => {
                                        'BaseType' => '696779',
                                        'Name' => 'PhoshDBusSensorProxyProxyPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '70306' => {
                                       'BaseType' => '70318',
                                       'Header' => 'gbinding.h',
                                       'Line' => '41',
                                       'Name' => 'GBinding',
                                       'Type' => 'Typedef'
                                     },
                          '70318' => {
                                       'Name' => 'struct _GBinding',
                                       'Type' => 'Struct'
                                     },
                          '70323' => {
                                       'BaseType' => '70306',
                                       'Name' => 'GBinding*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '755155' => {
                                        'BaseType' => '755172',
                                        'Header' => 'gdk-pixbuf-core.h',
                                        'Line' => '89',
                                        'Name' => 'GdkPixbuf',
                                        'Type' => 'Typedef'
                                      },
                          '755172' => {
                                        'Name' => 'struct _GdkPixbuf',
                                        'Type' => 'Struct'
                                      },
                          '755290' => {
                                        'BaseType' => '755155',
                                        'Name' => 'GdkPixbuf*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '756096' => {
                                        'BaseType' => '756108',
                                        'Header' => 'notification.h',
                                        'Line' => '45',
                                        'Name' => 'PhoshNotification',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '756108' => {
                                        'Header' => 'notification.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshNotification',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '756147' => {
                                        'BaseType' => '756096',
                                        'Name' => 'PhoshNotification*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '756523' => {
                                        'BaseType' => '756536',
                                        'Header' => 'phosh-screenshot-dbus.h',
                                        'Line' => '358',
                                        'Name' => 'PhoshDBusScreenshotSkeleton',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '756536' => {
                                        'Header' => 'phosh-screenshot-dbus.h',
                                        'Line' => '362',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '296321'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '50',
                                                             'type' => '756640'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusScreenshotSkeleton',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '756622' => {
                                        'BaseType' => '756635',
                                        'Header' => 'phosh-screenshot-dbus.h',
                                        'Line' => '360',
                                        'Name' => 'PhoshDBusScreenshotSkeletonPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '756635' => {
                                        'Line' => '2453',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'properties',
                                                             'offset' => '0',
                                                             'type' => '2937'
                                                           },
                                                    '1' => {
                                                             'name' => 'changed_properties',
                                                             'offset' => '8',
                                                             'type' => '19770'
                                                           },
                                                    '2' => {
                                                             'name' => 'changed_properties_idle_source',
                                                             'offset' => '22',
                                                             'type' => '1197167'
                                                           },
                                                    '3' => {
                                                             'name' => 'context',
                                                             'offset' => '36',
                                                             'type' => '1197182'
                                                           },
                                                    '4' => {
                                                             'name' => 'lock',
                                                             'offset' => '50',
                                                             'type' => '1196487'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusScreenshotSkeletonPrivate',
                                        'Size' => '40',
                                        'Source' => 'phosh-screenshot-dbus.c',
                                        'Type' => 'Struct'
                                      },
                          '756640' => {
                                        'BaseType' => '756622',
                                        'Name' => 'PhoshDBusScreenshotSkeletonPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '756650' => {
                                        'BaseType' => '756662',
                                        'Header' => 'screenshot-manager.h',
                                        'Line' => '17',
                                        'Name' => 'PhoshScreenshotManager',
                                        'Size' => '136',
                                        'Type' => 'Typedef'
                                      },
                          '756662' => {
                                        'Line' => '85',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '756523'
                                                           },
                                                    '1' => {
                                                             'name' => 'dbus_name_id',
                                                             'offset' => '64',
                                                             'type' => '60'
                                                           },
                                                    '10' => {
                                                              'name' => 'action_names',
                                                              'offset' => '274',
                                                              'type' => '248368'
                                                            },
                                                    '11' => {
                                                              'name' => 'settings',
                                                              'offset' => '288',
                                                              'type' => '51333'
                                                            },
                                                    '12' => {
                                                              'name' => 'cancel',
                                                              'offset' => '296',
                                                              'type' => '22983'
                                                            },
                                                    '2' => {
                                                             'name' => 'wl_scm',
                                                             'offset' => '72',
                                                             'type' => '757506'
                                                           },
                                                    '3' => {
                                                             'name' => 'frames',
                                                             'offset' => '86',
                                                             'type' => '757511'
                                                           },
                                                    '4' => {
                                                             'name' => 'slurp',
                                                             'offset' => '100',
                                                             'type' => '757516'
                                                           },
                                                    '5' => {
                                                             'name' => 'fader',
                                                             'offset' => '114',
                                                             'type' => '217290'
                                                           },
                                                    '6' => {
                                                             'name' => 'fader_id',
                                                             'offset' => '128',
                                                             'type' => '2112'
                                                           },
                                                    '7' => {
                                                             'name' => 'opaque',
                                                             'offset' => '136',
                                                             'type' => '217290'
                                                           },
                                                    '8' => {
                                                             'name' => 'opaque_id',
                                                             'offset' => '150',
                                                             'type' => '2112'
                                                           },
                                                    '9' => {
                                                             'name' => 'for_clipboard',
                                                             'offset' => '260',
                                                             'type' => '755290'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshScreenshotManager',
                                        'Size' => '136',
                                        'Source' => 'screenshot-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '756893' => {
                                        'BaseType' => '756650',
                                        'Name' => 'PhoshScreenshotManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '757361' => {
                                        'Line' => '72',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'frames',
                                                             'offset' => '0',
                                                             'type' => '19770'
                                                           },
                                                    '1' => {
                                                             'name' => 'invocation',
                                                             'offset' => '8',
                                                             'type' => '296485'
                                                           },
                                                    '2' => {
                                                             'name' => 'flash',
                                                             'offset' => '22',
                                                             'type' => '1157'
                                                           },
                                                    '3' => {
                                                             'name' => 'filename',
                                                             'offset' => '36',
                                                             'type' => '2013'
                                                           },
                                                    '4' => {
                                                             'name' => 'num_outputs',
                                                             'offset' => '50',
                                                             'type' => '2112'
                                                           },
                                                    '5' => {
                                                             'name' => 'max_scale',
                                                             'offset' => '54',
                                                             'type' => '171'
                                                           },
                                                    '6' => {
                                                             'name' => 'area',
                                                             'offset' => '64',
                                                             'type' => '311835'
                                                           },
                                                    '7' => {
                                                             'name' => 'copy_to_clipboard',
                                                             'offset' => '72',
                                                             'type' => '1157'
                                                           }
                                                  },
                                        'Name' => 'struct ScreencopyFrames',
                                        'Size' => '56',
                                        'Source' => 'screenshot-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '757473' => {
                                        'BaseType' => '152',
                                        'Name' => 'char[64]',
