$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.4',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '14.2.1',
          'Headers' => {
                         'animation.h' => 1,
                         'cairo.h' => 1,
                         'calls-dbus.h' => 1,
                         'calls-manager.h' => 1,
                         'end-session-dialog.h' => 1,
                         'fader.h' => 1,
                         'garray.h' => 1,
                         'gbinding.h' => 1,
                         'gcancellable.h' => 1,
                         'gdataset.h' => 1,
                         'gdatetime.h' => 1,
                         'gdbusinterfaceskeleton.h' => 1,
                         'gdbusobjectmanagerclient.h' => 1,
                         'gdbusproxy.h' => 1,
                         'gdesktop-enums.h' => 1,
                         'gdk-pixbuf-core.h' => 1,
                         'gdktypes.h' => 1,
                         'gerror.h' => 1,
                         'ghash.h' => 1,
                         'ginputstream.h' => 1,
                         'giotypes.h' => 1,
                         'glibconfig.h' => 1,
                         'glist.h' => 1,
                         'glistmodel.h' => 1,
                         'gliststore.h' => 1,
                         'gmain.h' => 1,
                         'gnome-session-client-private-dbus.h' => 1,

                                                   'phosh_status_page_set_header@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_status_page_set_title@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_append_to_strv@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_calculate_supported_mode_scales@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_data_uri_to_pixbuf@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_escape_markup@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_file_equal@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_gesture_is_touch@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_get_icon_by_wifi_strength@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_have_gnome_software@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_matches_app_info@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_open_settings_panel@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_remove_from_strv@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_util_toggle_style_class@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_get_clock@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_get_default@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_get_type@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_local_date@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_new@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_set_default@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wall_clock_string_for_datetime@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_get_enabled@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_get_state@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_is_hotspot_master@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wifi_manager_set_hotspot_master@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wwan_has_data@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wwan_is_enabled@@LIBPHOSH_0_45_0' => 1,
                                                   'phosh_wwan_set_data_enabled@@LIBPHOSH_0_45_0' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10507' => {
                                       'BaseType' => '10519',
                                       'Header' => 'gtktypes.h',
                                       'Line' => '46',
                                       'Name' => 'GtkWidget',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '10519' => {
                                       'Header' => 'gtkwidget.h',
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '3663'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '36',
                                                            'type' => '12966'
                                                          }
                                                 },
                                       'Name' => 'struct _GtkWidget',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1128' => {
                                      'BaseType' => '152',
                                      'Header' => 'gtypes.h',
                                      'Line' => '52',
                                      'Name' => 'gchar',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1146536' => {
                                         'BaseType' => '1146549',
                                         'Header' => 'giotypes.h',
                                         'Line' => '521',
                                         'Name' => 'GDBusObjectManagerClient',
                                         'Size' => '32',
                                         'Type' => 'Typedef'
                                       },
                          '1146549' => {
                                         'Header' => 'gdbusobjectmanagerclient.h',
                                         'Line' => '40',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '3359'
                                                            },
                                                     '1' => {
                                                              'name' => 'priv',
                                                              'offset' => '36',
                                                              'type' => '1146658'
                                                            }
                                                   },
                                         'Name' => 'struct _GDBusObjectManagerClient',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '1146641' => {
                                         'BaseType' => '1146653',
                                         'Header' => 'gdbusobjectmanagerclient.h',
                                         'Line' => '38',
                                         'Name' => 'GDBusObjectManagerClientPrivate',
                                         'Type' => 'Typedef'
                                       },
                          '1146653' => {
                                         'Name' => 'struct _GDBusObjectManagerClientPrivate',
                                         'Type' => 'Struct'
                                       },
                          '1146658' => {
                                         'BaseType' => '1146641',
                                         'Name' => 'GDBusObjectManagerClientPrivate*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1157' => {
                                      'BaseType' => '159',
                                      'Header' => 'gtypes.h',
                                      'Line' => '56',
                                      'Name' => 'gboolean',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '11669' => {
                                       'BaseType' => '11681',
                                       'Header' => 'gtkwidget.h',
                                       'Line' => '66',
                                       'Name' => 'GtkWidgetPrivate',
                                       'Type' => 'Typedef'
                                     },
                          '11681' => {
                                       'Name' => 'struct _GtkWidgetPrivate',
                                       'Type' => 'Struct'
                                     },
                          '1171103' => {
                                         'BaseType' => '1171115',
                                         'Header' => 'nm-active-connection.h',
                                         'Line' => '50',
                                         'Name' => 'NMActiveConnection',
                                         'Type' => 'Typedef'
                                       },
                          '1171115' => {
                                         'Name' => 'struct _NMActiveConnection',
                                         'Type' => 'Struct'
                                       },
                          '1171137' => {
                                         'BaseType' => '1171149',
                                         'Header' => 'nm-client.h',
                                         'Line' => '164',
                                         'Name' => 'NMClient',
                                         'Type' => 'Typedef'
                                       },
                          '1171149' => {
                                         'Name' => 'struct _NMClient',
                                         'Type' => 'Struct'
                                       },
                          '1171154' => {
                                         'BaseType' => '1171137',
                                         'Name' => 'NMClient*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1171159' => {
                                         'BaseType' => '1171103',
                                         'Name' => 'NMActiveConnection*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1196613' => {
                                         'BaseType' => '1196625',
                                         'Header' => 'gthread.h',
                                         'Line' => '53',
                                         'Name' => 'GMutex',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1196625' => {
                                         'Header' => 'gthread.h',
                                         'Line' => '60',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'p',
                                                              'offset' => '0',
                                                              'type' => '190'
                                                            },
                                                     '1' => {
                                                              'name' => 'i',
                                                              'offset' => '0',
                                                              'type' => '88632'
                                                            }
                                                   },
                                         'Name' => 'union _GMutex',
                                         'Size' => '8',
                                         'Type' => 'Union'
                                       },
                          '1196837' => {
                                         'BaseType' => '1196849',
                                         'Header' => 'gmain.h',
                                         'Line' => '70',
                                         'Name' => 'GMainContext',
                                         'Type' => 'Typedef'
                                       },
                          '1196849' => {
                                         'Name' => 'struct _GMainContext',
                                         'Type' => 'Struct'
                                       },
                          '1196854' => {
                                         'BaseType' => '1196866',
                                         'Header' => 'gmain.h',
                                         'Line' => '86',
                                         'Name' => 'GSource',
                                         'Size' => '96',
                                         'Type' => 'Typedef'
                                       },
                          '1196866' => {
                                         'Header' => 'gmain.h',
                                         'Line' => '266',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'callback_data',
                                                              'offset' => '0',
                                                              'type' => '190'
                                                            },
                                                     '1' => {
                                                              'name' => 'callback_funcs',
                                                              'offset' => '8',
                                                              'type' => '1197298'
                                                            },
                                                     '10' => {
                                                               'name' => 'next',
                                                               'offset' => '114',
                                                               'type' => '1197293'
                                                             },
                                                     '11' => {
                                                               'name' => 'name',
                                                               'offset' => '128',
                                                               'type' => '2013'
                                                             },
                                                     '12' => {
                                                               'name' => 'priv',
                                                               'offset' => '136',
                                                               'type' => '1197313'
                                                             },
                                                     '2' => {
                                                              'name' => 'source_funcs',
                                                              'offset' => '22',
                                                              'type' => '1197303'
                                                            },
                                                     '3' => {
                                                              'name' => 'ref_count',
                                                              'offset' => '36',
                                                              'type' => '2112'
                                                            },
                                                     '4' => {
                                                              'name' => 'context',
                                                              'offset' => '50',
                                                              'type' => '1197308'
                                                            },
                                                     '5' => {
                                                              'name' => 'priority',
                                                              'offset' => '64',
                                                              'type' => '159'
                                                            },
                                                     '6' => {
                                                              'name' => 'flags',
                                                              'offset' => '68',
                                                              'type' => '2112'
                                                            },
                                                     '7' => {
                                                              'name' => 'source_id',
                                                              'offset' => '72',
                                                              'type' => '2112'
                                                            },
                                                     '8' => {
                                                              'name' => 'poll_fds',
                                                              'offset' => '86',
                                                              'type' => '2389'
                                                            },
                                                     '9' => {
                                                              'name' => 'prev',
                                                              'offset' => '100',
                                                              'type' => '1197293'
                                                            }
                                                   },
                                         'Name' => 'struct _GSource',
                                         'Size' => '96',
                                         'Type' => 'Struct'
                                       },
                          '1197063' => {
                                         'BaseType' => '1197075',
                                         'Header' => 'gmain.h',
                                         'Line' => '87',
                                         'Name' => 'GSourcePrivate',
                                         'Type' => 'Typedef'
                                       },
                          '1197075' => {
                                         'Name' => 'struct _GSourcePrivate',
                                         'Type' => 'Struct'
                                       },
                          '1197080' => {
                                         'BaseType' => '1197092',
                                         'Header' => 'gmain.h',
                                         'Line' => '99',
                                         'Name' => 'GSourceCallbackFuncs',
                                         'Size' => '24',
                                         'Type' => 'Typedef'
                                       },
                          '1197092' => {
                                         'Header' => 'gmain.h',
                                         'Line' => '291',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'ref',
                                                              'offset' => '0',
                                                              'type' => '19456'
                                                            },
                                                     '1' => {
                                                              'name' => 'unref',
                                                              'offset' => '8',
                                                              'type' => '19456'
                                                            },
                                                     '2' => {
                                                              'name' => 'get',
                                                              'offset' => '22',
                                                              'type' => '1197349'
                                                            }
                                                   },
                                         'Name' => 'struct _GSourceCallbackFuncs',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1197149' => {
                                         'BaseType' => '1197166',
                                         'Header' => 'gmain.h',
                                         'Line' => '157',
                                         'Name' => 'GSourceFuncs',
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '1197161' => {
                                         'BaseType' => '1197149',
                                         'Name' => 'GSourceFuncs const',
                                         'Size' => '48',
                                         'Type' => 'Const'
                                       },
                          '1197166' => {
                                         'Header' => 'gmain.h',
                                         'Line' => '398',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'prepare',
                                                              'offset' => '0',
                                                              'type' => '1197367'
                                                            },
                                                     '1' => {
                                                              'name' => 'check',
                                                              'offset' => '8',
                                                              'type' => '1197410'
                                                            },
                                                     '2' => {
                                                              'name' => 'dispatch',
                                                              'offset' => '22',
                                                              'type' => '1197443'
                                                            },
                                                     '3' => {
                                                              'name' => 'finalize',
                                                              'offset' => '36',
                                                              'type' => '1197486'
                                                            },
                                                     '4' => {
                                                              'name' => 'closure_callback',
                                                              'offset' => '50',
                                                              'type' => '19869'
                                                            },
                                                     '5' => {
                                                              'name' => 'closure_marshal',
                                                              'offset' => '64',
                                                              'type' => '1197354'
                                                            }
                                                   },
                                         'Name' => 'struct _GSourceFuncs',
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '1197277' => {
                                         'Name' => 'void(*)(GSource*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1197293'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1197293' => {
                                         'BaseType' => '1196854',
                                         'Name' => 'GSource*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197298' => {
                                         'BaseType' => '1197080',
                                         'Name' => 'GSourceCallbackFuncs*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197303' => {
                                         'BaseType' => '1197161',
                                         'Name' => 'GSourceFuncs const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197308' => {
                                         'BaseType' => '1196837',
                                         'Name' => 'GMainContext*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197313' => {
                                         'BaseType' => '1197063',
                                         'Name' => 'GSourcePrivate*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197344' => {
                                         'BaseType' => '19869',
                                         'Name' => 'GSourceFunc*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1197349' => {
                                         'Name' => 'void(*)(gpointer, GSource*, GSourceFunc*, gpointer*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '190'
                                                             },
                                                      '1' => {
                                                               'type' => '1197293'
                                                             },
                                                      '2' => {
                                                               'type' => '1197344'
                                                             },
                                                      '3' => {
                                                               'type' => '2302'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1197354' => {
                                         'BaseType' => '2307',
                                         'Header' => 'gmain.h',
                                         'Line' => '307',
                                         'Name' => 'GSourceDummyMarshal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1197367' => {
                                         'BaseType' => '1197380',
                                         'Header' => 'gmain.h',
                                         'Line' => '333',
                                         'Name' => 'GSourceFuncsPrepareFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1197380' => {
                                         'Name' => 'gboolean(*)(GSource*, gint*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1197293'
                                                             },
                                                      '1' => {
                                                               'type' => '2394'
                                                             }
                                                    },
                                         'Return' => '1157',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1197410' => {
                                         'BaseType' => '1197423',
                                         'Header' => 'gmain.h',
                                         'Line' => '354',
                                         'Name' => 'GSourceFuncsCheckFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1197423' => {
                                         'Name' => 'gboolean(*)(GSource*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1197293'
                                                             }
                                                    },
                                         'Return' => '1157',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1197443' => {
                                         'BaseType' => '1197456',
                                         'Header' => 'gmain.h',
                                         'Line' => '379',
                                         'Name' => 'GSourceFuncsDispatchFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1197456' => {
                                         'Name' => 'gboolean(*)(GSource*, GSourceFunc, gpointer)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1197293'
                                                             },
                                                      '1' => {
                                                               'type' => '19869'
                                                             },
                                                      '2' => {
                                                               'type' => '190'
                                                             }
                                                    },
                                         'Return' => '1157',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1197486' => {
                                         'BaseType' => '1197277',
                                         'Header' => 'gmain.h',
                                         'Line' => '396',
                                         'Name' => 'GSourceFuncsFinalizeFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1212' => {
                                      'BaseType' => '133',
                                      'Header' => 'gtype.h',
                                      'Line' => '427',
                                      'Name' => 'GType',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '126' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '12961' => {
                                       'BaseType' => '10507',
                                       'Name' => 'GtkWidget*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12966' => {
                                       'BaseType' => '11669',
                                       'Name' => 'GtkWidgetPrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '130998' => {
                                        'Name' => 'gboolean(*)(gpointer, gpointer)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '190'
                                                            },
                                                     '1' => {
                                                              'type' => '190'
                                                            }
                                                   },
                                        'Return' => '1157',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '133' => {
                                     'BaseType' => '53',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '83',
                                     'Name' => 'gsize',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '133328' => {
                                        'BaseType' => '133340',
                                        'Header' => 'glistmodel.h',
                                        'Line' => '38',
                                        'Name' => 'GListModel',
                                        'Type' => 'Typedef'
                                      },
                          '133340' => {
                                        'Name' => 'struct _GListModel',
                                        'Type' => 'Struct'
                                      },
                          '133345' => {
                                        'BaseType' => '133328',
                                        'Name' => 'GListModel*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133350' => {
                                        'BaseType' => '133362',
                                        'Header' => 'gliststore.h',
                                        'Line' => '38',
                                        'Name' => 'GListStore',
                                        'Type' => 'Typedef'
                                      },
                          '133362' => {
                                        'Name' => 'struct _GListStore',
                                        'Type' => 'Struct'
                                      },
                          '133379' => {
                                        'BaseType' => '133350',
                                        'Name' => 'GListStore*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133760' => {
                                        'BaseType' => '133772',
                                        'Header' => 'gtkfilterlistmodel.h',
                                        'Line' => '33',
                                        'Name' => 'GtkFilterListModel',
                                        'Type' => 'Typedef'
                                      },
                          '133772' => {
                                        'Line' => '62',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'item_type',
                                                             'offset' => '36',
                                                             'type' => '1212'
                                                           },
                                                    '2' => {
                                                             'name' => 'model',
                                                             'offset' => '50',
                                                             'type' => '133345'
                                                           },
                                                    '3' => {
                                                             'name' => 'filter_func',
                                                             'offset' => '64',
                                                             'type' => '133782'
                                                           },
                                                    '4' => {
                                                             'name' => 'user_data',
                                                             'offset' => '72',
                                                             'type' => '190'
                                                           },
                                                    '5' => {
                                                             'name' => 'user_destroy',
                                                             'offset' => '86',
                                                             'type' => '19444'
                                                           },
                                                    '6' => {
                                                             'name' => 'items',
                                                             'offset' => '100',
                                                             'type' => '3125762'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkFilterListModel',
                                        'Size' => '72',
                                        'Source' => 'gtkfilterlistmodel.c',
                                        'Type' => 'Struct'
                                      },
                          '133777' => {
                                        'BaseType' => '133760',
                                        'Name' => 'GtkFilterListModel*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133782' => {
                                        'BaseType' => '130998',
                                        'Header' => 'gtkfilterlistmodel.h',
                                        'Line' => '46',
                                        'Name' => 'GtkFilterListModelFilterFunc',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '145' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '152' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '159' => {
                                     'BaseType' => '60',
                                     'Header' => 'gtypes.h',
                                     'Line' => '55',
                                     'Name' => 'gint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '161113' => {
                                        'BaseType' => '161125',
                                        'Header' => 'status-page.h',
                                        'Line' => '14',
                                        'Name' => 'PhoshStatusPage',
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '161125' => {
                                        'Header' => 'status-page.h',
                                        'Line' => '14',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '51726'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshStatusPage',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '161574' => {
                                        'BaseType' => '161586',
                                        'Header' => 'status-page-placeholder.h',
                                        'Line' => '15',
                                        'Name' => 'PhoshStatusPagePlaceholder',
                                        'Type' => 'Typedef'
                                      },
                          '161586' => {
                                        'Line' => '37',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '51726'
                                                           },
                                                    '1' => {
                                                             'name' => 'toplevel_box',
                                                             'offset' => '72',
                                                             'type' => '384297'
                                                           },
                                                    '2' => {
                                                             'name' => 'icon',
                                                             'offset' => '86',
                                                             'type' => '606488'
                                                           },
                                                    '3' => {
                                                             'name' => 'icon_name',
                                                             'offset' => '100',
                                                             'type' => '2013'
                                                           },
                                                    '4' => {
                                                             'name' => 'title_label',
                                                             'offset' => '114',
                                                             'type' => '383817'
                                                           },
                                                    '5' => {
                                                             'name' => 'extra_widget',
                                                             'offset' => '128',
                                                             'type' => '12961'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshStatusPagePlaceholder',
                                        'Size' => '88',
                                        'Source' => 'status-page-placeholder.c',
                                        'Type' => 'Struct'
                                      },
                          '161591' => {
                                        'BaseType' => '161574',
                                        'Name' => 'PhoshStatusPagePlaceholder*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '166000' => {
                                        'BaseType' => '2297',
                                        'Name' => 'gchar**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '168903' => {
                                        'BaseType' => '168916',
                                        'Header' => 'giotypes.h',
                                        'Line' => '469',
                                        'Name' => 'GDBusProxy',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '168916' => {
                                        'Header' => 'gdbusproxy.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '36',
                                                             'type' => '169010'
                                                           }
                                                  },
                                        'Name' => 'struct _GDBusProxy',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '168993' => {
                                        'BaseType' => '169005',
                                        'Header' => 'gdbusproxy.h',
                                        'Line' => '43',
                                        'Name' => 'GDBusProxyPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '169005' => {
                                        'Name' => 'struct _GDBusProxyPrivate',
                                        'Type' => 'Struct'
                                      },
                          '169010' => {
                                        'BaseType' => '168993',
                                        'Name' => 'GDBusProxyPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '171' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '178' => {
                                     'Name' => 'double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1841858' => {
                                         'BaseType' => '159',
                                         'Header' => 'gtypes.h',
                                         'Line' => '587',
                                         'Name' => 'gatomicrefcount',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '190' => {
                                     'BaseType' => '145',
                                     'Header' => 'gtypes.h',
                                     'Line' => '109',
                                     'Name' => 'gpointer',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1912443' => {
                                         'BaseType' => '1912456',
                                         'Header' => 'calls-dbus.h',
                                         'Line' => '374',
                                         'Name' => 'PhoshCallsDBusObjectManagerClient',
                                         'Size' => '40',
                                         'Type' => 'Typedef'
                                       },
                          '1912456' => {
                                         'Header' => 'calls-dbus.h',
                                         'Line' => '378',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '1146536'
                                                            },
                                                     '1' => {
                                                              'name' => 'priv',
                                                              'offset' => '50',
                                                              'type' => '1912517'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshCallsDBusObjectManagerClient',
                                         'Size' => '40',
                                         'Type' => 'Struct'
                                       },
                          '1912499' => {
                                         'BaseType' => '1912512',
                                         'Header' => 'calls-dbus.h',
                                         'Line' => '376',
                                         'Name' => 'PhoshCallsDBusObjectManagerClientPrivate',
                                         'Type' => 'Typedef'
                                       },
                          '1912512' => {
                                         'Name' => 'struct _PhoshCallsDBusObjectManagerClientPrivate',
                                         'Type' => 'Struct'
                                       },
                          '1912517' => {
                                         'BaseType' => '1912499',
                                         'Name' => 'PhoshCallsDBusObjectManagerClientPrivate*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1912522' => {
                                         'BaseType' => '1912443',
                                         'Name' => 'PhoshCallsDBusObjectManagerClient*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '19135' => {
                                       'BaseType' => '60',
                                       'Header' => 'glibconfig.h',
                                       'Line' => '56',
                                       'Name' => 'gint32',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '191937' => {
                                        'BaseType' => '191949',
                                        'Header' => 'system-modal.h',
                                        'Line' => '15',
                                        'Name' => 'PhoshSystemModal',
                                        'Size' => '56',
                                        'Type' => 'Typedef'
                                      },
                          '191949' => {
                                        'Header' => 'system-modal.h',
                                        'Line' => '15',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '51822'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshSystemModal',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '191976' => {
                                        'BaseType' => '191988',
                                        'Header' => 'system-modal-dialog.h',
                                        'Line' => '15',
                                        'Name' => 'PhoshSystemModalDialog',
                                        'Size' => '56',
                                        'Type' => 'Typedef'
                                      },
                          '191988' => {
                                        'Header' => 'system-modal-dialog.h',
                                        'Line' => '15',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '191937'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshSystemModalDialog',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '19214' => {
                                       'BaseType' => '60',
                                       'Header' => 'glibconfig.h',
                                       'Line' => '201',
                                       'Name' => 'GPid',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '1932' => {
                                      'BaseType' => '126',
                                      'Header' => 'glibconfig.h',
                                      'Line' => '57',
                                      'Name' => 'guint32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '19389' => {
                                       'BaseType' => '19401',
                                       'Header' => 'gtypes.h',
                                       'Line' => '110',
                                       'Name' => 'gconstpointer',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '19401' => {
                                       'BaseType' => '19406',
                                       'Name' => 'void const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19406' => {
                                       'BaseType' => '1',
                                       'Name' => 'void const',
                                       'Type' => 'Const'
                                     },
                          '19444' => {
                                       'BaseType' => '19456',
                                       'Header' => 'gtypes.h',
                                       'Line' => '140',
                                       'Name' => 'GDestroyNotify',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '19456' => {
                                       'Name' => 'void(*)(gpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '190'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1951' => {
                                      'BaseType' => '46',
                                      'Header' => 'glibconfig.h',
                                      'Line' => '66',
                                      'Name' => 'gint64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19593' => {
                                       'BaseType' => '1932',
                                       'Header' => 'gquark.h',
                                       'Line' => '38',
                                       'Name' => 'GQuark',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '19605' => {
                                       'BaseType' => '19617',
                                       'Header' => 'gerror.h',
                                       'Line' => '43',
                                       'Name' => 'GError',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '19617' => {
                                       'Header' => 'gerror.h',
                                       'Line' => '45',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'domain',
                                                            'offset' => '0',
                                                            'type' => '19593'
                                                          },
                                                   '1' => {
                                                            'name' => 'code',
                                                            'offset' => '4',
                                                            'type' => '159'
                                                          },
                                                   '2' => {
                                                            'name' => 'message',
                                                            'offset' => '8',
                                                            'type' => '2297'
                                                          }
                                                 },
                                       'Name' => 'struct _GError',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1963' => {
                                      'BaseType' => '53',
                                      'Header' => 'glibconfig.h',
                                      'Line' => '67',
                                      'Name' => 'guint64',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '19670' => {
                                       'BaseType' => '19605',
                                       'Name' => 'GError*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19705' => {
                                       'BaseType' => '19717',
                                       'Header' => 'glist.h',
                                       'Line' => '39',
                                       'Name' => 'GList',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '19717' => {
                                       'Header' => 'glist.h',
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data',
                                                            'offset' => '0',
                                                            'type' => '190'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '19770'
                                                          },
                                                   '2' => {
                                                            'name' => 'prev',
                                                            'offset' => '22',
                                                            'type' => '19770'
                                                          }
                                                 },
                                       'Name' => 'struct _GList',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '19770' => {
                                       'BaseType' => '19705',
                                       'Name' => 'GList*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '19775' => {
                                       'BaseType' => '19787',
                                       'Header' => 'ghash.h',
                                       'Line' => '40',
                                       'Name' => 'GHashTable',
                                       'Type' => 'Typedef'
                                     },
                          '19787' => {
                                       'Name' => 'struct _GHashTable',
                                       'Type' => 'Struct'
                                     },
                          '19792' => {
                                       'Name' => 'gboolean(*)(gpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '190'
                                                           }
                                                  },
                                       'Return' => '1157',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '19869' => {
                                       'BaseType' => '19792',
                                       'Header' => 'gmain.h',
                                       'Line' => '199',
                                       'Name' => 'GSourceFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '19886' => {
                                       'BaseType' => '19670',
                                       'Name' => 'GError**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1999' => {
                                      'BaseType' => '126',
                                      'Header' => 'types.h',
                                      'Line' => '42',
                                      'Name' => '__uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2013' => {
                                      'BaseType' => '152',
                                      'Name' => 'char*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2025' => {
                                      'BaseType' => '152',
                                      'Name' => 'char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '2030' => {
                                      'BaseType' => '2025',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '20322' => {
                                       'BaseType' => '19775',
                                       'Name' => 'GHashTable*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2064' => {
                                      'BaseType' => '46',
                                      'Header' => 'gtypes.h',
                                      'Line' => '54',
                                      'Name' => 'glong',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2100' => {
                                      'BaseType' => '53',
                                      'Header' => 'gtypes.h',
                                      'Line' => '60',
                                      'Name' => 'gulong',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2112' => {
                                      'BaseType' => '126',
                                      'Header' => 'gtypes.h',
                                      'Line' => '61',
                                      'Name' => 'guint',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2124' => {
                                      'BaseType' => '171',
                                      'Header' => 'gtypes.h',
                                      'Line' => '63',
                                      'Name' => 'gfloat',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2143' => {
                                      'BaseType' => '178',
                                      'Header' => 'gtypes.h',
                                      'Line' => '64',
                                      'Name' => 'gdouble',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '215996' => {
                                        'Header' => 'animation.h',
                                        'Line' => '30',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PHOSH_ANIMATION_TYPE_EASE_OUT_CUBIC',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PHOSH_ANIMATION_TYPE_EASE_IN_QUINTIC',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'PHOSH_ANIMATION_TYPE_EASE_OUT_QUINTIC',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'PHOSH_ANIMATION_TYPE_EASE_OUT_BOUNCE',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum PhoshAnimationType',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '216008' => {
                                        'BaseType' => '216020',
                                        'Header' => 'animation.h',
                                        'Line' => '32',
                                        'Name' => 'PhoshAnimation',
                                        'Type' => 'Typedef'
                                      },
                          '216020' => {
                                        'Line' => '16',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ref_count',
                                                             'offset' => '0',
                                                             'type' => '1841858'
                                                           },
                                                    '1' => {
                                                             'name' => 'widget',
                                                             'offset' => '8',
                                                             'type' => '12961'
                                                           },
                                                    '10' => {
                                                              'name' => 'done_cb',
                                                              'offset' => '128',
                                                              'type' => '216058'
                                                            },
                                                    '11' => {
                                                              'name' => 'user_data',
                                                              'offset' => '136',
                                                              'type' => '190'
                                                            },
                                                    '2' => {
                                                             'name' => 'value',
                                                             'offset' => '22',
                                                             'type' => '178'
                                                           },
                                                    '3' => {
                                                             'name' => 'value_from',
                                                             'offset' => '36',
                                                             'type' => '178'
                                                           },
                                                    '4' => {
                                                             'name' => 'value_to',
                                                             'offset' => '50',
                                                             'type' => '178'
                                                           },
                                                    '5' => {
                                                             'name' => 'duration',
                                                             'offset' => '64',
                                                             'type' => '1951'
                                                           },
                                                    '6' => {
                                                             'name' => 'type',
                                                             'offset' => '72',
                                                             'type' => '215996'
                                                           },
                                                    '7' => {
                                                             'name' => 'start_time',
                                                             'offset' => '86',
                                                             'type' => '1951'
                                                           },
                                                    '8' => {
                                                             'name' => 'tick_cb_id',
                                                             'offset' => '100',
                                                             'type' => '2112'
                                                           },
                                                    '9' => {
                                                             'name' => 'value_cb',
                                                             'offset' => '114',
                                                             'type' => '216025'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshAnimation',
                                        'Size' => '96',
                                        'Source' => 'animation.c',
                                        'Type' => 'Struct'
                                      },
                          '216025' => {
                                        'BaseType' => '216037',
                                        'Header' => 'animation.h',
                                        'Line' => '34',
                                        'Name' => 'PhoshAnimationValueCallback',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '216037' => {
                                        'Name' => 'void(*)(double, gpointer)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '178'
                                                            },
                                                     '1' => {
                                                              'type' => '190'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '216058' => {
                                        'BaseType' => '19456',
                                        'Header' => 'animation.h',
                                        'Line' => '36',
                                        'Name' => 'PhoshAnimationDoneCallback',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '216070' => {
                                        'BaseType' => '216008',
                                        'Name' => 'PhoshAnimation*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2166134' => {
                                         'BaseType' => '2166146',
                                         'Header' => 'lfb-event.h',
                                         'Line' => '55',
                                         'Name' => 'LfbEvent',
                                         'Type' => 'Typedef'
                                       },
                          '2166146' => {
                                         'Name' => 'struct _LfbEvent',
                                         'Type' => 'Struct'
                                       },
                          '2166163' => {
                                         'BaseType' => '2166134',
                                         'Name' => 'LfbEvent*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '217047' => {
                                        'BaseType' => '217059',
                                        'Header' => 'fader.h',
                                        'Line' => '16',
                                        'Name' => 'PhoshFader',
                                        'Size' => '88',
                                        'Type' => 'Typedef'
                                      },
                          '217059' => {
                                        'Line' => '39',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '51822'
                                                           },
                                                    '1' => {
                                                             'name' => 'monitor',
                                                             'offset' => '86',
                                                             'type' => '52550'
                                                           },
                                                    '2' => {
                                                             'name' => 'style_class',
                                                             'offset' => '100',
                                                             'type' => '2013'
                                                           },
                                                    '3' => {
                                                             'name' => 'fadeout',
                                                             'offset' => '114',
                                                             'type' => '216070'
                                                           },
                                                    '4' => {
                                                             'name' => 'fade_out_time',
                                                             'offset' => '128',
                                                             'type' => '2112'
                                                           },
                                                    '5' => {
                                                             'name' => 'fade_out_type',
                                                             'offset' => '132',
                                                             'type' => '215996'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshFader',
                                        'Size' => '88',
                                        'Source' => 'fader.c',
                                        'Type' => 'Struct'
                                      },
                          '217187' => {
                                        'BaseType' => '217047',
                                        'Name' => 'PhoshFader*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2193' => {
                                      'BaseType' => '2205',
                                      'Header' => 'garray.h',
                                      'Line' => '39',
                                      'Name' => 'GArray',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '2205' => {
                                      'Header' => 'garray.h',
                                      'Line' => '43',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '2297'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '8',
                                                           'type' => '2112'
                                                         }
                                                },
                                      'Name' => 'struct _GArray',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '222816' => {
                                        'BaseType' => '222828',
                                        'Header' => 'gdatetime.h',
                                        'Line' => '122',
                                        'Name' => 'GDateTime',
                                        'Type' => 'Typedef'
                                      },
                          '222828' => {
                                        'Name' => 'struct _GDateTime',
                                        'Type' => 'Struct'
                                      },
                          '222997' => {
                                        'BaseType' => '222816',
                                        'Name' => 'GDateTime*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2245' => {
                                      'BaseType' => '2257',
                                      'Header' => 'garray.h',
                                      'Line' => '41',
                                      'Name' => 'GPtrArray',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '225016' => {
                                        'Header' => 'gdesktop-enums.h',
                                        'Line' => '83',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'G_DESKTOP_CLOCK_FORMAT_24H',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'G_DESKTOP_CLOCK_FORMAT_12H',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum GDesktopClockFormat',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '225028' => {
                                        'BaseType' => '225040',
                                        'Header' => 'wall-clock.h',
                                        'Line' => '18',
                                        'Name' => 'PhoshWallClock',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '225040' => {
                                        'Header' => 'wall-clock.h',
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshWallClock',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '225236' => {
                                        'BaseType' => '225028',
                                        'Name' => 'PhoshWallClock*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2257' => {
                                      'Header' => 'garray.h',
                                      'Line' => '55',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pdata',
                                                           'offset' => '0',
                                                           'type' => '2302'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '8',
                                                           'type' => '2112'
                                                         }
                                                },
                                      'Name' => 'struct _GPtrArray',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '22854' => {
                                       'BaseType' => '22866',
                                       'Header' => 'giotypes.h',
                                       'Line' => '35',
                                       'Name' => 'GAppInfo',
                                       'Type' => 'Typedef'
                                     },
                          '22866' => {
                                       'Name' => 'struct _GAppInfo',
                                       'Type' => 'Struct'
                                     },
                          '22888' => {
                                       'BaseType' => '22900',
                                       'Header' => 'giotypes.h',
                                       'Line' => '40',
                                       'Name' => 'GCancellable',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '22900' => {
                                       'Header' => 'gcancellable.h',
                                       'Line' => '44',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '3359'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '36',
                                                            'type' => '23070'
                                                          }
                                                 },
                                       'Name' => 'struct _GCancellable',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '2297' => {
                                      'BaseType' => '1128',
                                      'Name' => 'gchar*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '22983' => {
                                       'BaseType' => '22888',
                                       'Name' => 'GCancellable*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22993' => {
                                       'BaseType' => '23006',
                                       'Header' => 'giotypes.h',
                                       'Line' => '468',
                                       'Name' => 'GDBusConnection',
                                       'Type' => 'Typedef'
                                     },
                          '23006' => {
                                       'Name' => 'struct _GDBusConnection',
                                       'Type' => 'Struct'
                                     },
                          '2302' => {
                                      'BaseType' => '190',
                                      'Name' => 'gpointer*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '23033' => {
                                       'BaseType' => '22854',
                                       'Name' => 'GAppInfo*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23048' => {
                                       'BaseType' => '22993',
                                       'Name' => 'GDBusConnection*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23053' => {
                                       'BaseType' => '23065',
                                       'Header' => 'gcancellable.h',
                                       'Line' => '42',
                                       'Name' => 'GCancellablePrivate',
                                       'Type' => 'Typedef'
                                     },
                          '23065' => {
                                       'Name' => 'struct _GCancellablePrivate',
                                       'Type' => 'Struct'
                                     },
                          '2307' => {
                                      'Name' => 'void(*)()',
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '23070' => {
                                       'BaseType' => '23053',
                                       'Name' => 'GCancellablePrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2320' => {
                                      'BaseType' => '2332',
                                      'Header' => 'gdataset.h',
                                      'Line' => '38',
                                      'Name' => 'GData',
                                      'Type' => 'Typedef'
                                    },
                          '2332' => {
                                      'Name' => 'struct _GData',
                                      'Type' => 'Struct'
                                    },
                          '2337' => {
                                      'BaseType' => '2349',
                                      'Header' => 'gslist.h',
                                      'Line' => '39',
                                      'Name' => 'GSList',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '2349' => {
                                      'Header' => 'gslist.h',
                                      'Line' => '41',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '190'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '2389'
                                                         }
                                                },
                                      'Name' => 'struct _GSList',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '23842' => {
                                       'BaseType' => '23854',
                                       'Header' => 'shell.h',
                                       'Line' => '20',
                                       'Name' => 'PhoshShell',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '23854' => {
                                       'Header' => 'shell.h',
                                       'Line' => '20',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '3359'
                                                          }
                                                 },
                                       'Name' => 'struct _PhoshShell',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '23881' => {
                                       'BaseType' => '23842',
                                       'Name' => 'PhoshShell*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2389' => {
                                      'BaseType' => '2337',
                                      'Name' => 'GSList*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2394' => {
                                      'BaseType' => '159',
                                      'Name' => 'gint*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '248265' => {
                                        'BaseType' => '166000',
                                        'Header' => 'gstrfuncs.h',
                                        'Line' => '354',
                                        'Name' => 'GStrv',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '2496244' => {
                                         'BaseType' => '2496256',
                                         'Header' => 'quick-setting.h',
                                         'Line' => '15',
                                         'Name' => 'PhoshQuickSetting',
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '2496256' => {
                                         'Header' => 'quick-setting.h',
                                         'Line' => '15',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '262161'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshQuickSetting',
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '2496283' => {
                                         'BaseType' => '2496244',
                                         'Name' => 'PhoshQuickSetting*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2559617' => {
                                         'BaseType' => '161113',
                                         'Name' => 'PhoshStatusPage*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '262161' => {
                                        'BaseType' => '262173',
                                        'Header' => 'gtkbox.h',
                                        'Line' => '47',
                                        'Name' => 'GtkBox',
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '262173' => {
                                        'Header' => 'gtkbox.h',
                                        'Line' => '51',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'container',
                                                             'offset' => '0',
                                                             'type' => '51652'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '64',
                                                             'type' => '262230'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkBox',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '262213' => {
                                        'BaseType' => '262225',
                                        'Header' => 'gtkbox.h',
                                        'Line' => '48',
                                        'Name' => 'GtkBoxPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '262225' => {
                                        'Name' => 'struct _GtkBoxPrivate',
                                        'Type' => 'Struct'
                                      },
                          '262230' => {
                                        'BaseType' => '262213',
                                        'Name' => 'GtkBoxPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '262348' => {
                                        'BaseType' => '262360',
                                        'Header' => 'gtkgesturesingle.h',
                                        'Line' => '39',
                                        'Name' => 'GtkGestureSingle',
                                        'Type' => 'Typedef'
                                      },
                          '262360' => {
                                        'Name' => 'struct _GtkGestureSingle',
                                        'Type' => 'Struct'
                                      },
                          '262555' => {
                                        'BaseType' => '262348',
                                        'Name' => 'GtkGestureSingle*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2652' => {
                                      'BaseType' => '2320',
                                      'Name' => 'GData*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2657' => {
                                      'BaseType' => '2193',
                                      'Name' => 'GArray*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2662' => {
                                      'BaseType' => '2245',
                                      'Name' => 'GPtrArray*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2680' => {
                                      'BaseType' => '2698',
                                      'Header' => 'gtype.h',
                                      'Line' => '431',
                                      'Name' => 'GValue',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '2684455' => {
                                         'Header' => 'nm-dbus-interface.h',
                                         'Line' => '811',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'NM_ACTIVE_CONNECTION_STATE_UNKNOWN',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'NM_ACTIVE_CONNECTION_STATE_ACTIVATING',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'NM_ACTIVE_CONNECTION_STATE_ACTIVATED',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'NM_ACTIVE_CONNECTION_STATE_DEACTIVATING',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'NM_ACTIVE_CONNECTION_STATE_DEACTIVATED',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum NMActiveConnectionState',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '2698' => {
                                      'Header' => 'gvalue.h',
                                      'Line' => '113',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_type',
                                                           'offset' => '0',
                                                           'type' => '1212'
                                                         },
                                                  '1' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '3056'
                                                         }
                                                },
                                      'Name' => 'struct _GValue',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '2738' => {
                                      'BaseType' => '2751',
                                      'Header' => 'gtype.h',
                                      'Line' => '434',
                                      'Name' => 'GTypeClass',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2751' => {
                                      'Header' => 'gtype.h',
                                      'Line' => '451',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_type',
                                                           'offset' => '0',
                                                           'type' => '1212'
                                                         }
                                                },
                                      'Name' => 'struct _GTypeClass',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '2780' => {
                                      'BaseType' => '2793',
                                      'Header' => 'gtype.h',
                                      'Line' => '436',
                                      'Name' => 'GTypeInstance',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2793' => {
                                      'Header' => 'gtype.h',
                                      'Line' => '461',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_class',
                                                           'offset' => '0',
                                                           'type' => '2822'
                                                         }
                                                },
                                      'Name' => 'struct _GTypeInstance',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '2822' => {
                                      'BaseType' => '2738',
                                      'Name' => 'GTypeClass*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2823025' => {
                                         'BaseType' => '2823037',
                                         'Header' => 'nm-access-point.h',
                                         'Line' => '46',
                                         'Name' => 'NMAccessPoint',
                                         'Type' => 'Typedef'
                                       },
                          '2823037' => {
                                         'Name' => 'struct _NMAccessPoint',
                                         'Type' => 'Struct'
                                       },
                          '2823098' => {
                                         'BaseType' => '2823025',
                                         'Name' => 'NMAccessPoint*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '2937' => {
                                      'BaseType' => '2680',
                                      'Name' => 'GValue*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2947' => {
                                      'Header' => 'gvalue.h',
                                      'Line' => '119',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'v_int',
                                                           'offset' => '0',
                                                           'type' => '159'
                                                         },
                                                  '1' => {
                                                           'name' => 'v_uint',
                                                           'offset' => '0',
                                                           'type' => '2112'
                                                         },
                                                  '2' => {
                                                           'name' => 'v_long',
                                                           'offset' => '0',
                                                           'type' => '2064'
                                                         },
                                                  '3' => {
                                                           'name' => 'v_ulong',
                                                           'offset' => '0',
                                                           'type' => '2100'
                                                         },
                                                  '4' => {
                                                           'name' => 'v_int64',
                                                           'offset' => '0',
                                                           'type' => '1951'
                                                         },
                                                  '5' => {
                                                           'name' => 'v_uint64',
                                                           'offset' => '0',
                                                           'type' => '1963'
                                                         },
                                                  '6' => {
                                                           'name' => 'v_float',
                                                           'offset' => '0',
                                                           'type' => '2124'
                                                         },
                                                  '7' => {
                                                           'name' => 'v_double',
                                                           'offset' => '0',
                                                           'type' => '2143'
                                                         },
                                                  '8' => {
                                                           'name' => 'v_pointer',
                                                           'offset' => '0',
                                                           'type' => '190'
                                                         }
                                                },
                                      'Name' => 'anon-union-gvalue.h-119',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '296200' => {
                                        'BaseType' => '296213',
                                        'Header' => 'giotypes.h',
                                        'Line' => '470',
                                        'Name' => 'GDBusMethodInvocation',
                                        'Type' => 'Typedef'
                                      },
                          '296213' => {
                                        'Name' => 'struct _GDBusMethodInvocation',
                                        'Type' => 'Struct'
                                      },
                          '296218' => {
                                        'BaseType' => '296231',
                                        'Header' => 'giotypes.h',
                                        'Line' => '516',
                                        'Name' => 'GDBusInterfaceSkeleton',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '296231' => {
                                        'Header' => 'gdbusinterfaceskeleton.h',
                                        'Line' => '40',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '36',
                                                             'type' => '296404'
                                                           }
                                                  },
                                        'Name' => 'struct _GDBusInterfaceSkeleton',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '296382' => {
                                        'BaseType' => '296200',
                                        'Name' => 'GDBusMethodInvocation*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '296387' => {
                                        'BaseType' => '296399',
                                        'Header' => 'gdbusinterfaceskeleton.h',
                                        'Line' => '38',
                                        'Name' => 'GDBusInterfaceSkeletonPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '296399' => {
                                        'Name' => 'struct _GDBusInterfaceSkeletonPrivate',
                                        'Type' => 'Struct'
                                      },
                          '296404' => {
                                        'BaseType' => '296387',
                                        'Name' => 'GDBusInterfaceSkeletonPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2977933' => {
                                         'Header' => 'notification.h',
                                         'Line' => '23',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'PHOSH_NOTIFICATION_URGENCY_LOW',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'PHOSH_NOTIFICATION_URGENCY_NORMAL',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'PHOSH_NOTIFICATION_URGENCY_CRITICAL',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum PhoshNotificationUrgency',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '3056' => {
                                      'BaseType' => '2947',
                                      'Name' => 'anon-union-gvalue.h-119[2]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '3061785' => {
                                         'BaseType' => '3061798',
                                         'Header' => 'notify-dbus.h',
                                         'Line' => '295',
                                         'Name' => 'PhoshNotifyDBusNotificationsSkeleton',
                                         'Size' => '40',
                                         'Type' => 'Typedef'
                                       },
                          '3061798' => {
                                         'Header' => 'notify-dbus.h',
                                         'Line' => '299',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '296218'
                                                            },
                                                     '1' => {
                                                              'name' => 'priv',
                                                              'offset' => '50',
                                                              'type' => '3061902'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshNotifyDBusNotificationsSkeleton',
                                         'Size' => '40',
                                         'Type' => 'Struct'
                                       },
                          '3061884' => {
                                         'BaseType' => '3061897',
                                         'Header' => 'notify-dbus.h',
                                         'Line' => '297',
                                         'Name' => 'PhoshNotifyDBusNotificationsSkeletonPrivate',
                                         'Type' => 'Typedef'
                                       },
                          '3061897' => {
                                         'Line' => '2034',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'properties',
                                                              'offset' => '0',
                                                              'type' => '2937'
                                                            },
                                                     '1' => {
                                                              'name' => 'changed_properties',
                                                              'offset' => '8',
                                                              'type' => '19770'
                                                            },
                                                     '2' => {
                                                              'name' => 'changed_properties_idle_source',
                                                              'offset' => '22',
                                                              'type' => '1197293'
                                                            },
                                                     '3' => {
                                                              'name' => 'context',
                                                              'offset' => '36',
                                                              'type' => '1197308'
                                                            },
                                                     '4' => {
                                                              'name' => 'lock',
                                                              'offset' => '50',
                                                              'type' => '1196613'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshNotifyDBusNotificationsSkeletonPrivate',
                                         'Size' => '40',
                                         'Source' => 'notify-dbus.c',
                                         'Type' => 'Struct'
                                       },
                          '3061902' => {
                                         'BaseType' => '3061884',
                                         'Name' => 'PhoshNotifyDBusNotificationsSkeletonPrivate*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3062109' => {
                                         'BaseType' => '3062121',
                                         'Header' => 'notify-feedback.h',
                                         'Line' => '20',
                                         'Name' => 'PhoshNotifyFeedback',
                                         'Type' => 'Typedef'
                                       },
                          '3062121' => {
                                         'Line' => '39',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent',
                                                              'offset' => '0',
                                                              'type' => '3359'
                                                            },
                                                     '1' => {
                                                              'name' => 'active_event',
                                                              'offset' => '36',
                                                              'type' => '2166163'
                                                            },
                                                     '2' => {
                                                              'name' => 'inactive_event',
                                                              'offset' => '50',
                                                              'type' => '2166163'
                                                            },
                                                     '3' => {
                                                              'name' => 'list',
                                                              'offset' => '64',
                                                              'type' => '385014'
                                                            },
                                                     '4' => {
                                                              'name' => 'settings',
                                                              'offset' => '72',
                                                              'type' => '51302'
                                                            },
                                                     '5' => {
                                                              'name' => 'wakeup_flags',
                                                              'offset' => '86',
                                                              'type' => '3088506'
                                                            },
                                                     '6' => {
                                                              'name' => 'wakeup_categories',
                                                              'offset' => '100',
                                                              'type' => '248265'
                                                            },
                                                     '7' => {
                                                              'name' => 'wakeup_min_urgency',
                                                              'offset' => '114',
                                                              'type' => '2977933'
                                                            }
                                                   },
                                         'Name' => 'struct _PhoshNotifyFeedback',
                                         'Size' => '80',
                                         'Source' => 'notify-feedback.c',
                                         'Type' => 'Struct'
                                       },
                          '3062126' => {
                                         'BaseType' => '3062109',
                                         'Name' => 'PhoshNotifyFeedback*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3062308' => {
                                         'Line' => '71',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'notification',
                                                              'offset' => '0',
                                                              'type' => '755936'
                                                            },
                                                     '1' => {
                                                              'name' => 'action',
                                                              'offset' => '8',
                                                              'type' => '2013'
                                                            }
                                                   },
                                         'Name' => 'anon-struct-notify-manager.c-71',
                                         'Size' => '16',
                                         'Source' => 'notify-manager.c',
                                         'Type' => 'Struct'
                                       },
                          '3088506' => {
                                         'Header' => 'phosh-settings-enums.h',
                                         'Line' => '57',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'PHOSH_NOTIFY_SCREEN_WAKEUP_FLAG_NONE',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'PHOSH_NOTIFY_SCREEN_WAKEUP_FLAG_ANY',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'PHOSH_NOTIFY_SCREEN_WAKEUP_FLAG_URGENCY',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'PHOSH_NOTIFY_SCREEN_WAKEUP_FLAG_CATEGORY',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum PhoshNotifyScreenWakeupFlags',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '310691' => {
                                        'BaseType' => '4476',
                                        'Name' => 'GdkRectangle const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '311721' => {
                                        'BaseType' => '310691',
                                        'Name' => 'GdkRectangle const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '311726' => {
                                        'BaseType' => '4476',
                                        'Name' => 'GdkRectangle*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '3125697' => {
                                         'BaseType' => '3125709',
                                         'Header' => 'gtkrbtreeprivate.h',
                                         'Line' => '29',
                                         'Name' => 'GtkRbTree',
                                         'Type' => 'Typedef'
                                       },
                          '3125709' => {
                                         'Line' => '33',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'ref_count',
                                                              'offset' => '0',
                                                              'type' => '2112'
                                                            },
                                                     '1' => {
                                                              'name' => 'element_size',
                                                              'offset' => '8',
                                                              'type' => '133'
                                                            },
                                                     '2' => {
                                                              'name' => 'augment_size',
                                                              'offset' => '22',
                                                              'type' => '133'
                                                            },
                                                     '3' => {
                                                              'name' => 'augment_func',
                                                              'offset' => '36',
                                                              'type' => '3125714'
                                                            },
                                                     '4' => {
                                                              'name' => 'clear_func',
                                                              'offset' => '50',
                                                              'type' => '19444'
                                                            },
                                                     '5' => {
                                                              'name' => 'clear_augment_func',
                                                              'offset' => '64',
                                                              'type' => '19444'
                                                            },
                                                     '6' => {
                                                              'name' => 'root',
                                                              'offset' => '72',
                                                              'type' => '3135194'
                                                            }
                                                   },
                                         'Name' => 'struct _GtkRbTree',
                                         'Size' => '56',
                                         'Source' => 'gtkrbtree.c',
                                         'Type' => 'Struct'
                                       },
                          '3125714' => {
                                         'BaseType' => '3125726',
                                         'Header' => 'gtkrbtreeprivate.h',
                                         'Line' => '31',
                                         'Name' => 'GtkRbTreeAugmentFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '3125726' => {
                                         'Name' => 'void(*)(GtkRbTree*, gpointer, gpointer, gpointer, gpointer)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3125762'
                                                             },
                                                      '1' => {
                                                               'type' => '190'
                                                             },
                                                      '2' => {
                                                               'type' => '190'
                                                             },
                                                      '3' => {
                                                               'type' => '190'
                                                             },
                                                      '4' => {
                                                               'type' => '190'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '3125762' => {
                                         'BaseType' => '3125697',
                                         'Name' => 'GtkRbTree*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3135112' => {
                                         'BaseType' => '3135124',
                                         'Line' => '31',
                                         'Name' => 'GtkRbNode',
                                         'Size' => '32',
                                         'Source' => 'gtkrbtree.c',
                                         'Type' => 'Typedef'
                                       },
                          '3135124' => {
                                         'Line' => '46',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'left',
                                                              'offset' => '8',
                                                              'type' => '3135194'
                                                            },
                                                     '1' => {
                                                              'name' => 'right',
                                                              'offset' => '22',
                                                              'type' => '3135194'
                                                            },
                                                     '2' => {
                                                              'name' => 'unnamed0',
                                                              'offset' => '36',
                                                              'type' => '3135199'
                                                            }
                                                   },
                                         'Name' => 'struct _GtkRbNode',
                                         'Size' => '32',
                                         'Source' => 'gtkrbtree.c',
                                         'Type' => 'Struct'
                                       },
                          '3135194' => {
                                         'BaseType' => '3135112',
                                         'Name' => 'GtkRbNode*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3135199' => {
                                         'Line' => '55',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_or_tree',
                                                              'offset' => '0',
                                                              'type' => '190'
                                                            },
                                                     '1' => {
                                                              'name' => 'parent',
                                                              'offset' => '0',
                                                              'type' => '3135194'
                                                            },
                                                     '2' => {
                                                              'name' => 'tree',
                                                              'offset' => '0',
                                                              'type' => '3125762'
                                                            }
                                                   },
                                         'Name' => 'anon-union-gtkrbtree.c-55',
                                         'Size' => '8',
                                         'Source' => 'gtkrbtree.c',
                                         'Type' => 'Union'
                                       },
                          '3359' => {
                                      'BaseType' => '3371',
                                      'Header' => 'gobject.h',
                                      'Line' => '192',
                                      'Name' => 'GObject',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '3371' => {
                                      'Header' => 'gobject.h',
                                      'Line' => '252',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'g_type_instance',
                                                           'offset' => '0',
                                                           'type' => '2780'
                                                         },
                                                  '1' => {
                                                           'name' => 'ref_count',
                                                           'offset' => '8',
                                                           'type' => '2112'
                                                         },
                                                  '2' => {
                                                           'name' => 'qdata',
                                                           'offset' => '22',
                                                           'type' => '2652'
                                                         }
                                                },
                                      'Name' => 'struct _GObject',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '3395626' => {
                                         'BaseType' => '3395638',
                                         'Header' => 'gtypes.h',
                                         'Line' => '114',
                                         'Name' => 'GCompareDataFunc',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '3395638' => {
                                         'Name' => 'gint(*)(gconstpointer, gconstpointer, gpointer)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '19389'
                                                             },
                                                      '1' => {
                                                               'type' => '19389'
                                                             },
                                                      '2' => {
                                                               'type' => '190'
                                                             }
                                                    },
                                         'Return' => '159',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '3411396' => {
                                         'BaseType' => '3411408',
                                         'Header' => 'gtksortlistmodel.h',
                                         'Line' => '33',
                                         'Name' => 'GtkSortListModel',
                                         'Type' => 'Typedef'
                                       },
                          '3411408' => {
                                         'Line' => '50',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'parent_instance',
                                                              'offset' => '0',
                                                              'type' => '3359'
                                                            },
                                                     '1' => {
                                                              'name' => 'item_type',
                                                              'offset' => '36',
                                                              'type' => '1212'
                                                            },
                                                     '2' => {
                                                              'name' => 'model',
                                                              'offset' => '50',
                                                              'type' => '133345'
                                                            },
                                                     '3' => {
                                                              'name' => 'sort_func',
                                                              'offset' => '64',
                                                              'type' => '3395626'
                                                            },
                                                     '4' => {
                                                              'name' => 'user_data',
                                                              'offset' => '72',
                                                              'type' => '190'
                                                            },
                                                     '5' => {
                                                              'name' => 'user_destroy',
                                                              'offset' => '86',
                                                              'type' => '19444'
                                                            },
                                                     '6' => {
                                                              'name' => 'sorted',
                                                              'offset' => '100',
                                                              'type' => '3487633'
                                                            },
                                                     '7' => {
                                                              'name' => 'unsorted',
                                                              'offset' => '114',
                                                              'type' => '3487633'
                                                            }
                                                   },
                                         'Name' => 'struct _GtkSortListModel',
                                         'Size' => '80',
                                         'Source' => 'gtksortlistmodel.c',
                                         'Type' => 'Struct'
                                       },
                          '3411413' => {
                                         'BaseType' => '3411396',
                                         'Name' => 'GtkSortListModel*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3487594' => {
                                         'BaseType' => '3487606',
                                         'Header' => 'gsequence.h',
                                         'Line' => '32',
                                         'Name' => 'GSequence',
                                         'Type' => 'Typedef'
                                       },
                          '3487606' => {
                                         'Name' => 'struct _GSequence',
                                         'Type' => 'Struct'
                                       },
                          '3487611' => {
                                         'BaseType' => '3487623',
                                         'Header' => 'gsequence.h',
                                         'Line' => '33',
                                         'Name' => 'GSequenceIter',
                                         'Type' => 'Typedef'
                                       },
                          '3487623' => {
                                         'Name' => 'struct _GSequenceNode',
                                         'Type' => 'Struct'
                                       },
                          '3487628' => {
                                         'BaseType' => '3487611',
                                         'Name' => 'GSequenceIter*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '3487633' => {
                                         'BaseType' => '3487594',
                                         'Name' => 'GSequence*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '356266' => {
                                        'Header' => 'lockscreen.h',
                                        'Line' => '27',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PHOSH_LOCKSCREEN_PAGE_INFO',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PHOSH_LOCKSCREEN_PAGE_EXTRA',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'PHOSH_LOCKSCREEN_PAGE_UNLOCK',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum PhoshLockscreenPage',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '356278' => {
                                        'BaseType' => '356290',
                                        'Header' => 'lockscreen.h',
                                        'Line' => '31',
                                        'Name' => 'PhoshLockscreen',
                                        'Size' => '56',
                                        'Type' => 'Typedef'
                                      },
                          '356290' => {
                                        'Header' => 'lockscreen.h',
                                        'Line' => '31',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '51822'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshLockscreen',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '356317' => {
                                        'BaseType' => '356278',
                                        'Name' => 'PhoshLockscreen*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '356322' => {
                                        'BaseType' => '356334',
                                        'Header' => 'lockscreen-manager.h',
                                        'Line' => '14',
                                        'Name' => 'PhoshLockscreenManager',
                                        'Size' => '64',
                                        'Type' => 'Typedef'
                                      },
                          '356334' => {
                                        'Line' => '46',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'lockscreen',
                                                             'offset' => '36',
                                                             'type' => '356317'
                                                           },
                                                    '2' => {
                                                             'name' => 'shields',
                                                             'offset' => '50',
                                                             'type' => '2662'
                                                           },
                                                    '3' => {
                                                             'name' => 'locked',
                                                             'offset' => '64',
                                                             'type' => '1157'
                                                           },
                                                    '4' => {
                                                             'name' => 'locking',
                                                             'offset' => '68',
                                                             'type' => '1157'
                                                           },
                                                    '5' => {
                                                             'name' => 'active_time',
                                                             'offset' => '72',
                                                             'type' => '1951'
                                                           },
                                                    '6' => {
                                                             'name' => 'calls_manager',
                                                             'offset' => '86',
                                                             'type' => '356501'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshLockscreenManager',
                                        'Size' => '64',
                                        'Source' => 'lockscreen-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '356474' => {
                                        'BaseType' => '356322',
                                        'Name' => 'PhoshLockscreenManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '356484' => {
                                        'BaseType' => '356496',
                                        'Header' => 'calls-manager.h',
                                        'Line' => '36',
                                        'Name' => 'PhoshCallsManager',
                                        'Type' => 'Typedef'
                                      },
                          '356496' => {
                                        'Line' => '51',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '52772'
                                                           },
                                                    '1' => {
                                                             'name' => 'present',
                                                             'offset' => '36',
                                                             'type' => '1157'
                                                           },
                                                    '2' => {
                                                             'name' => 'incoming',
                                                             'offset' => '40',
                                                             'type' => '1157'
                                                           },
                                                    '3' => {
                                                             'name' => 'active_call',
                                                             'offset' => '50',
                                                             'type' => '2013'
                                                           },
                                                    '4' => {
                                                             'name' => 'om_client',
                                                             'offset' => '64',
                                                             'type' => '1912522'
                                                           },
                                                    '5' => {
                                                             'name' => 'cancel',
                                                             'offset' => '72',
                                                             'type' => '22983'
                                                           },
                                                    '6' => {
                                                             'name' => 'calls',
                                                             'offset' => '86',
                                                             'type' => '20322'
                                                           },
                                                    '7' => {
                                                             'name' => 'calls_store',
                                                             'offset' => '100',
                                                             'type' => '133379'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshCallsManager',
                                        'Size' => '72',
                                        'Source' => 'calls-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '356501' => {
                                        'BaseType' => '356484',
                                        'Name' => 'PhoshCallsManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '3663' => {
                                      'BaseType' => '3371',
                                      'Header' => 'gobject.h',
                                      'Line' => '194',
                                      'Name' => 'GInitiallyUnowned',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '3673861' => {
                                         'Line' => '32',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'is_valid',
                                                              'offset' => '0',
                                                              'type' => '1157'
                                                            },
                                                     '1' => {
                                                              'name' => 'position',
                                                              'offset' => '4',
                                                              'type' => '2112'
                                                            },
                                                     '2' => {
                                                              'name' => 'iter',
                                                              'offset' => '8',
                                                              'type' => '3487628'
                                                            }
                                                   },
                                         'Name' => 'anon-struct-notification-list.c-32',
                                         'Size' => '16',
                                         'Source' => 'notification-list.c',
                                         'Type' => 'Struct'
                                       },
                          '383669' => {
                                        'BaseType' => '383681',
                                        'Header' => 'gtkmisc.h',
                                        'Line' => '46',
                                        'Name' => 'GtkMisc',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '383681' => {
                                        'Header' => 'gtkmisc.h',
                                        'Line' => '50',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'widget',
                                                             'offset' => '0',
                                                             'type' => '10507'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '50',
                                                             'type' => '383738'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkMisc',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '383721' => {
                                        'BaseType' => '383733',
                                        'Header' => 'gtkmisc.h',
                                        'Line' => '47',
                                        'Name' => 'GtkMiscPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '383733' => {
                                        'Name' => 'struct _GtkMiscPrivate',
                                        'Type' => 'Struct'
                                      },
                          '383738' => {
                                        'BaseType' => '383721',
                                        'Name' => 'GtkMiscPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '383743' => {
                                        'BaseType' => '383755',
                                        'Header' => 'gtklabel.h',
                                        'Line' => '46',
                                        'Name' => 'GtkLabel',
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '383755' => {
                                        'Header' => 'gtklabel.h',
                                        'Line' => '52',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'misc',
                                                             'offset' => '0',
                                                             'type' => '383669'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '64',
                                                             'type' => '383812'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkLabel',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '383795' => {
                                        'BaseType' => '383807',
                                        'Header' => 'gtklabel.h',
                                        'Line' => '47',
                                        'Name' => 'GtkLabelPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '383807' => {
                                        'Name' => 'struct _GtkLabelPrivate',
                                        'Type' => 'Struct'
                                      },
                          '383812' => {
                                        'BaseType' => '383795',
                                        'Name' => 'GtkLabelPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '383817' => {
                                        'BaseType' => '383743',
                                        'Name' => 'GtkLabel*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '384297' => {
                                        'BaseType' => '262161',
                                        'Name' => 'GtkBox*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '384997' => {
                                        'BaseType' => '385009',
                                        'Header' => 'notification-list.h',
                                        'Line' => '21',
                                        'Name' => 'PhoshNotificationList',
                                        'Type' => 'Typedef'
                                      },
                          '385009' => {
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'source_list',
                                                             'offset' => '36',
                                                             'type' => '3487633'
                                                           },
                                                    '2' => {
                                                             'name' => 'last',
                                                             'offset' => '50',
                                                             'type' => '3673861'
                                                           },
                                                    '3' => {
                                                             'name' => 'source_map',
                                                             'offset' => '72',
                                                             'type' => '20322'
                                                           },
                                                    '4' => {
                                                             'name' => 'notifications',
                                                             'offset' => '86',
                                                             'type' => '20322'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshNotificationList',
                                        'Size' => '64',
                                        'Source' => 'notification-list.c',
                                        'Type' => 'Struct'
                                      },
                          '385014' => {
                                        'BaseType' => '384997',
                                        'Name' => 'PhoshNotificationList*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '385019' => {
                                        'BaseType' => '385031',
                                        'Header' => 'notify-manager.h',
                                        'Line' => '20',
                                        'Name' => 'PhoshNotifyManager',
                                        'Type' => 'Typedef'
                                      },
                          '385031' => {
                                        'Line' => '58',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '3061785'
                                                           },
                                                    '1' => {
                                                             'name' => 'dbus_name_id',
                                                             'offset' => '64',
                                                             'type' => '60'
                                                           },
                                                    '2' => {
                                                             'name' => 'next_id',
                                                             'offset' => '68',
                                                             'type' => '2112'
                                                           },
                                                    '3' => {
                                                             'name' => 'unknown_source',
                                                             'offset' => '72',
                                                             'type' => '2112'
                                                           },
                                                    '4' => {
                                                             'name' => 'show_banners',
                                                             'offset' => '82',
                                                             'type' => '1157'
                                                           },
                                                    '5' => {
                                                             'name' => 'app_children',
                                                             'offset' => '86',
                                                             'type' => '248265'
                                                           },
                                                    '6' => {
                                                             'name' => 'settings',
                                                             'offset' => '100',
                                                             'type' => '51302'
                                                           },
                                                    '7' => {
                                                             'name' => 'unlock_notify',
                                                             'offset' => '114',
                                                             'type' => '3062308'
                                                           },
                                                    '8' => {
                                                             'name' => 'list',
                                                             'offset' => '136',
                                                             'type' => '385014'
                                                           },
                                                    '9' => {
                                                             'name' => 'feedback',
                                                             'offset' => '150',
                                                             'type' => '3062126'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshNotifyManager',
                                        'Size' => '104',
                                        'Source' => 'notify-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '385036' => {
                                        'BaseType' => '385019',
                                        'Name' => 'PhoshNotifyManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '413180' => {
                                        'BaseType' => '60',
                                        'Header' => 'types.h',
                                        'Line' => '41',
                                        'Name' => '__int32_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '413632' => {
                                        'BaseType' => '413180',
                                        'Header' => 'stdint-intn.h',
                                        'Line' => '26',
                                        'Name' => 'int32_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '418262' => {
                                        'BaseType' => '60',
                                        'Name' => 'int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '419479' => {
                                        'BaseType' => '419492',
                                        'Header' => 'phosh-display-dbus.h',
                                        'Line' => '466',
                                        'Name' => 'PhoshDBusDisplayConfigSkeleton',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '419492' => {
                                        'Header' => 'phosh-display-dbus.h',
                                        'Line' => '470',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '296218'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '50',
                                                             'type' => '419596'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusDisplayConfigSkeleton',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '419578' => {
                                        'BaseType' => '419591',
                                        'Header' => 'phosh-display-dbus.h',
                                        'Line' => '468',
                                        'Name' => 'PhoshDBusDisplayConfigSkeletonPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '419591' => {
                                        'Line' => '3534',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'properties',
                                                             'offset' => '0',
                                                             'type' => '2937'
                                                           },
                                                    '1' => {
                                                             'name' => 'changed_properties',
                                                             'offset' => '8',
                                                             'type' => '19770'
                                                           },
                                                    '2' => {
                                                             'name' => 'changed_properties_idle_source',
                                                             'offset' => '22',
                                                             'type' => '1197293'
                                                           },
                                                    '3' => {
                                                             'name' => 'context',
                                                             'offset' => '36',
                                                             'type' => '1197308'
                                                           },
                                                    '4' => {
                                                             'name' => 'lock',
                                                             'offset' => '50',
                                                             'type' => '1196613'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusDisplayConfigSkeletonPrivate',
                                        'Size' => '40',
                                        'Source' => 'phosh-display-dbus.c',
                                        'Type' => 'Struct'
                                      },
                          '419596' => {
                                        'BaseType' => '419578',
                                        'Name' => 'PhoshDBusDisplayConfigSkeletonPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '419806' => {
                                        'Header' => 'wayland-client-protocol.h',
                                        'Line' => '5705',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_NORMAL',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_90',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_180',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_270',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_FLIPPED',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_FLIPPED_90',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_FLIPPED_180',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'WL_OUTPUT_TRANSFORM_FLIPPED_270',
                                                             'value' => '7'
                                                           }
                                                  },
                                        'Name' => 'enum wl_output_transform',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '420002' => {
                                        'BaseType' => '420007',
                                        'Name' => 'struct zwlr_output_head_v1*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '420007' => {
                                        'Name' => 'struct zwlr_output_head_v1',
                                        'Type' => 'Struct'
                                      },
                          '420064' => {
                                        'BaseType' => '420069',
                                        'Name' => 'struct zwlr_output_mode_v1*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '420069' => {
                                        'Name' => 'struct zwlr_output_mode_v1',
                                        'Type' => 'Struct'
                                      },
                          '420962' => {
                                        'BaseType' => '420974',
                                        'Header' => 'sensor-proxy-manager.h',
                                        'Line' => '13',
                                        'Name' => 'PhoshSensorProxyManager',
                                        'Type' => 'Typedef'
                                      },
                          '420974' => {
                                        'Line' => '31',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '696478'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshSensorProxyManager',
                                        'Size' => '40',
                                        'Source' => 'sensor-proxy-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '420979' => {
                                        'BaseType' => '420962',
                                        'Name' => 'PhoshSensorProxyManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '421246' => {
                                        'BaseType' => '421258',
                                        'Header' => 'head-priv.h',
                                        'Line' => '21',
                                        'Name' => 'PhoshHead',
                                        'Size' => '168',
                                        'Type' => 'Typedef'
                                      },
                          '421258' => {
                                        'Header' => 'head-priv.h',
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'name',
                                                             'offset' => '36',
                                                             'type' => '2297'
                                                           },
                                                    '10' => {
                                                              'name' => 'transform',
                                                              'offset' => '132',
                                                              'type' => '419806'
                                                            },
                                                    '11' => {
                                                              'name' => 'scale',
                                                              'offset' => '136',
                                                              'type' => '178'
                                                            },
                                                    '12' => {
                                                              'name' => 'mode',
                                                              'offset' => '150',
                                                              'type' => '421752'
                                                            },
                                                    '13' => {
                                                              'name' => 'modes',
                                                              'offset' => '260',
                                                              'type' => '2662'
                                                            },
                                                    '14' => {
                                                              'name' => 'pending',
                                                              'offset' => '274',
                                                              'type' => '421651'
                                                            },
                                                    '15' => {
                                                              'name' => 'conn_type',
                                                              'offset' => '338',
                                                              'type' => '52088'
                                                            },
                                                    '16' => {
                                                              'name' => 'wlr_head',
                                                              'offset' => '352',
                                                              'type' => '420002'
                                                            },
                                                    '2' => {
                                                             'name' => 'description',
                                                             'offset' => '50',
                                                             'type' => '2297'
                                                           },
                                                    '3' => {
                                                             'name' => 'vendor',
                                                             'offset' => '64',
                                                             'type' => '2297'
                                                           },
                                                    '4' => {
                                                             'name' => 'product',
                                                             'offset' => '72',
                                                             'type' => '2297'
                                                           },
                                                    '5' => {
                                                             'name' => 'serial',
                                                             'offset' => '86',
                                                             'type' => '2297'
                                                           },
                                                    '6' => {
                                                             'name' => 'enabled',
                                                             'offset' => '100',
                                                             'type' => '1157'
                                                           },
                                                    '7' => {
                                                             'name' => 'phys',
                                                             'offset' => '104',
                                                             'type' => '421611'
                                                           },
                                                    '8' => {
                                                             'name' => 'x',
                                                             'offset' => '118',
                                                             'type' => '413632'
                                                           },
                                                    '9' => {
                                                             'name' => 'y',
                                                             'offset' => '128',
                                                             'type' => '413632'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshHead',
                                        'Size' => '168',
                                        'Type' => 'Struct'
                                      },
                          '421489' => {
                                        'BaseType' => '421246',
                                        'Name' => 'PhoshHead*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '421494' => {
                                        'Header' => 'head-priv.h',
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'wlr_mode',
                                                             'offset' => '0',
                                                             'type' => '420064'
                                                           },
                                                    '1' => {
                                                             'name' => 'head',
                                                             'offset' => '8',
                                                             'type' => '421489'
                                                           },
                                                    '2' => {
                                                             'name' => 'width',
                                                             'offset' => '22',
                                                             'type' => '413632'
                                                           },
                                                    '3' => {
                                                             'name' => 'height',
                                                             'offset' => '32',
                                                             'type' => '413632'
                                                           },
                                                    '4' => {
                                                             'name' => 'refresh',
                                                             'offset' => '36',
                                                             'type' => '413632'
                                                           },
                                                    '5' => {
                                                             'name' => 'preferred',
                                                             'offset' => '40',
                                                             'type' => '1157'
                                                           },
                                                    '6' => {
                                                             'name' => 'name',
                                                             'offset' => '50',
                                                             'type' => '2013'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshHeadMode',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '421599' => {
                                        'BaseType' => '421494',
                                        'Header' => 'head-priv.h',
                                        'Line' => '34',
                                        'Name' => 'PhoshHeadMode',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '421611' => {
                                        'Header' => 'head-priv.h',
                                        'Line' => '44',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'width',
                                                             'offset' => '0',
                                                             'type' => '413632'
                                                           },
                                                    '1' => {
                                                             'name' => 'height',
                                                             'offset' => '4',
                                                             'type' => '413632'
                                                           }
                                                  },
                                        'Name' => 'struct PhoshPhysicalSize',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '421651' => {
                                        'Header' => 'head-priv.h',
                                        'Line' => '54',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'x',
                                                             'offset' => '0',
                                                             'type' => '413632'
                                                           },
                                                    '1' => {
                                                             'name' => 'y',
                                                             'offset' => '4',
                                                             'type' => '413632'
                                                           },
                                                    '2' => {
                                                             'name' => 'transform',
                                                             'offset' => '8',
                                                             'type' => '419806'
                                                           },
                                                    '3' => {
                                                             'name' => 'mode',
                                                             'offset' => '22',
                                                             'type' => '421752'
                                                           },
                                                    '4' => {
                                                             'name' => 'scale',
                                                             'offset' => '36',
                                                             'type' => '178'
                                                           },
                                                    '5' => {
                                                             'name' => 'enabled',
                                                             'offset' => '50',
                                                             'type' => '1157'
                                                           },
                                                    '6' => {
                                                             'name' => 'seen',
                                                             'offset' => '54',
                                                             'type' => '1157'
                                                           }
                                                  },
                                        'Name' => 'struct PhoshHeadStatePending',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '421752' => {
                                        'BaseType' => '421599',
                                        'Name' => 'PhoshHeadMode*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '421815' => {
                                        'BaseType' => '421827',
                                        'Header' => 'gsd-color-dbus.h',
                                        'Line' => '26',
                                        'Name' => 'PhoshDBusColor',
                                        'Type' => 'Typedef'
                                      },
                          '421827' => {
                                        'Name' => 'struct _PhoshDBusColor',
                                        'Type' => 'Struct'
                                      },
                          '421832' => {
                                        'BaseType' => '421815',
                                        'Name' => 'PhoshDBusColor*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '4232' => {
                                      'BaseType' => '1999',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '424763' => {
                                        'BaseType' => '171',
                                        'Name' => 'float*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '4312' => {
                                      'Header' => 'cairo.h',
                                      'Line' => '532',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x',
                                                           'offset' => '0',
                                                           'type' => '60'
                                                         },
                                                  '1' => {
                                                           'name' => 'y',
                                                           'offset' => '4',
                                                           'type' => '60'
                                                         },
                                                  '2' => {
                                                           'name' => 'width',
                                                           'offset' => '8',
                                                           'type' => '60'
                                                         },
                                                  '3' => {
                                                           'name' => 'height',
                                                           'offset' => '18',
                                                           'type' => '60'
                                                         }
                                                },
                                      'Name' => 'struct _cairo_rectangle_int',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4379' => {
                                      'BaseType' => '4312',
                                      'Header' => 'cairo.h',
                                      'Line' => '535',
                                      'Name' => 'cairo_rectangle_int_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '4476' => {
                                      'BaseType' => '4379',
                                      'Header' => 'gdktypes.h',
                                      'Line' => '93',
                                      'Name' => 'GdkRectangle',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '454912' => {
                                        'BaseType' => '454924',
                                        'Header' => 'gstring.h',
                                        'Line' => '43',
                                        'Name' => 'GString',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '454924' => {
                                        'Header' => 'gstring.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'str',
                                                             'offset' => '0',
                                                             'type' => '2297'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '133'
                                                           },
                                                    '2' => {
                                                             'name' => 'allocated_len',
                                                             'offset' => '22',
                                                             'type' => '133'
                                                           }
                                                  },
                                        'Name' => 'struct _GString',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '454977' => {
                                        'BaseType' => '454912',
                                        'Name' => 'GString*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '457237' => {
                                        'BaseType' => '457249',
                                        'Header' => 'giotypes.h',
                                        'Line' => '97',
                                        'Name' => 'GInputStream',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '457249' => {
                                        'Header' => 'ginputstream.h',
                                        'Line' => '44',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '36',
                                                             'type' => '457421'
                                                           }
                                                  },
                                        'Name' => 'struct _GInputStream',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '457394' => {
                                        'BaseType' => '457237',
                                        'Name' => 'GInputStream*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '457404' => {
                                        'BaseType' => '457416',
                                        'Header' => 'ginputstream.h',
                                        'Line' => '42',
                                        'Name' => 'GInputStreamPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '457416' => {
                                        'Name' => 'struct _GInputStreamPrivate',
                                        'Type' => 'Struct'
                                      },
                          '457421' => {
                                        'BaseType' => '457404',
                                        'Name' => 'GInputStreamPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '457736' => {
                                        'BaseType' => '457748',
                                        'Header' => 'nm-device-wifi.h',
                                        'Line' => '39',
                                        'Name' => 'NMDeviceWifi',
                                        'Type' => 'Typedef'
                                      },
                          '457748' => {
                                        'Name' => 'struct _NMDeviceWifi',
                                        'Type' => 'Struct'
                                      },
                          '457753' => {
                                        'BaseType' => '457736',
                                        'Name' => 'NMDeviceWifi*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '46' => {
                                    'Name' => 'long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '51030' => {
                                       'BaseType' => '51042',
                                       'Header' => 'giotypes.h',
                                       'Line' => '62',
                                       'Name' => 'GSettings',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '51042' => {
                                       'Header' => 'gsettings.h',
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '3359'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '36',
                                                            'type' => '51307'
                                                          }
                                                 },
                                       'Name' => 'struct _GSettings',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '51134' => {
                                       'BaseType' => '51146',
                                       'Header' => 'giotypes.h',
                                       'Line' => '74',
                                       'Name' => 'GFile',
                                       'Type' => 'Typedef'
                                     },
                          '51146' => {
                                       'Name' => 'struct _GFile',
                                       'Type' => 'Struct'
                                     },
                          '51231' => {
                                       'BaseType' => '51134',
                                       'Name' => 'GFile*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51285' => {
                                       'BaseType' => '51297',
                                       'Header' => 'gsettings.h',
                                       'Line' => '44',
                                       'Name' => 'GSettingsPrivate',
                                       'Type' => 'Typedef'
                                     },
                          '51297' => {
                                       'Name' => 'struct _GSettingsPrivate',
                                       'Type' => 'Struct'
                                     },
                          '51302' => {
                                       'BaseType' => '51030',
                                       'Name' => 'GSettings*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51307' => {
                                       'BaseType' => '51285',
                                       'Name' => 'GSettingsPrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51573' => {
                                       'BaseType' => '51585',
                                       'Header' => 'gtktypes.h',
                                       'Line' => '48',
                                       'Name' => 'GtkWindow',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '51585' => {
                                       'Header' => 'gtkwindow.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bin',
                                                            'offset' => '0',
                                                            'type' => '51726'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '72',
                                                            'type' => '51817'
                                                          }
                                                 },
                                       'Name' => 'struct _GtkWindow',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '51652' => {
                                       'BaseType' => '51664',
                                       'Header' => 'gtkcontainer.h',
                                       'Line' => '45',
                                       'Name' => 'GtkContainer',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '51664' => {
                                       'Header' => 'gtkcontainer.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'widget',
                                                            'offset' => '0',
                                                            'type' => '10507'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '50',
                                                            'type' => '51721'
                                                          }
                                                 },
                                       'Name' => 'struct _GtkContainer',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '51704' => {
                                       'BaseType' => '51716',
                                       'Header' => 'gtkcontainer.h',
                                       'Line' => '46',
                                       'Name' => 'GtkContainerPrivate',
                                       'Type' => 'Typedef'
                                     },
                          '51716' => {
                                       'Name' => 'struct _GtkContainerPrivate',
                                       'Type' => 'Struct'
                                     },
                          '51721' => {
                                       'BaseType' => '51704',
                                       'Name' => 'GtkContainerPrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51726' => {
                                       'BaseType' => '51738',
                                       'Header' => 'gtkbin.h',
                                       'Line' => '45',
                                       'Name' => 'GtkBin',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '51738' => {
                                       'Header' => 'gtkbin.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'container',
                                                            'offset' => '0',
                                                            'type' => '51652'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '64',
                                                            'type' => '51795'
                                                          }
                                                 },
                                       'Name' => 'struct _GtkBin',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '51778' => {
                                       'BaseType' => '51790',
                                       'Header' => 'gtkbin.h',
                                       'Line' => '46',
                                       'Name' => 'GtkBinPrivate',
                                       'Type' => 'Typedef'
                                     },
                          '51790' => {
                                       'Name' => 'struct _GtkBinPrivate',
                                       'Type' => 'Struct'
                                     },
                          '51795' => {
                                       'BaseType' => '51778',
                                       'Name' => 'GtkBinPrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51800' => {
                                       'BaseType' => '51812',
                                       'Header' => 'gtkwindow.h',
                                       'Line' => '46',
                                       'Name' => 'GtkWindowPrivate',
                                       'Type' => 'Typedef'
                                     },
                          '51812' => {
                                       'Name' => 'struct _GtkWindowPrivate',
                                       'Type' => 'Struct'
                                     },
                          '51817' => {
                                       'BaseType' => '51800',
                                       'Name' => 'GtkWindowPrivate*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51822' => {
                                       'BaseType' => '51834',
                                       'Header' => 'layersurface.h',
                                       'Line' => '15',
                                       'Name' => 'PhoshLayerSurface',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '51834' => {
                                       'Header' => 'layersurface.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '51573'
                                                          }
                                                 },
                                       'Name' => 'struct _PhoshLayerSurface',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '51866' => {
                                       'BaseType' => '51871',
                                       'Name' => 'struct wl_output*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51871' => {
                                       'Name' => 'struct wl_output',
                                       'Type' => 'Struct'
                                     },
                          '51917' => {
                                       'BaseType' => '51922',
                                       'Name' => 'struct zwlr_gamma_control_v1*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51922' => {
                                       'Name' => 'struct zwlr_gamma_control_v1',
                                       'Type' => 'Struct'
                                     },
                          '51927' => {
                                       'BaseType' => '51932',
                                       'Name' => 'struct zwlr_output_power_v1*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51932' => {
                                       'Name' => 'struct zwlr_output_power_v1',
                                       'Type' => 'Struct'
                                     },
                          '51937' => {
                                       'BaseType' => '51942',
                                       'Name' => 'struct zxdg_output_v1*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51942' => {
                                       'Name' => 'struct zxdg_output_v1',
                                       'Type' => 'Struct'
                                     },
                          '51969' => {
                                       'Header' => 'monitor.h',
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_Unknown',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_VGA',
                                                            'value' => '1'
                                                          },
                                                   '10' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DisplayPort',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_HDMIA',
                                                             'value' => '11'
                                                           },
                                                   '12' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_HDMIB',
                                                             'value' => '12'
                                                           },
                                                   '13' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_TV',
                                                             'value' => '13'
                                                           },
                                                   '14' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_eDP',
                                                             'value' => '14'
                                                           },
                                                   '15' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_VIRTUAL',
                                                             'value' => '15'
                                                           },
                                                   '16' => {
                                                             'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DSI',
                                                             'value' => '16'
                                                           },
                                                   '2' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DVII',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DVID',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_DVIA',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_Composite',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_SVIDEO',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_LVDS',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_Component',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'PHOSH_MONITOR_CONNECTOR_TYPE_9PinDIN',
                                                            'value' => '9'
                                                          }
                                                 },
                                       'Name' => 'enum _PhoshMonitorConnectorType',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '52088' => {
                                       'BaseType' => '51969',
                                       'Header' => 'monitor.h',
                                       'Line' => '60',
                                       'Name' => 'PhoshMonitorConnectorType',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '52100' => {
                                       'Header' => 'monitor.h',
                                       'Line' => '103',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PHOSH_MONITOR_POWER_SAVE_MODE_OFF',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PHOSH_MONITOR_POWER_SAVE_MODE_ON',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum _PhoshMonitorPowerSaveMode',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '52129' => {
                                       'BaseType' => '52100',
                                       'Header' => 'monitor.h',
                                       'Line' => '106',
                                       'Name' => 'PhoshMonitorPowerSaveMode',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '52141' => {
                                       'Header' => 'monitor.h',
                                       'Line' => '122',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'x',
                                                            'offset' => '0',
                                                            'type' => '19135'
                                                          },
                                                   '1' => {
                                                            'name' => 'y',
                                                            'offset' => '4',
                                                            'type' => '19135'
                                                          },
                                                   '2' => {
                                                            'name' => 'width',
                                                            'offset' => '8',
                                                            'type' => '19135'
                                                          },
                                                   '3' => {
                                                            'name' => 'height',
                                                            'offset' => '18',
                                                            'type' => '19135'
                                                          }
                                                 },
                                       'Name' => 'struct PhoshLogicalSize',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '52203' => {
                                       'Header' => 'monitor.h',
                                       'Line' => '110',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent',
                                                            'offset' => '0',
                                                            'type' => '3359'
                                                          },
                                                   '1' => {
                                                            'name' => 'wl_output',
                                                            'offset' => '36',
                                                            'type' => '51866'
                                                          },
                                                   '10' => {
                                                             'name' => 'transform',
                                                             'offset' => '114',
                                                             'type' => '19135'
                                                           },
                                                   '11' => {
                                                             'name' => 'logical',
                                                             'offset' => '118',
                                                             'type' => '52141'
                                                           },
                                                   '12' => {
                                                             'name' => 'width_mm',
                                                             'offset' => '146',
                                                             'type' => '60'
                                                           },
                                                   '13' => {
                                                             'name' => 'height_mm',
                                                             'offset' => '150',
                                                             'type' => '60'
                                                           },
                                                   '14' => {
                                                             'name' => 'vendor',
                                                             'offset' => '260',
                                                             'type' => '2013'
                                                           },
                                                   '15' => {
                                                             'name' => 'product',
                                                             'offset' => '274',
                                                             'type' => '2013'
                                                           },
                                                   '16' => {
                                                             'name' => 'description',
                                                             'offset' => '288',
                                                             'type' => '2013'
                                                           },
                                                   '17' => {
                                                             'name' => 'modes',
                                                             'offset' => '296',
                                                             'type' => '2657'
                                                           },
                                                   '18' => {
                                                             'name' => 'current_mode',
                                                             'offset' => '310',
                                                             'type' => '2112'
                                                           },
                                                   '19' => {
                                                             'name' => 'preferred_mode',
                                                             'offset' => '320',
                                                             'type' => '2112'
                                                           },
                                                   '2' => {
                                                            'name' => 'xdg_output',
                                                            'offset' => '50',
                                                            'type' => '51937'
                                                          },
                                                   '20' => {
                                                             'name' => 'name',
                                                             'offset' => '324',
                                                             'type' => '2013'
                                                           },
                                                   '21' => {
                                                             'name' => 'conn_type',
                                                             'offset' => '338',
                                                             'type' => '52088'
                                                           },
                                                   '22' => {
                                                             'name' => 'wl_output_done',
                                                             'offset' => '342',
                                                             'type' => '1157'
                                                           },
                                                   '23' => {
                                                             'name' => 'gamma_control',
                                                             'offset' => '352',
                                                             'type' => '51917'
                                                           },
                                                   '24' => {
                                                             'name' => 'n_gamma_entries',
                                                             'offset' => '360',
                                                             'type' => '1932'
                                                           },
                                                   '3' => {
                                                            'name' => 'wlr_output_power',
                                                            'offset' => '64',
                                                            'type' => '51927'
                                                          },
                                                   '4' => {
                                                            'name' => 'power_mode',
                                                            'offset' => '72',
                                                            'type' => '52129'
                                                          },
                                                   '5' => {
                                                            'name' => 'x',
                                                            'offset' => '82',
                                                            'type' => '60'
                                                          },
                                                   '6' => {
                                                            'name' => 'y',
                                                            'offset' => '86',
                                                            'type' => '60'
                                                          },
                                                   '7' => {
                                                            'name' => 'width',
                                                            'offset' => '96',
                                                            'type' => '60'
                                                          },
                                                   '8' => {
                                                            'name' => 'height',
                                                            'offset' => '100',
                                                            'type' => '60'
                                                          },
                                                   '9' => {
                                                            'name' => 'subpixel',
                                                            'offset' => '104',
                                                            'type' => '60'
                                                          }
                                                 },
                                       'Name' => 'struct _PhoshMonitor',
                                       'Size' => '176',
                                       'Type' => 'Struct'
                                     },
                          '52538' => {
                                       'BaseType' => '52203',
                                       'Header' => 'monitor.h',
                                       'Line' => '146',
                                       'Name' => 'PhoshMonitor',
                                       'Size' => '176',
                                       'Type' => 'Typedef'
                                     },
                          '52550' => {
                                       'BaseType' => '52538',
                                       'Name' => 'PhoshMonitor*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52772' => {
                                       'BaseType' => '52784',
                                       'Header' => 'manager.h',
                                       'Line' => '15',
                                       'Name' => 'PhoshManager',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '52784' => {
                                       'Header' => 'manager.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent_instance',
                                                            'offset' => '0',
                                                            'type' => '3359'
                                                          }
                                                 },
                                       'Name' => 'struct _PhoshManager',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '53' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '53125' => {
                                       'BaseType' => '53137',
                                       'Header' => 'monitor-manager.h',
                                       'Line' => '35',
                                       'Name' => 'PhoshMonitorManager',
                                       'Type' => 'Typedef'
                                     },
                          '53137' => {
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent',
                                                            'offset' => '0',
                                                            'type' => '419479'
                                                          },
                                                   '1' => {
                                                            'name' => 'sensor_proxy_manager',
                                                            'offset' => '64',
                                                            'type' => '420979'
                                                          },
                                                   '10' => {
                                                             'name' => 'zwlr_output_serial',
                                                             'offset' => '260',
                                                             'type' => '4232'
                                                           },
                                                   '11' => {
                                                             'name' => 'cancel',
                                                             'offset' => '274',
                                                             'type' => '22983'
                                                           },
                                                   '2' => {
                                                            'name' => 'sensor_proxy_binding',
                                                            'offset' => '72',
                                                            'type' => '70280'
                                                          },
                                                   '3' => {
                                                            'name' => 'gsd_color_proxy',
                                                            'offset' => '86',
                                                            'type' => '421832'
                                                          },
                                                   '4' => {
                                                            'name' => 'night_light_temp',
                                                            'offset' => '100',
                                                            'type' => '1932'
                                                          },
                                                   '5' => {
                                                            'name' => 'monitors',
                                                            'offset' => '114',
                                                            'type' => '2662'
                                                          },
                                                   '6' => {
                                                            'name' => 'heads',
                                                            'offset' => '128',
                                                            'type' => '2662'
                                                          },
                                                   '7' => {
                                                            'name' => 'dbus_name_id',
                                                            'offset' => '136',
                                                            'type' => '60'
                                                          },
                                                   '8' => {
                                                            'name' => 'serial',
                                                            'offset' => '146',
                                                            'type' => '60'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_primary',
                                                            'offset' => '150',
                                                            'type' => '421489'
                                                          }
                                                 },
                                       'Name' => 'struct _PhoshMonitorManager',
                                       'Size' => '120',
                                       'Source' => 'monitor-manager.c',
                                       'Type' => 'Struct'
                                     },
                          '53142' => {
                                       'BaseType' => '53125',
                                       'Name' => 'PhoshMonitorManager*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '536909' => {
                                        'BaseType' => '536921',
                                        'Header' => 'session-manager.h',
                                        'Line' => '26',
                                        'Name' => 'PhoshSessionManager',
                                        'Type' => 'Typedef'
                                      },
                          '536921' => {
                                        'Line' => '46',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '801150'
                                                           },
                                                    '1' => {
                                                             'name' => 'active',
                                                             'offset' => '64',
                                                             'type' => '1157'
                                                           },
                                                    '2' => {
                                                             'name' => 'proxy',
                                                             'offset' => '72',
                                                             'type' => '801547'
                                                           },
                                                    '3' => {
                                                             'name' => 'cancel',
                                                             'offset' => '86',
                                                             'type' => '22983'
                                                           },
                                                    '4' => {
                                                             'name' => 'priv_proxy',
                                                             'offset' => '100',
                                                             'type' => '801569'
                                                           },
                                                    '5' => {
                                                             'name' => 'dialog',
                                                             'offset' => '114',
                                                             'type' => '800856'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshSessionManager',
                                        'Size' => '80',
                                        'Source' => 'session-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '536926' => {
                                        'BaseType' => '536909',
                                        'Name' => 'PhoshSessionManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '599771' => {
                                        'Header' => 'gtkenums.h',
                                        'Line' => '197',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'GTK_ICON_SIZE_INVALID',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'GTK_ICON_SIZE_MENU',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'GTK_ICON_SIZE_SMALL_TOOLBAR',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'GTK_ICON_SIZE_LARGE_TOOLBAR',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'GTK_ICON_SIZE_BUTTON',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'GTK_ICON_SIZE_DND',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'GTK_ICON_SIZE_DIALOG',
                                                             'value' => '6'
                                                           }
                                                  },
                                        'Name' => 'enum GtkIconSize',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '60' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '606063' => {
                                        'BaseType' => '606075',
                                        'Header' => 'gtkimage.h',
                                        'Line' => '47',
                                        'Name' => 'GtkImage',
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '606075' => {
                                        'Header' => 'gtkimage.h',
                                        'Line' => '91',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'misc',
                                                             'offset' => '0',
                                                             'type' => '383669'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '64',
                                                             'type' => '606132'
                                                           }
                                                  },
                                        'Name' => 'struct _GtkImage',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '606115' => {
                                        'BaseType' => '606127',
                                        'Header' => 'gtkimage.h',
                                        'Line' => '48',
                                        'Name' => 'GtkImagePrivate',
                                        'Type' => 'Typedef'
                                      },
                          '606127' => {
                                        'Name' => 'struct _GtkImagePrivate',
                                        'Type' => 'Struct'
                                      },
                          '606132' => {
                                        'BaseType' => '606115',
                                        'Name' => 'GtkImagePrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '606488' => {
                                        'BaseType' => '606063',
                                        'Name' => 'GtkImage*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '696478' => {
                                        'BaseType' => '696490',
                                        'Header' => 'iio-sensor-proxy-dbus.h',
                                        'Line' => '244',
                                        'Name' => 'PhoshDBusSensorProxyProxy',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '696490' => {
                                        'Header' => 'iio-sensor-proxy-dbus.h',
                                        'Line' => '248',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '168903'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '50',
                                                             'type' => '696585'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusSensorProxyProxy',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '696568' => {
                                        'BaseType' => '696580',
                                        'Header' => 'iio-sensor-proxy-dbus.h',
                                        'Line' => '246',
                                        'Name' => 'PhoshDBusSensorProxyProxyPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '696580' => {
                                        'Line' => '1764',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'qdata',
                                                             'offset' => '0',
                                                             'type' => '2652'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusSensorProxyProxyPrivate',
                                        'Size' => '8',
                                        'Source' => 'iio-sensor-proxy-dbus.c',
                                        'Type' => 'Struct'
                                      },
                          '696585' => {
                                        'BaseType' => '696568',
                                        'Name' => 'PhoshDBusSensorProxyProxyPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '70263' => {
                                       'BaseType' => '70275',
                                       'Header' => 'gbinding.h',
                                       'Line' => '41',
                                       'Name' => 'GBinding',
                                       'Type' => 'Typedef'
                                     },
                          '70275' => {
                                       'Name' => 'struct _GBinding',
                                       'Type' => 'Struct'
                                     },
                          '70280' => {
                                       'BaseType' => '70263',
                                       'Name' => 'GBinding*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '754944' => {
                                        'BaseType' => '754961',
                                        'Header' => 'gdk-pixbuf-core.h',
                                        'Line' => '89',
                                        'Name' => 'GdkPixbuf',
                                        'Type' => 'Typedef'
                                      },
                          '754961' => {
                                        'Name' => 'struct _GdkPixbuf',
                                        'Type' => 'Struct'
                                      },
                          '755079' => {
                                        'BaseType' => '754944',
                                        'Name' => 'GdkPixbuf*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '755885' => {
                                        'BaseType' => '755897',
                                        'Header' => 'notification.h',
                                        'Line' => '45',
                                        'Name' => 'PhoshNotification',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '755897' => {
                                        'Header' => 'notification.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '3359'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshNotification',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '755936' => {
                                        'BaseType' => '755885',
                                        'Name' => 'PhoshNotification*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '756312' => {
                                        'BaseType' => '756325',
                                        'Header' => 'phosh-screenshot-dbus.h',
                                        'Line' => '358',
                                        'Name' => 'PhoshDBusScreenshotSkeleton',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '756325' => {
                                        'Header' => 'phosh-screenshot-dbus.h',
                                        'Line' => '362',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent_instance',
                                                             'offset' => '0',
                                                             'type' => '296218'
                                                           },
                                                    '1' => {
                                                             'name' => 'priv',
                                                             'offset' => '50',
                                                             'type' => '756429'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusScreenshotSkeleton',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '756411' => {
                                        'BaseType' => '756424',
                                        'Header' => 'phosh-screenshot-dbus.h',
                                        'Line' => '360',
                                        'Name' => 'PhoshDBusScreenshotSkeletonPrivate',
                                        'Type' => 'Typedef'
                                      },
                          '756424' => {
                                        'Line' => '2453',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'properties',
                                                             'offset' => '0',
                                                             'type' => '2937'
                                                           },
                                                    '1' => {
                                                             'name' => 'changed_properties',
                                                             'offset' => '8',
                                                             'type' => '19770'
                                                           },
                                                    '2' => {
                                                             'name' => 'changed_properties_idle_source',
                                                             'offset' => '22',
                                                             'type' => '1197293'
                                                           },
                                                    '3' => {
                                                             'name' => 'context',
                                                             'offset' => '36',
                                                             'type' => '1197308'
                                                           },
                                                    '4' => {
                                                             'name' => 'lock',
                                                             'offset' => '50',
                                                             'type' => '1196613'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshDBusScreenshotSkeletonPrivate',
                                        'Size' => '40',
                                        'Source' => 'phosh-screenshot-dbus.c',
                                        'Type' => 'Struct'
                                      },
                          '756429' => {
                                        'BaseType' => '756411',
                                        'Name' => 'PhoshDBusScreenshotSkeletonPrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '756439' => {
                                        'BaseType' => '756451',
                                        'Header' => 'screenshot-manager.h',
                                        'Line' => '17',
                                        'Name' => 'PhoshScreenshotManager',
                                        'Size' => '136',
                                        'Type' => 'Typedef'
                                      },
                          '756451' => {
                                        'Line' => '85',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'parent',
                                                             'offset' => '0',
                                                             'type' => '756312'
                                                           },
                                                    '1' => {
                                                             'name' => 'dbus_name_id',
                                                             'offset' => '64',
                                                             'type' => '60'
                                                           },
                                                    '10' => {
                                                              'name' => 'action_names',
                                                              'offset' => '274',
                                                              'type' => '248265'
                                                            },
                                                    '11' => {
                                                              'name' => 'settings',
                                                              'offset' => '288',
                                                              'type' => '51302'
                                                            },
                                                    '12' => {
                                                              'name' => 'cancel',
                                                              'offset' => '296',
                                                              'type' => '22983'
                                                            },
                                                    '2' => {
                                                             'name' => 'wl_scm',
                                                             'offset' => '72',
                                                             'type' => '757295'
                                                           },
                                                    '3' => {
                                                             'name' => 'frames',
                                                             'offset' => '86',
                                                             'type' => '757300'
                                                           },
                                                    '4' => {
                                                             'name' => 'slurp',
                                                             'offset' => '100',
                                                             'type' => '757305'
                                                           },
                                                    '5' => {
                                                             'name' => 'fader',
                                                             'offset' => '114',
                                                             'type' => '217187'
                                                           },
                                                    '6' => {
                                                             'name' => 'fader_id',
                                                             'offset' => '128',
                                                             'type' => '2112'
                                                           },
                                                    '7' => {
                                                             'name' => 'opaque',
                                                             'offset' => '136',
                                                             'type' => '217187'
                                                           },
                                                    '8' => {
                                                             'name' => 'opaque_id',
                                                             'offset' => '150',
                                                             'type' => '2112'
                                                           },
                                                    '9' => {
                                                             'name' => 'for_clipboard',
                                                             'offset' => '260',
                                                             'type' => '755079'
                                                           }
                                                  },
                                        'Name' => 'struct _PhoshScreenshotManager',
                                        'Size' => '136',
                                        'Source' => 'screenshot-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '756682' => {
                                        'BaseType' => '756439',
                                        'Name' => 'PhoshScreenshotManager*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '757150' => {
                                        'Line' => '72',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'frames',
                                                             'offset' => '0',
                                                             'type' => '19770'
                                                           },
                                                    '1' => {
                                                             'name' => 'invocation',
                                                             'offset' => '8',
                                                             'type' => '296382'
                                                           },
                                                    '2' => {
                                                             'name' => 'flash',
                                                             'offset' => '22',
                                                             'type' => '1157'
                                                           },
                                                    '3' => {
                                                             'name' => 'filename',
                                                             'offset' => '36',
                                                             'type' => '2013'
                                                           },
                                                    '4' => {
                                                             'name' => 'num_outputs',
                                                             'offset' => '50',
                                                             'type' => '2112'
                                                           },
                                                    '5' => {
                                                             'name' => 'max_scale',
                                                             'offset' => '54',
                                                             'type' => '171'
                                                           },
                                                    '6' => {
                                                             'name' => 'area',
                                                             'offset' => '64',
                                                             'type' => '311726'
                                                           },
                                                    '7' => {
                                                             'name' => 'copy_to_clipboard',
                                                             'offset' => '72',
                                                             'type' => '1157'
                                                           }
                                                  },
                                        'Name' => 'struct ScreencopyFrames',
                                        'Size' => '56',
                                        'Source' => 'screenshot-manager.c',
                                        'Type' => 'Struct'
                                      },
                          '757262' => {
                                        'BaseType' => '152',
                                        'Name' => 'char[64]',
